{"url": "https://www.latimes.com/entertainment/la-et-entertainment-news-updates-paul-walker-porsche-settles-1508940377-htmlstory.html", "text": "Lupita Nyong’o relates her story of inappropriate Harvey Weinstein encounters\n\nLupita Nyong’o with her Oscar after winning Best Actress for “12 Years a Slave” at the 86th Annual Academy Awards. (Al Seib / Los Angeles Times)\n\nWith stories about women allegedly harassed by Harvey Weinstein surfacing all around her, Oscar winner Lupita Nyong’o decided she couldn’t keep her own story squashed down any longer.\n\nShe thought the things that had happened were unique to her, not a larger pattern of what she on Thursday called “sinister behavior.” She blamed herself for much of it.\n\n“I had shelved my experience with Harvey far in the recesses of my mind, joining in the conspiracy of silence that has allowed this predator to prowl for so many years,” Nyong’o wrote in an op-ed for the New York Times.\n\nThe “12 Years a Slave” actress was still at Yale School of Drama when she and Weinstein crossed paths at a 2011 awards ceremony in Berlin, where he was introduced to the then-aspiring actress as “the most powerful producer in Hollywood.” Dinner companions told her he was a good man to know in the biz, but someone to be “careful” around because he could be a bully, she wrote.\n\nThe interactions that followed between her and the producer went back and forth between seemingly appropriate and uncomfortably inappropriate, Nyong’o said.\n\nThe invitation to screen a movie with Weinstein and his children at his Connecticut home turned into a restaurant lunch where he tried to bully her into drinking alcohol, she wrote, followed by him cutting short her viewing of the movie after 15 minutes and taking her to his bedroom where he offered to give her a massage. She said she flipped the situation around.\n\n“I began to massage his back to buy myself time to figure out how to extricate myself from this undesirable situation,” the actress said. Then he wanted to take off his pants, she wrote.\n\nHe couldn’t make it to see a production she was in, but invited her to bring anyone she wanted to see a staged reading of “Finding Neverland,” one of his. Dinner followed, with her friends relegated to a non-Harvey table.\n\n“The talk was shop the whole time and Harvey held court with ease. He was charming and funny once more, and I felt confused about the discomfort I had previously experienced,” Nyong’o said.\n\nLupita N’yongo accepts the supporting actress Academy Award for her work in “12 Years a Slave” on March 2, 2014. (Robert Gauthier / Los Angeles Times)\n\nA couple of months later, he invited her to a screening of “W.E.” followed by a trip to the Tribeca Grill, which she said she assumed would be another group meal. It was not. His assistants, she said, had seemed uncomfortable as they set up the logistics with her.\n\n“Before the starters arrived, he announced: ‘Let’s cut to the chase. I have a private room upstairs where we can have the rest of our meal.’ I was stunned,” Nyong’o wrote. “I told him I preferred to eat in the restaurant. He told me not to be so naïve. If I wanted to be an actress, then I had to be willing to do this sort of thing. He said he had dated Famous Actress X and Y and look where that had gotten them.”\n\nShe declined, and his tone changed, she said. As he escorted her out, sans meal, she checked in with him to make sure they were still “good” after she’d said no.\n\nHis response, according to the actress: “‘I don’t know about your career, but you’ll be fine,’ he said. It felt like both a threat and a reassurance at the same time; of what, I couldn’t be sure.”\n\nThey didn’t cross paths again until the 2013 Toronto International Film Festival, which she was attending in support of “12 Years a Slave.”\n\n“At an after-party, he found me and evicted whoever was sitting next to me to sit beside me,” she wrote. “He said he couldn’t believe how fast I had gotten to where I was, and that he had treated me so badly in the past. He was ashamed of his actions and he promised to respect me moving forward. I said thank you and left it at that. But I made a quiet promise to myself to never ever work with Harvey Weinstein.”\n\nOur business is complicated because intimacy is part and parcel of our profession; as actors we are paid to do very intimate things in public. That’s why someone can have the audacity to invite you to their home or hotel and you show up. Lupita Nyong’o\n\nThe following year, after her Oscar win, he tried to get her in one of his films, showering her with talk of a star-vehicle film in the offing for her later if she’d first take a role in a Weinstein Co. movie she’d already turned down. She held firm.\n\nWhen she first met the now-disgraced producer, she wrote, she was “entering into a community that Harvey Weinstein had been in, and even shaped, long before I got there. He was one of the first people I met in the industry, and he told me, ‘This is the way it is.’ And wherever I looked, everyone seemed to be bracing themselves and dealing with him, unchallenged.”\n\nSince then, she said, she hasn’t encountered treatment like that from anyone else. Still, she talked about the often-blurry lines in the workplace known as Hollywood.\n\n“Our business is complicated because intimacy is part and parcel of our profession; as actors we are paid to do very intimate things in public,” wrote Nyong’o, who is now 34. “That’s why someone can have the audacity to invite you to their home or hotel and you show up. Precisely because of this we must stay vigilant and ensure that the professional intimacy is not abused.”", "images": ["https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.latimes.com/entertainment/la-et-entertainment-news-updates-october-2017-htmlstory.html", "title": "Today in Entertainment: Wendy Williams collapses during her live show; ‘House of Cards’ halts production in wake of Kevin Spacey accusations", "meta_data": {"og": {"title": "Today in Entertainment: Wendy Williams collapses during her live show; 'House of Cards' halts production in wake of Kevin Spacey accusations", "url": "https://www.latimes.com/entertainment/la-et-entertainment-news-updates-october-2017-htmlstory.html", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "url": "https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "width": 1200, "height": 630, "type": "image/jpeg", "alt": "LA Times logo"}, "description": "Here's what's new and interesting in entertainment and the arts:Wendy Williams collapses during her live showNetflix halts 'House of Cards' Season 6 production in wake of Kevin Spacey accusationsHalloween is finally here, and these celebrities have conquered itJay-Z to receive Grammy Salute to…", "site_name": "Los Angeles Times", "type": "website"}, "twitter": {"card": "summary_large_image", "description": "Here's what's new and interesting in entertainment and the arts:Wendy Williams collapses during her live showNetflix halts 'House of Cards' Season 6 production in wake of Kevin Spacey accusationsHalloween is finally here, and these celebrities have conquered itJay-Z to receive Grammy Salute to Industry Icons AwardNiall Horan's 'Flicker' helps One Direction make chart historyRose McGowan on months-old arrest warrant: 'Are they trying to silence me?'", "site": "@latimes", "title": "Today in Entertainment: Wendy Williams collapses during her live show; 'House of Cards' halts production in wake of Kevin Spacey accusations"}, "fb": {"app_id": 134435029966155, "pages": 5863113009}, "viewport": "width=device-width,initial-scale=1", "description": "Here's what's new and interesting in entertainment and the arts:Wendy Williams collapses during her live showNetflix halts 'House of Cards' Season 6 production in wake of Kevin Spacey accusationsHalloween is finally here, and these celebrities have conquered itJay-Z to receive Grammy Salute to Industry Icons AwardNiall Horan's 'Flicker' helps One Direction make chart historyRose McGowan on months-old arrest warrant: 'Are they trying to silence me?'", "brightspot.contentId": "0000016c-68c4-d4d6-a16e-eaef185a0000", "brightspot.cached": "false"}, "movies": [], "publish_date": null, "source": "https://www.latimes.com", "summary": ""}