{"url": "https://www.latimes.com/entertainment/la-et-entertainment-news-updates-kylie-jenner-pregnant-1506115950-htmlstory.html", "text": "Hugh Hefner spoke with the L.A. Times often — and always had something memorable to say\n\n(Liz O. Baylen / Los Angeles Times)\n\nUnderstanding Playboy-in-Chief Hugh Hefner’s revered — and reviled — lifestyle was often just a question or two away.\n\nThe iconoclastic publishing mogul, who died Wednesday at 91, was an open book when it came to his views on swinging ways and sexuality, particularly how his puritanical upbringing shaped his career and gave rise to the revolutionary Playboy empire.\n\nOver the years, the perennially pajama-clad Hef was interviewed often by the Los Angeles Times. Here’s a sampling of some of his memorable quotes.\n\nOn sexuality’s problematic origins in America:\n\n“Our society is fragmented,” he asserted in 1994. “Messages regarding human sexuality have always been mixed in America. We are a schizophrenic nation. We were founded initially by Puritans, who escaped repression only to establish their own. Then the founding fathers gave us the Constitution to separate church and state. But the one thing that got left out of all those laws was human sexuality.”\n\nOn the life he made for himself:\n\n“Much of my life has been like an adolescent dream of an adult life,” he told The Times in 1992. “If you were still a boy, in almost a Peter Pan kind of way, and could have just the perfect life that you wanted to have, that’s the life I invented for myself.”\n\nOBITUARY: Playboy founder Hugh Hefner, who shook up American morality with an ideal of swinging singlehood, dies at 91\n\nOn why he was so happy:\n\n“You will find in my bedroom images from long ago, little photographs and things from when I was a kid. I’m a very happy guy, and part of that has to do with my connection to my childhood,” he said in 2009.\n\nOn how he became “Hef”:\n\n“Through a lifetime, you reinvent who you are,” he explained in 2009. “I actually reinvented myself the first time when I was 16, when a girl rejected me. I started referring to myself as Hef, started changing my wardrobe — the same thing I did in 1959-1960 with the magazine, when I came out from behind the desk and started living the life and got the first Playboy mansion, started to drive a Mercedes 300SL.”\n\nOn how the 1942 film “Casablanca” led to the Playboy Club:\n\n“I think I opened the first Playboy Club because of ‘Casablanca.’ I wanted to have a place where people came to hang out as they did at Rick’s,” he said in 2010. “It has everything — not only Bogie’s charismatic character, but lost love, redemption, patriotism, humor — it had a great musical score.”\n\nOn traditional attitudes toward marriage and sex:\n\n“If you don’t commit,” he told The Times in 1994, “you don’t get hurt. I was always unwilling to commit to marriage because I was afraid to lose the romance.”\n\nOn the Playboy brand’s global status:\n\n“It has been said that the two most famous trademarks in the world are Coca-Cola and the Playboy bunny rabbit,” he said in 1994. “There is certainly no one else in our area that represents the American dream in this particular kind of way. That rabbit means economic freedom, personal freedom and political freedom. That potential is unlimited.”\n\nOn the Playboy Jazz Festival:\n\n“I’ve never found anything that I’ve cared more about than the music from my youth. I loved the Beatles, sure, but I never became — except for dancing purposes — a hard rocker. To me, there is something incredibly celebratory, and so wonderful about really good big-band swing and Dixieland,” he said in 2002.\n\n“When I started, I just wanted to put out a men’s magazine. But by the end of the ‘50s, it was so successful that I seized it as a vehicle for changing the direction of my life,” he added. “And that crucial change in my life was also associated with jazz, because it all began within a space of about six months after the first Playboy Jazz Festival in August of 1959.”\n\nHugh Hefner, founder of the Playboy empire, relaxes during a visit to England in 1966. (John Downing / Getty Images)\n\nOn his personal legacy:\n\n“One of the reasons that I have such tremendous satisfaction at this point in my life is because I know I’ve made a difference,” he said in 1994. “I’ve made a difference in a way that really matters to me.”\n\nOn publishing’s shift to digital:\n\n“I don’t sit around thinking about, ‘Gee, what happened to the new generation and they don’t read enough and why is the internet replacing books?’” he said in 2009.\n\nOn his fame and sex appeal:\n\n“I think that just as [Henry] Kissinger said, power is the ultimate aphrodisiac. Celebrity is the ultimate aphrodisiac in today’s world. And I’m lucky enough to have fallen into a unique kind of celebrity,” he said in 2009. “So against all logic, nothing else matters — age doesn’t matter. When [my last long-term] relationship ended, last year, they were climbing over the gate. ... young women. Endless numbers of young women.”\n\nALSO\n\nHugh Hefner’s life pushing boundaries started with comics\n\nHugh Hefner’s Playboy Mansion was hedonistic headquarters for his brand\n\n‘Your legacy lives on’: Hugh Hefner is remembered as an innovator, friend and supporter of civil rights", "images": ["https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.latimes.com/entertainment/la-et-entertainment-news-updates-september-2017-htmlstory.html", "title": "Today in Entertainment: Olivia de Havilland scores court victory; ‘Sex and the City 3’ gets scrapped", "meta_data": {"og": {"title": "Today in Entertainment: Olivia de Havilland scores court victory; 'Sex and the City 3' gets scrapped", "url": "https://www.latimes.com/entertainment/la-et-entertainment-news-updates-september-2017-htmlstory.html", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "url": "https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "width": 1200, "height": 630, "type": "image/jpeg", "alt": "LA Times logo"}, "description": "Here's what's new and interesting in entertainment and the arts:Lionel Richie and Luke Bryan officially join 'American Idol'Olivia de Havilland scores court victory; trial will begin Nov. 27'Sex and the City 3'? Nope, not happening, says Sarah Jessica ParkerBeyoncé goes bilingual on new remix of…", "site_name": "Los Angeles Times", "type": "website"}, "twitter": {"card": "summary_large_image", "description": "Here's what's new and interesting in entertainment and the arts:Lionel Richie and Luke Bryan officially join 'American Idol'Olivia de Havilland scores court victory; trial will begin Nov. 27'Sex and the City 3'? Nope, not happening, says Sarah Jessica ParkerBeyoncé goes bilingual on new remix of 'Mi Gente' for disaster reliefLynda Carter calls out James Cameron for his 'Wonder Woman' jabsJulia Louis-Dreyfus gets support from Joe Biden after cancer diagnosis", "site": "@latimes", "title": "Today in Entertainment: Olivia de Havilland scores court victory; 'Sex and the City 3' gets scrapped"}, "fb": {"app_id": 134435029966155, "pages": 5863113009}, "viewport": "width=device-width,initial-scale=1", "description": "Here's what's new and interesting in entertainment and the arts:Lionel Richie and Luke Bryan officially join 'American Idol'Olivia de Havilland scores court victory; trial will begin Nov. 27'Sex and the City 3'? Nope, not happening, says Sarah Jessica ParkerBeyoncé goes bilingual on new remix of 'Mi Gente' for disaster reliefLynda Carter calls out James Cameron for his 'Wonder Woman' jabsJulia Louis-Dreyfus gets support from Joe Biden after cancer diagnosis", "brightspot.contentId": "0000016c-68c4-d4d6-a16e-eaef182e0000", "brightspot.cached": "false"}, "movies": [], "publish_date": null, "source": "https://www.latimes.com", "summary": ""}