{"url": "http://www.parkerxl.com/golden-globes-2018-tv-nominations-snubs-surprises-katherine-langford-the-marvelous-mrs-maisel-kit-harington-more/", "text": "Check out the most important snubs and surprises for the 2018 Golden Globes nominations now.\n\nWe have got comedies again from the lifeless (Will & Grace), new youngsters on the town (SMILF, The Marvelous Mrs. Maisel) and royal dramas (The Crown, Recreation of Thrones) all coming in scorching on the 2018 Golden Globes. However not each present and performer will get its deserved due. We’re speaking about The Good Place, clearly, amongst different exhibits.\n\nThey (you already know, they) wish to say we’re within the golden age of TV. Meaning the Golden Globes nominations are all the time filled with loads of snubs and surprises when there are simply so many good exhibits and actors delivering nice performances on a weekly foundation.\n\nHBO SNUB: Emilia Clarke, Package Harington\n\nThe king and queen of Recreation of Thrones switched from the supporting classes to steer…however that didn’t repay for them. Might the chances ever be of their favor for the ultimate season, which in all probability is not popping out till 2019. Put together yourselves, it will be a very long time earlier than winter returns.\n\nNetflix SURPRISE: Katherine Langford\n\nThe Hollywood Overseas Press Affiliation remembered how good Katherine Langford was as Hannah Baker in thirteen Causes Why! Hurray! However critically, her efficiency within the Netflix drama was star-making.\n\nNetflix SNUB: Unbreakable Kimmy Schmidt\n\nFemales are robust as hell, simply as this comedy is. Performances from Tituss Burgess, Ellie Kemper and Jane Krakowski stay hilarious…chalk this one as much as an excessive amount of good TV?\n\nCW SNUB: Rachel Bloom, Loopy Ex-Girlfriend\n\nA earlier Golden Globe winner, Rachel Bloom stars in and co-created CW’s musical comedy. She has one Globe already, however that does not imply she should not maintain getting nominated, particularly as Loopy Ex-Girlfriend continues to be a trailblazer in what you’ll be able to accomplish in an hour on broadcast TV.\n\nChris Haston/NBC SNUB: Sean Hayes\n\nKeep in mind how Will & Grace got here again from TV heaven and was superb? The collection acquired a Greatest TV Comedy or Musical nomination, as did Eric McCormack, however what about Sean Hayes? Sean Hayes has not missed a beat and nonetheless stays an professional at bodily comedy. Youthful actors take observe!\n\nVictoria Will/Invision/AP SURPRISE: Kevin Bacon\n\nGolden Globes are all the time good to offer out a nomination to someone in a streaming collection you in all probability by no means heard of. No disrespect to Kevin Bacon or Amazon, however have you ever watched I Love Dick?\n\nNBC SNUB: Debra Messing\n\nJust one actor from the Will & Grace foursome acquired nominated, however what makes Will & Grace so particular is the foursome. So…what occurred right here?\n\nJackson Lee Davis/Netflix SNUB: Winona Ryder\n\nWinona Ryder’s efficiency as frantic mom Joyce Byers makes Stranger Issues—she’s the spine of the collection and always delivers.\n\nFX SNUB: Carrie Coon\n\nCarrie Coon might’ve been nominated for The Leftovers and/or Fargo, but she didn’t get a nod for both. How? Why? What? When will Carrie Coon get the love she deserves?!\n\nFX SURPRISE: Pamela Adlon\n\nThis can be a good shock. Pamela Adlon stars in, writes and directs Higher Issues. It is really a ardour venture and it exhibits in each episode she produces. In the event you’re not watching Higher Issues, nicely, change that.\n\nRon Batzdorff/NBC SNUB: Milo Ventimiglia, Mandy Moore\n\nThe No. 1 mother and pop on TV proper now get a whole lot of love type the followers, however apparently not from the Hollywood Overseas Press Affiliation. Randall and Kate received noms, however none for Jack and Rebecca appears fallacious. Moore is doing the most effective work of her profession with these monologues. SMH…\n\nABC SNUB: Tracee Ellis Ross\n\nTracee Ellis Ross is dynamic on black-ish. Tracee Ellis Ross not getting a Golden Globe nomination for black-ish is the other of dynamic.\n\nNetflix SURPRISE: Alison Brie\n\nGLOW was probably the greatest surprises of the summer time, simply as this nomination is among the greatest surprises of the 2018 nominations.\n\nNBC SNUB: Megan Mullally\n\nMegan Mullally’s Karen Walker is likely one of the greatest and most entertaining characters on TV. We did not understand how a lot we missed her till Will & Grace returned and now we by no means need to reside with out Karen Walker/Megan Mullally on our screens on a weekly foundation.\n\nShowtime SURPRISE: Frankie Shaw, SMILF\n\nWe should always’ve seen this coming: the Golden Globes love ladies making a splash in comedy. SMILF and its star/creator Frankie Shaw have been getting accolades on prime of accolades, the Golden Globe nomination is simply the newest.\n\nHBO SNUB: Julia Louis-Dreyfus, Veep\n\nIs that this the top of Veep‘s award present reign? The HBO comedy, which can return for a last season, was shut out on the 2018 Golden Globes. This final season wasn’t the present’s strongest, however Julia Louis-Dreyfus nonetheless turned in an skilled comedian efficiency.\n\nHulu SNUB: Alexis Bledel\n\nHey, Alexis Bledel acquired an Emmy for her position in The Handmaid’s Story, in order that’s nice. A Golden Globe nomination would’ve simply been the cherry on prime of the sundae.\n\nNBC SNUB: Kristen Bell, Ted Danson, The Good Place\n\nNBC’s afterlife comedy is likely one of the smartest exhibits on TV with Ted Danson and Kristen Bell delivering profession-redefining performances. When will the Globes and Emmys begin paying consideration? What the fork?!", "images": ["https://parkerxl.com/wp-content/uploads/2017/12/2361d54c0ef2df36_Pan_de_Pascua-7.jpg", "https://parkerxl.com/wp-content/uploads/2017/11/rs_1024x759-170810120534-1024-emilia-kit-got-hbo.jpg", "https://parkerxl.com/wp-content/uploads/2017/12/rs_800x1000-161207155918-emmastonewomeninhollywood.jpg", "https://parkerxl.com/wp-content/uploads/2020/05/ParkerXL.png", "https://parkerxl.com/wp-content/plugins/read-next-fly-box/assets//camera.jpg", "https://parkerxl.com/wp-content/uploads/2018/01/rs_634x1024-180128191256-634-Hailee-Steinfeld-Grammy-Awards-2018-Beauty-125x125.jpg"], "top_img": "https://parkerxl.com/wp-content/uploads/2017/11/rs_1024x759-170810120534-1024-emilia-kit-got-hbo.jpg", "keywords": [], "authors": [], "canonical_link": "https://parkerxl.com/golden-globes-2018-tv-nominations-snubs-surprises-katherine-langford-the-marvelous-mrs-maisel-kit-harington-more/", "title": "Golden Globes 2018 TV Nominations Snubs & Surprises: Katherine Langford, The Marvelous Mrs. Maisel, Kit Harington & More", "meta_data": {"description": "Lifestyle And Fashion Magazine From Parker XL, Get Daily Reports On Trends And Self Help.", "og": {"image": {"identifier": "https://parkerxl.com/wp-content/uploads/2017/11/rs_1024x759-170810120534-1024-emilia-kit-got-hbo.jpg", "width": 1024, "height": 759}, "url": "https://parkerxl.com/golden-globes-2018-tv-nominations-snubs-surprises-katherine-langford-the-marvelous-mrs-maisel-kit-harington-more/", "type": "article", "title": "Golden Globes 2018 TV Nominations Snubs & Surprises: Katherine Langford, The Marvelous Mrs. Maisel, Kit Harington & More - Parker XL | Lifestyle & Fashion", "description": "Lifestyle And Fashion Magazine From Parker XL, Get Daily Reports On Trends And Self Help.", "locale": "en_US", "site_name": "Parker XL | Lifestyle & Fashion", "updated_time": "2017-12-11T17:53:55+00:00"}, "robots": "index, follow", "format-detection": "telephone=no", "viewport": "width=device-width, initial-scale=1, maximum-scale=1", "article": {"section": "The Parker Report", "published_time": "2017-12-11T17:53:52+00:00", "modified_time": "2017-12-11T17:53:55+00:00", "publisher": "https://www.facebook.com/parkerxl/"}, "googlebot": "index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1", "bingbot": "index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1", "twitter": {"card": "summary", "creator": "@RealParkerXL", "site": "@RealParkerXL"}, "generator": "Powered by Slider Revolution 6.2.6 - responsive, Mobile-Friendly Slider Plugin for WordPress with comfortable drag and drop interface.", "msapplication-TileImage": "https://parkerxl.com/wp-content/uploads/2015/11/66416_Parker_XL_logo_01-e1461634559462.png"}, "movies": [], "publish_date": 1513014832.0, "source": "http://www.parkerxl.com", "summary": ""}