{"url": "https://money.usnews.com/money/personal-finance/spending/articles/2017-08-31/18-best-labor-day-sales-for-2017", "text": "Labor Day weekend is a big shopping holiday for deal hunters.\n\nLike most three-day weekends, it hosts an impressive array of sales. In addition to seeing the usual mattress and appliance deals that pop up during three-day-weekend sales, you'll find plenty of end-of-summer clearance sales on outdoor and seasonal items, such as grills and patio sets.\n\nAll the Labor Day deals below are available online. If you'd prefer not to wait for shipping, check the store's curbside pickup options.\n\nHere are some of the best Labor Day sales and deals for 2020.\n\nRead on for details about each Labor Day sale.\n\nAJ Madison\n\nThe Labor Day sale features up to 50% off select large appliances, including washers, dryers and refrigerators. The appliance retailer is also offering rebates and free shipping on select items.\n\nBest Buy\n\nShoppers can get Labor Day appliance deals through Sept. 16. Large appliance deals include up to $300 in e-gift cards with certain purchases and free delivery on appliances costing $399 or more. There are also plenty of deals on small appliances, including $100 to $150 off robotic and upright vacuums.\n\nBig Lots\n\nThe Big Labor Day Sale features up to $300 off mattresses and up to 25% off patio furniture and sofas. Plus, find buy one, get one 50% off deals on small tech items, including select headphones, speakers and more.\n\nCrate & Barrel\n\nShop the Upholstery Event until Sept. 9 to get up to 20% off beds, sofas, chairs, ottomans and more.\n\nDiscountGlasses.com and DiscountContactLenses.com\n\nThese online sellers of frames and lenses are offering Labor Day promo codes, valid from Sept. 3 to Sept. 9. On DiscountGlasses.com, get 30% off with code LABORDAY30. On DiscountContactLenses.com, get 15% off with code LABORDAY15.\n\nEyebuydirect.com\n\nShop by Sept. 7 to get 20% off frames and 30% off lenses. Use promo code EBD2030 at checkout.\n\nHome Depot\n\nNow through Labor Day, get up to 30% off select furniture and decor, up to 40% off select bath items and up to $80 off outdoor power equipment. Select small appliances are up to 40% off, including air fryers, coffee makers and pressure cookers. Looking for a large appliance? Select dishwashers, refrigerators, ranges, washers and dryers are up to 40% off through Sept. 16. You'll find the biggest savings when you purchase multiple appliances.\n\nLenovo\n\nLenovo's Labor Day sale runs through Sept. 14. Note that some deals have specific start dates. Deals include Lenovo Legion 5 AMD gaming laptops priced as low as $829.99 and Lenovo Flex 5 14-inch two-in-one laptops for under $700. Plus, you'll find tablets starting at $119 and laptops starting at $649.99. Hourly doorbusters will launch Sept. 7 on select Legion and Yoga products.\n\nLowe's\n\nThe Lowe's Labor Day sale runs until Sept. 9 and spans most departments. Highlights include five mums and annuals for $5, up to 35% off select appliances, free local delivery on any major appliance priced $396 or more, $50 off the Ring Video Doorbell 3 and up to 30% off custom kitchen cabinets. Plus, when you buy a Craftsman two- or four-tool 20-volt maximum brushless cordless combination kit, you will get one 20-volt bare tool (without a battery) or a battery for free.\n\nMacy's\n\nThe department store's Labor Day sale offers 25% to 60% off clothing, handbags, home decor, jewelry and more. Using promo code WKND at checkout will get you an extra 10%, 15% or 20% off, depending on the department.\n\nMy Green Mattress\n\nThe eco-friendly mattress retailer is offering up to $225 off mattresses and 20% off all accessories. The sale runs until Sept. 8. Use promo code USMADE at checkout.\n\nNest Bedding\n\nUse promo code NESTLOVE to get 20% off across the entire site from Sept. 3 to Sept. 14. No minimum spend is required to get this deal.\n\nOverstock\n\nThe Labor Day Blowout sale runs through Sept. 10 and offers up to 70% off home decor, furniture and more. Plus, get 15% off mattresses.\n\nRing\n\nRing is offering discounts on several of its video doorbells and other home security tech. Highlights include $20 off the Ring Video Doorbell (second generation), $50 off the Ring Peephole Cam and $60 off the Ring Video Doorbell Pro. There are also several bundled deals that offer discounts on alarm kits and sets of multiple security cameras.\n\nTempur- Pedic\n\nDuring the Labor Day sale, which runs until Sept. 21, shoppers can get up to $500 off select mattresses. Tempur-Adapt mattresses are $200 off, and Tempur-Breeze mattresses are $300 off.\n\nUlta Beauty\n\nLabor Day weekend overlaps with the 21 Days of Beauty sale. The sale features 50% off different beauty items each day of the event. If you're shopping on Labor Day, deals include 50% off select Too Faced palettes and up to 50% off Dermablend setting powders.\n\nWayfair\n\nThe Labor Day clearance sale runs through the weekend and includes up to 55% off office furniture, up to 60% off bedroom and outdoor furniture and up to 70% off wall art. Plus, find area rugs starting at $49.", "images": ["https://www.usnews.com/dims4/USNEWS/43b73ee/2147483647/thumbnail/640x420/quality/85/?url=http%3A%2F%2Fmedia.beam.usnews.com%2F02%2F50%2F7e99565045b8bc7f3a0087365735%2F200821-creditcarddecision-stock.jpg", "https://www.usnews.com/dims4/USNEWS/7e2cb36/2147483647/thumbnail/640x420/quality/85/?url=http%3A%2F%2Fmedia.beam.usnews.com%2F31%2F48%2Fea3d2d1a440ebc9b4858c0466c04%2F151130-brokenpiggy-stock.jpg", "https://www.usnews.com/dims4/USNEWS/ad39cb8/2147483647/thumbnail/84x84/quality/85/?url=http%3A%2F%2Fmedia.beam.usnews.com%2Feb%2F57%2F561275534b7787afb2017db2d283%2Fistock-173906241.jpg", "https://www.usnews.com/dims4/USNEWS/ecadc82/2147483647/thumbnail/84x84/quality/85/?url=http%3A%2F%2Fmedia.beam.usnews.com%2F34%2F6d%2F81722a324795a42eee1f3cca938e%2Fistock-492629987.jpg", "https://www.usnews.com/static/img/usn-logo-large.svg", "https://www.usnews.com/dims4/USNEWS/9e08e3f/2147483647/thumbnail/970x647/quality/85/?url=http%3A%2F%2Fmedia.beam.usnews.com%2F02%2F50%2F7e99565045b8bc7f3a0087365735%2F200821-creditcarddecision-stock.jpg", "https://www.usnews.com/dims4/USNEWS/018a827/2147483647/thumbnail/84x84/quality/85/?url=http%3A%2F%2Fmedia.beam.usnews.com%2Fe1%2F6f%2F4136935d4b68a2e3e7990ee9ef8a%2Fistock-1347494044.jpg"], "top_img": "https://www.usnews.com/dims4/USNEWS/9e08e3f/2147483647/thumbnail/970x647/quality/85/?url=http%3A%2F%2Fmedia.beam.usnews.com%2F02%2F50%2F7e99565045b8bc7f3a0087365735%2F200821-creditcarddecision-stock.jpg", "keywords": [], "authors": ["Kristin Mcgrath", "Sept.", "At P.M."], "canonical_link": "https://deals.usnews.com/articles/best-labor-day-sales-to-shop", "title": "Best Labor Day Sales to Shop for 2020", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0", "description": "Find deals and price reductions during these Labor Day weekend sales at stores such as Wayfair, Best Buy and Ulta.", "keywords": "Kristin McGrath ,personal finance,personal budgets,money,shopping,Labor Day,U.S. News 360 Deals,Articles", "zone": "home", "fb": {"pages": 5834919267, "app_id": 130063997038366}, "brightspot.contentId": "0000016c-cf0d-df9c-a3ff-cf0fb1600000", "og": {"site_name": "US News & World Report", "title": "Best Labor Day Sales to Shop for 2020", "description": "Find deals and price reductions during these Labor Day weekend sales.", "url": "https://deals.usnews.com/articles/best-labor-day-sales-to-shop", "image": {"identifier": "https://www.usnews.com/dims4/USNEWS/9e08e3f/2147483647/thumbnail/970x647/quality/85/?url=http%3A%2F%2Fmedia.beam.usnews.com%2F02%2F50%2F7e99565045b8bc7f3a0087365735%2F200821-creditcarddecision-stock.jpg", "secure_url": "https://www.usnews.com/dims4/USNEWS/9e08e3f/2147483647/thumbnail/970x647/quality/85/?url=http%3A%2F%2Fmedia.beam.usnews.com%2F02%2F50%2F7e99565045b8bc7f3a0087365735%2F200821-creditcarddecision-stock.jpg"}, "type": "article"}, "twitter": {"image": "https://www.usnews.com/dims4/USNEWS/9e08e3f/2147483647/thumbnail/970x647/quality/85/?url=http%3A%2F%2Fmedia.beam.usnews.com%2F02%2F50%2F7e99565045b8bc7f3a0087365735%2F200821-creditcarddecision-stock.jpg", "card": "summary_large_image", "site": "@USNews", "title": "Best Labor Day Sales to Shop for 2020", "description": "Find deals and price reductions during these Labor Day weekend sales."}, "google-site-verification": "owJBuFHD3VHcTSsnPSOYizmUcs3GSBjbx09vBbBi1MM", "msvalidate.01": "A8E47FA91124063A4A9C78AD5273DC0F", "sailthru.date": "2020-09-02T16:34Z", "sailthru.author": "Kristin McGrath", "vertical": "Deals", "preview": "Labor Day weekend is a big shopping holiday for deal hunters. Like most three-day weekends, it hosts an impressive array of sales. In addition to seeing the usual mattress and appliance deals that pop up during three-day-weekend sales, you'll find plenty of end-of-summer clearance sales on outdoor ...", "optimizely": "Optimizely is supported by this application but is not enabled for this page."}, "movies": [], "publish_date": 1504130400.0, "source": "https://money.usnews.com", "summary": ""}