{"url": "https://en.wikipedia.org/wiki/Lisa_Bonet", "text": "American actress (born 1967)\n\nLilakoi Moon[1] (born Lisa Michelle Bonet; November 16, 1967),[2] known professionally as Lisa Bonet[3][4][5] ( ), is an American actress. One of the most popular actresses throughout the late 1980s and 1990s,[6][7][8] her accolades include nominations for four Young Artist Awards, a Primetime Emmy Award and a Saturn Award.\n\nBonet is known for playing Denise Huxtable[9] on the sitcom The Cosby Show (1984–1992), for which she earned widespread acclaim and several awards, such as a nomination for the Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series in 1988; she reprised the role of Denise in the spinoff series A Different World (1987–1993), which was not as well received as its predecessor. She also appeared in the psychological horror film Angel Heart (1987), which earned her a nomination for the Saturn Award for Best Supporting Actress.\n\nBonet has starred in the action thriller film Enemy of the State (1998), the comedy-drama film High Fidelity (2000), the action drama film Biker Boyz (2003) and the thriller film Road to Paloma (2013). She has sporadically worked in acting, appearing in roles such as Maya Daniels in Life on Mars (2008–2009) and Marisol on Ray Donovan (2016).\n\nFrom 1987 to 1993, Bonet was married to singer-songwriter Lenny Kravitz, with whom she had one child, Zoë, who is also an actress. She was married to actor Jason Momoa from 2017 until 2022, with whom she has two children.\n\nEarly life [ edit ]\n\nLisa Michelle Bonet was born on November 16, 1967, in San Francisco, California,[citation needed] to Arlene Joyce Litman,[citation needed] a schoolteacher of Jewish descent, and Allen Bonet, an opera singer of African American heritage from Texas.[10][11][12][3][5] She has five half-sisters, including singer Kadhja Bonet, and two half-brothers by her father's marriage to Deborah Church. Bonet graduated from Birmingham High School, in Van Nuys, California and later studied acting at the Celluloid Actor's Studio in North Hollywood.[13][14]\n\nCareer [ edit ]\n\nAfter being in beauty competitions and appearing in guest spots on television series as a child, Bonet landed the role of Denise Huxtable on The Cosby Show, the second oldest child of the parents played by Bill Cosby and Phylicia Rashad.[15] In 1987, she briefly left The Cosby Show to star in the spin-off series A Different World, which focused on Denise's life at college. That year, Bonet, then 19, played 17-year-old Epiphany Proudfoot in the movie Angel Heart opposite Mickey Rourke.[16] In the film, several seconds of an explicit scene she shared with Rourke (filmed when she was 18) were edited to ensure an R rating.[17] For Angel Heart, Bonet earned a nomination for the Saturn Award for Best Supporting Actress. It was followed by a topless centerspread in Interview magazine.[18]\n\nIn 1988, Bonet earned a nomination for the Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series.[19] After announcing her pregnancy during the run of A Different World, Bonet left the series.[20] She returned to The Cosby Show the following year, but was fired in April 1991 because of \"creative differences\".[21] After The Cosby Show, Bonet appeared in direct-to-video releases and made-for-television movies. In September 1992, Bonet hosted Why Bother Voting?, an election special focusing on young voters' concerns and apathy. She had supporting roles in the 1998 film Enemy of the State and the 2000 film High Fidelity. In 2003 she played Queenie in Biker Boyz, which reunited her with her A Different World co-star Kadeem Hardison.[22]\n\nBonet co starred in the film Whitepaddy in 2005. While she did not have another film role until 2014's Road to Paloma, she did make a number of appearances in episodes of television dramas and comedies, starting in 2008 in the American adaptation of the British television series Life on Mars.[23][24] She had a recurring role in the 2014–15 series The Red Road, starring her partner and future husband Jason Momoa.\n\nPersonal life [ edit ]\n\nOn November 16, 1987, her 20th birthday, Bonet eloped with American rock singer Lenny Kravitz in Las Vegas. Bonet recalled of their relationship: \"It was interesting when we were first finding out about each other, that our backgrounds were so similar. When I first told him my mom was Jewish, and he said \"So's my dad,\" I thought that was both unusual and enchanting. I felt like, \"Okay, here's someone who really knows how it is.\" And I think I trusted him a little more with my feelings and let him inside a little more than I ordinarily would have.\"[25][26] Bonet gave birth to their daughter Zoë Isabella Kravitz on December 1, 1988.[27] She and Kravitz divorced in 1993.\n\nIn 1995, Bonet legally changed her name to Lilakoi Moon, although she still uses the name Lisa Bonet professionally.[28] In 2005, Bonet began a relationship with actor Jason Momoa. They married in October 2017.[29] Bonet and Momoa have two children: a daughter born in July 2007,[30] and a son born in December 2008.[31] In January 2022, Momoa and Bonet announced they are ending their marriage. [32]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nMusic videos [ edit ]\n\nAwards and nominations [ edit ]\n\nReferences [ edit ]", "images": ["https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Lisa_Bonet", "title": "Lisa Bonet", "meta_data": {"generator": "MediaWiki 1.38.0-wmf.25", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"title": "Lisa Bonet - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}