{"url": "https://en.wikipedia.org/wiki/Cobra_Kai", "text": "American martial arts comedy-drama television series\n\nCobra Kai is an American martial arts comedy-drama television series and a sequel to the original The Karate Kid films by Robert Mark Kamen.[2] The series was created by Josh Heald, Jon Hurwitz, and Hayden Schlossberg, and is distributed by Sony Pictures Television. It stars Ralph Macchio and William Zabka, who reprise their roles as Daniel LaRusso and Johnny Lawrence from the 1984 film The Karate Kid and its sequels, The Karate Kid Part II (1986) and The Karate Kid Part III (1989). Set 34 years later, Cobra Kai continues the original Karate Kid saga, last seen in The Next Karate Kid (1994). In particular, it re-examines the \"Miyagi-Verse\" narrative from Johnny's point of view, his decision to reopen the Cobra Kai karate dojo, and the rekindling of his old rivalry with Daniel.[3] Cobra Kai also stars Courtney Henggeler, Xolo Maridueña, Tanner Buchanan, Mary Mouser, Jacob Bertrand, Gianni DeCenzo, Peyton List, and Vanessa Rubio, with Martin Kove and Thomas Ian Griffith also reprising their roles from the films.\n\nThe series has high viewership on both YouTube and Netflix, and has received critical acclaim. The third season was nominated for \"Outstanding Comedy Series\" at the 73rd Primetime Emmy Awards. The first season launched on YouTube Red in 2018, with a second season following in 2019. After production of season three was completed, YouTube decided to stop producing scripted original programming, leaving the show without a home. Netflix acquired the series in June 2020, and released the third season on January 1, 2021.[4] Netflix renewed the series for a fourth season, which released on December 31, 2021. In August 2021, ahead of the fourth season premiere, the series was renewed for a fifth season.[7]\n\nPlot\n\nThirty-four years after being defeated by Daniel LaRusso in the 1984 All-Valley Karate Tournament, Johnny Lawrence, now in his 50s, works as a part-time handyman and lives in an apartment in Reseda, Los Angeles, having fallen far from the wealthy lifestyle in Encino that he had been accustomed to growing up due to suffering from depression and alcoholism after being traumatized by Kreese's assault against him (from The Karate Kid Part II). He has a son named Robby from a previous relationship whom he abandoned following his birth. After losing his job due to an argument with one of his clients, a down-and-out Johnny uses karate to defend his new teenage neighbor Miguel Diaz from a group of bullies. Initially reluctant, Johnny agrees to train Miguel in karate and decides to reopen the Cobra Kai karate dojo as a chance to recapture his past; however, this act reawakens his rivalry with Daniel, who was a 2-time All Valley champion (in 1984 and 1985) and is now the owner of a highly successful car dealership chain, is married to co-owner Amanda, and has two children: Samantha and Anthony. Daniel is finally living the wealthy lifestyle he envied as a kid when he lived in Reseda. However, after his friend and mentor Mr. Miyagi died, Daniel's struggle to meaningfully connect with his children has disrupted the balance in his life. Meanwhile, his mother Lucille, his other source of support, has a complicated relationship with Amanda.\n\nJohnny's dojo attracts a group of bullied social outcasts who find camaraderie and self-confidence under his tutelage, a marked contrast to the kind of students Johnny and his friends were when training in the original Cobra Kai run by John Kreese. Johnny develops a bond with Miguel in a manner that resembles the relationship between Daniel and Mr. Miyagi. Cobra Kai's philosophy, however, remains mostly unchanged, though Johnny tries to infuse it with more honor than Kreese did. Thus, Miguel develops into a very different kind of student than Daniel, or even Johnny, was; he also begins dating Samantha.\n\nAs a means of revenge against his estranged father, Robby convinces Amanda to hire him for a position at the LaRusso Auto dealership and develops a close friendship with Daniel, who is initially unaware of Robby's parentage. He even studies Mr. Miyagi's form of Karate with Daniel and befriends and eventually starts dating Samantha after her breakup with Miguel. She eventually joins her father's dojo, along with some Cobra Kai defectors. Miguel later begins dating a new Cobra Kai student, Tory Nichols, who becomes Sam's arch-rival. Johnny's efforts to reform Cobra Kai are threatened by the unexpected reappearance of Kreese, who aspires to bring the dojo back to its originally ruthless form while instigating further conflict between the rival dojos.\n\nThe story's development revolves around these primary relationships, which lead to conflicts that are ultimately the product of Daniel and Johnny's inability to move away from the past.\n\nCast and characters\n\nOverview\n\nThe following characters only appear via archival footage from the film series:\n\nEpisodes\n\nSeason Episodes Originally released Network 1 10 May 2, 2018 ( ) YouTube Red 2 10 April 24, 2019 ( ) YouTube Premium 3 10 January 1, 2021 ( ) Netflix 4 10 December 31, 2021 ( )\n\nProduction\n\nThe thematic genesis for Cobra Kai began with two works of pop culture. First, the 2007 music video for the song \"Sweep the Leg\" by No More Kings stars William Zabka (who also directed the video) as a caricature of himself as Johnny, and features references to The Karate Kid, including cameo appearances by Zabka's former Karate Kid co-stars.[9][10] In a 2010 interview, Zabka jokingly discussed this video in the context of his vision that Johnny was the true hero of the film.[11] Then, in 2013, Macchio and Zabka made guest appearances as themselves in the television sitcom How I Met Your Mother (\"The Bro Mitzvah\"). In the episode, Macchio is invited to Barney Stinson's bachelor party, leading to Barney shouting that he hates Macchio and that Johnny was the real hero of The Karate Kid. Towards the end of the episode, a clown in the party wipes off his makeup and reveals himself as Zabka.[12]\n\nDevelopment\n\nCobra Kai was greenlit on August 4, 2017, with ten half-hour episodes, written and executive produced by Josh Heald, Jon Hurwitz, and Hayden Schlossberg. Although the series received offers from Netflix, Amazon, Hulu, and AMC, it ultimately ended up on the subscription service YouTube Red.[13][14] The trio was joined by executive producers James Lassiter and Caleeb Pinkett of Overbrook Entertainment in association with Sony Pictures Television.[15] YouTube Premium released the first season on May 2, 2018, and the second season on April 24, 2019. The creators of the series explored moving to another platform ahead of the season two premiere, but the deal did not go through.[16]\n\nThe third season was produced for YouTube and was initially set for a 2020 release.[17][18] However, on May 28, 2020, Deadline Hollywood announced that the series would be leaving YouTube and moving to another streaming platform, ahead of its third-season premiere. As YouTube was not interested in renewing the series for a fourth season, the producers wanted to find a streaming venue that would leave that option open.[19]\n\nOn June 22, 2020, it was announced that the show would be moving to Netflix, taking the third season with them.[20] Netflix released the first two seasons from YouTube on August 28, 2020, and the new third season on January 1, 2021.[4] On October 2, 2020, Netflix announced an early renewal for a fourth season, prior to season 3 being released.[21] As part of a video and letter to its shareholders in April 2021, Netflix's co-chief executive officer and chief content officer, Ted Sarandos confirmed that the fourth season of Cobra Kai would appear sometime in Q4 2021.[22][23] On August 27, 2021, ahead of the fourth season premiere, Netflix renewed the series for a fifth season.[7]\n\nMiyagi-Verse\n\nCharacters from the original four films The Karate Kid (1984), The Karate Kid Part II (1986), The Karate Kid Part III (1989), The Next Karate Kid (1994) comprise the Miyagi-verse that shapes Cobra Kai. Thus, after the launch of Season 1, Elisabeth Shue (Ali Mills) from The Karate Kid,[24][25] Tamlyn Tomita (Kumiko) and Yuji Okumoto (Chozen Toguchi) from The Karate Kid II,[25] and Robyn Lively (Jessica Andrews)[26] and Thomas Ian Griffith (Terry Silver) from The Karate Kid III, all discussed whether or not they would like to appear in the series.[27] Sean Kanan (Mike Barnes)[28] (also from Karate Kid III) stated in a 2021 interview (when asked if Barnes will appear in the series) that \"you probably haven't seen the last of him.\"[29] Finally, although Hilary Swank (who as Julie Pierce replaced Daniel as Mr. Miyagi's student in The Next Karate Kid), has neither confirmed nor denied her interest, she did acknowledge that it would be a chance to have a \"showdown\" with Ralph Macchio.[30] In December 2020, the series' co-creators stated that: \"In our writers' room we speak about literally every character that has appeared in the Miyagi-verse, so it's obvious that we've spoken about Julie Pierce. As to whether or not she'll return to the series, that's something you'll just have to wait to find out.\"[31]\n\nIn 2020, Jon Hurwitz clarified that the \"Karate Kid cartoon is not canon. But there is an Easter egg from it in Season 3,\" in response to the question as to whether \"the Karate Kid animated series [is] official within the Karate Kid universe?\" The Easter egg was \"the Miyagi-Do shrine, briefly seen at Chozen Toguchi's dojo in Okinawa halfway through the season. The artifacts were recovered by Daniel LaRusso and Mister Miyagi in the short-lived Karate Kid animated series, which ran for thirteen episodes in 1989.\"[33]\n\nIn a 2021 interview with Slashfilm, the writers noted that they will not be using characters from the 2010 film The Karate Kid, as they are not a part of the \"Miyagi-verse\": \"We've ruled that out completely. Jackie Chan is mentioned in season 1 of the show as an actor, so I think in our world, Jackie Chan is an actor and a performer. If the characters on our show have seen a movie called The Karate Kid, they've seen that one.\"[34]\n\nCasting\n\nIn Season 1, Ralph Macchio and William Zabka revived their Karate Kid characters, Daniel LaRusso and Johnny Lawrence. Additional Karate Kid actors included Randee Heller, who reprised her role as Lucille LaRusso (Daniel's mother),[35] and Martin Kove, who revived his role as John Kreese.[36] The cast list for Season One was announced on October 24, 2017, and included Xolo Maridueña, Mary Mouser, Tanner Buchanan, and Courtney Henggeler. Ed Asner was cast in a guest role as Johnny's verbally abusive step-father, Sid Weinberg.[37][38] On December 19, 2017, Vanessa Rubio joined the cast as Miguel's mother.[39]\n\nIn Season 2, Ralph Macchio, William Zabka, Xolo Mariduena, Tanner Buchanan, Mary Mouser, and Courtney Henggeler all returned,[36] with Jacob Bertrand, Gianni DeCenzo, and Martin Kove being promoted to series regulars and newcomers Paul Walter Hauser and Peyton List joining the cast.[40][41] Actors from The Karate Kid, Rob Garrison (Tommy), Ron Thomas (Bobby), Tony O'Dell (Jimmy), and Randee Heller (Lucille LaRusso) made guest appearances during this season.\n\nIn Season 3, Ralph Macchio, William Zabka, Xolo Mariduena, Tanner Buchanan, Mary Mouser, and Courtney Henggeler all returned. Actors from The Karate Kid and The Karate Kid II, Elisabeth Shue (Ali Mills), Ron Thomas (Bobby), Tamlyn Tomita (Kumiko), Traci Toguchi (Yuna), and Yuji Okumoto (Chozen Toguchi) all made guest appearances during this season.\n\nIn Season 4, Vanessa Rubio and Peyton List were promoted to series regulars, [42] while Dallas Dupree Young and Oona O'Brien were cast in recurring roles.[42] In addition, Thomas Ian Griffith reprised his role as Terry Silver from The Karate Kid III,[43] and actors from The Karate Kid and The Karate Kid II, Yuji Okumoto (Chozen Toguchi)[44] and Randee Heller (Lucille LaRusso), made guest appearances.\n\nFilming\n\nPrincipal photography for the first season began in October 2017 in Atlanta, Georgia. Filming took place at various locations throughout that month at places including Union City, Marietta, and the Briarcliff Campus of Emory University.[45] In November 2017, shooting moved to locales such as the North Atlanta Soccer Association Tophat fields in East Cobb.[46] In December 2017, the production was working out of Marietta and Conyers.[47] Various exterior shots were also filmed in parts of Los Angeles such as Tarzana and Encino.[48] Exterior locations included Golf N' Stuff in Norwalk and the South Seas Apartments in Reseda, both of which were originally featured in The Karate Kid.[49]\n\nPrincipal photography for the second season began in September 2018 in Atlanta, Georgia. In October 2018, production continued around Atlanta with shooting also occurring in Marietta.[50] In November 2018, the series was filming in Union City.[51] In December 2018, shooting transpired at the closed Rio Bravo Cantina restaurant in Atlanta.[52]\n\nPrincipal photography for the fourth season began in February 2021 and ended in April 2021 in Atlanta, Georgia.[53][54]\n\nFilming for the fifth season began in September 2021, and finished in December 2021.[55]\n\nRelease\n\nMarketing\n\nIn January 2018, the series was promoted at the annual Television Critics Association's winter press tour where YouTube's global head of original content Susanne Daniels described the show saying, \"It is a half an hour format but I would call it a dramedy. I think it leans into the tone of the movies in that there are dramatic moments throughout. I think it's very faithful really in some ways to what the movie set about doing, the lessons imparted in the movie if you will. It's next generation Karate Kid.\"[56]\n\nThe first trailer was released on February 15, 2018,[57] the second on March 1, 2018,[58] and the third a week later.[59] The final official trailer was released on March 21, 2018, and included the announcement that the show would premiere on May 2, 2018.[60]\n\nOn April 17, 2019, YouTube Premium released a six-minute commercial parodying ESPN's 30 for 30, featuring the main cast members and select ESPN personalities analyzing the 1984 match between Daniel and Johnny.[61][62] It was nominated for a Clio Award.[63]\n\nPremiere\n\nThe series held its world premiere on April 24, 2018, at the SVA Theatre in New York City, New York, during the annual Tribeca Film Festival. Following the screening, a discussion was held with writers, directors, and executive producers Hayden Schlossberg, Jon Hurwitz, and Josh Heald, in addition to series stars and co-executive producers William Zabka and Ralph Macchio.[64]\n\nOn April 25, 2018, YouTube partnered with Fathom Events for special screenings of the first two episodes of the series at around 700 movie theaters across the United States. The event also included a screening of the original film.[65][66]\n\nReception\n\nCritical response\n\nCritical response of Cobra Kai Season Rotten Tomatoes Metacritic 1 100% (49 reviews) 72 (11 reviews) 2 90% (31 reviews) 66 (7 reviews) 3 90% (51 reviews) 72 (15 reviews) 4 95% (37 reviews) 70 (8 reviews)\n\nAt the review aggregator website Rotten Tomatoes, the entire series (Seasons 1–4) received a 93% approval rating.[67]\n\nThe first season had a positive response from critics. At the review aggregator website Rotten Tomatoes, it holds a 100% approval rating, with an average score of 7.50 out of 10 based on 49 reviews. The website's critical consensus reads: \"Cobra Kai continues the Karate Kid franchise with a blend of pleasantly corny nostalgia and teen angst, elevated by a cast of well-written characters.\"[68] Cobra Kai was 2018's best-reviewed TV drama on Rotten Tomatoes.[69] Metacritic, which uses a weighted average, assigned the season a score of 72 out of 100 based on 11 critics, indicating \"generally favorable reviews\".[70]\n\nThe second season had a positive response from critics. At the review aggregator website Rotten Tomatoes, it holds an 90% approval rating with an average score of 7.40 out of 10, based on 31 reviews. Its critical consensus reads: \"While Cobra Kai's subversive kick no longer carries the same gleeful impact of its inaugural season, its second round is still among the best around – no amount of mid-life crisis and teenage ennui's ever gonna keep it down.\"[71] Metacritic's weighted average assigned the second season a score of 66 out of 100, based on 7 critics, indicating generally favorable reviews.[72]\n\nThe third season of the series had a positive response from critics. At the review aggregator website Rotten Tomatoes, it holds an 90% approval rating, with an average score of 8.00 out of 10 based on 51 reviews. The website's critical consensus reads: \"By pairing its emotional punches with stronger humor, Cobra Kai's third season finds itself in fine fighting form.\"[73] On Metacritic with his weighted average, assigned a score of 72 out of 100, based on 15 critics, indicating generally favorable reviews.[74]\n\nThe fourth season had a positive response from critics. As of January 27, 2022 it holds a 95% approval rating, with an average score of 7.90 out of 10 based on 37 reviews. The website's critical consensus reads: \"Cobra Kai still delights in a fourth season that mines great fun from shifting alliances, chiefly the uneasy truce between Johnny Lawrence and Daniel LaRusso.\"[75][76] Metacritic's weighted average assigned the fourth season a score of 70 out of 100, based on 5 critics, indicating generally favorable reviews.[77]\n\nViewership\n\nYouTube\n\nThe first episode, which was posted on YouTube for free along with episode two, had been viewed 5.4 million times within the first 24 hours.[78] While it was noted that the response had been, in part, a result of YouTube releasing the episode for free, it was noted by Cinema Blend's Britt Lawrence that, \"YouTube Red's new series debuted to numbers that should make rival streaming services take notice.\"[79] By October 30, 2018, ahead of the second-season premiere, YouTube was promoting the report that the first episode had then been viewed over 50 million times.[80] The first episode was No. 8 on YouTube's list of ten top-trending videos of 2018.[81]\n\nAccording to market research company Parrot Analytics, the first season of Cobra Kai was the world's most in-demand streaming television show during May 2018.[82] Parrot Analytics later reported that the second season of Cobra Kai was the world's most in-demand digital television show during April 2019[83] through May 2019.[84] As of September 2020 , the season 1 premiere has over 90 million views,[85] and the season 2 premiere has over 86 million views.[86]\n\nNetflix\n\nAfter the series moved to Netflix in August 2020, Season 1 and Season 2 of Cobra Kai became the most-watched series on the platform.[87] It was the most-watched show on streaming media in the United States between August 29 and September 6, according to Nielsen ratings. During the week, the show's 20 episodes drew nearly 2.2 billion streaming minutes in the United States.[88] The first season was watched on Netflix by 50 million member households in its first four weeks,[89] making Cobra Kai the most-streamed show on Netflix during the month of September 2020.[90][91]\n\nIn February 2021, after the release of Season 3, Forbes announced that it \"kicked off 2021 as one of most viewed original series on a streaming platform\". During the period of December 28, 2020 – January 3, 2021, it came in \"second only to Netflix's Bridgerton\", with over 2.6 billion viewing minutes.[92] Cobra Kai then moved to first place during the period of January 4–10, 2021.[93]\n\nCritics offered cultural commentary in response to the third season of Cobra Kai (January 2021). Jen Yamato of Los Angeles Times stated that by the end of season three, \"there are now three white men at the center of Cobra Kai, a franchise rooted in and deeply indebted to Eastern tradition.\"[94] Gustavo Arellano of Los Angeles Times suggested that Cobra Kai offers a \"way forward for all of us during these tumultuous times\", as he \"saw this uplifting season [3] finale the weekend before the Jan. 6 U.S. Capitol invasion.[95] The Hollywood Reporter, former NBA champion and student of martial arts Kareem Abdul-Jabbar suggested that his friend and teacher, the late Bruce Lee, was linked to the influence of the original Karate Kid films.[96] Finally, Albert Wu and Michelle Kuo of the Los Angeles Review of Books argued that while the original Karate Kid \"film functioned as a post-Vietnam critique of American empire, staking its position explicitly: pacifism over violence, peace over war, an admittedly romanticized version of Eastern wisdom over the macho bravado of jock culture,\" Cobra Kai \"models\" the \"unending appeal\" of the \"American Empire.\"[97]\n\nAwards and nominations\n\nHome media\n\nDuring the show's time on YouTube Red, it was announced that Cobra Kai would not be released on DVD.[113] However, once the show made its move to Netflix, Sony Pictures released the first and second seasons in a \"Collector's Edition\" DVD set on November 24, 2020 in the United States.[114] On January 11, 2022, Sony Pictures released the third season on DVD in the United States.[115][116]\n\nThe series has also been released on Blu-ray in the United Kingdom.[117]\n\nSoundtracks\n\nCobra Kai: Wax Off – EP\n\nMadison Gate Records released an extended play entitled Cobra Kai: Wax Off – EP on July 23, 2021, featuring extended versions of four previously released tracks from the first two seasons soundtracks.[130]\n\nTrack listing\n\nAll music is composed by Leo Birenberg and Zach Robinson.\n\nNo. Title Length 1. \"Quiver – Extended\" 3:51 2. \"Cobra Guy – Extended\" 2:31 3. \"A Badass Name for a Dojo – Extended\" 3:02 4. \"Sam and Robby – Extended\" 4:20 Total length: 13:45\n\nVideo games\n\nCobra Kai: The Karate Kid Saga Continues, a video game based on the series, was released for PlayStation 4, Xbox One, and Nintendo Switch on October 27, 2020, and for Microsoft Windows on January 5, 2021.[131]\n\nA mobile game entitled Cobra Kai: Card Fighter was released on March 19, 2021, on iOS and Android devices.[132]\n\nReferences", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/d/d6/CobraKaiTitleScreen.png/250px-CobraKaiTitleScreen.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/5/5c/Symbol_template_class.svg/16px-Symbol_template_class.svg.png", "https://upload.wikimedia.org/wikipedia/en/d/d6/CobraKaiTitleScreen.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/d/d6/CobraKaiTitleScreen.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Cobra_Kai", "title": "Cobra Kai", "meta_data": {"generator": "MediaWiki 1.38.0-wmf.25", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/d/d6/CobraKaiTitleScreen.png", "width": 640, "height": 361}, "title": "Cobra Kai - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}