{"url": "https://www.techradar.com/black-friday/black-friday-cyber-monday-2018-deals-in-usa", "text": "While it might feel like last year's Black Friday sale just wrapped up, there's no time like the present to prepare yourself for the upcoming Black Friday 2022 deals event. Our Black Friday deals guide covers everything you know to know, such as the date, how to get the best deals, what offers you can expect, and what happened at this year's Black Friday sale event.\n\n\n\nBlack Friday 2022 falls on November 25 this year, but like years past, we expect to see deals start to pop up as early as October. At last year's Black Friday sale, we saw offers earlier than ever thanks to sales launched by retailers like Amazon, Best Buy, and Walmart as they tried to combat shipping delays and supply issues. In fact, according to Adobe Analytics, spending was actually down 1.3% on Black Friday proper compared to last year, but if you looked at November as a whole, consumers spent $109.8 billion, which was up 11.9% compared to 2020.\n\n\n\nThis also aligns with what we saw - the best deals were launched in the weeks leading up to Black Friday, and we were left disappointed with offers on the big day. Consumers were also worried about product availability, so they took advantage of early Black Friday deals offered by the big-name online retailers. Early holiday shopping was a smart move as we noticed best-selling items like the AirPods Pro, the Apple Watch 6, MacBooks, and Amazon's own devices were out of stock in the run-up to Black Friday proper. We also saw price increases on certain items, including the AirPods Pro and MacBook Pro, which is unusual based on previous years.\n\n\n\nSo what were last year's hottest Black Friday deals? According to Amazon, the Echo Dot, Fire TV Stick, Echo Show 5, AirPods, Beats Studio Buds, and the Revlon one-step hair dryer rounded up the top-sellers. Adobe also reported that laptops, TVs, the Nintendo Switch, the Apple Watch, and toys from brands like Hot Wheels, Nerf, and Paw Patrol were this year's Black Friday best-sellers. We expect a mix of that during the Black Friday 2022 deals event, plus new gadgets released this year.\n\n\n\nBelow you'll find more on our predictions for this year's sale as well how to find the best Black Friday deals, the best Black Friday retailers, and looking back at this year's top offers. We'll be updating this page with all the latest Black Friday 2022 news, so make sure to bookmark this page as your one-stop-shop for Black Friday.\n\nWhen is Black Friday 2022? When is Black Friday 2022? The official Black Friday date for this year is November 25, 2022. The actual date shifts every year, but the day of the week stays the same: it's always the Friday after Thanksgiving.\n\n\n\nAt last year's sale, retailers kicked off their Black Friday deals earlier than ever due to concerns around shipping delays and supply issues. We also saw more retailers moving to the competitive arena of online sales, which resulted in more deals to shop on the web.\n\nHow do I get the best Black Friday deals in 2022?\n\nHomework really helps. Some retailers up prices from August through to October so they can offer supposedly amazing discounts on Black Friday, so don’t be fooled by such moves.\n\nThey’re particularly prevalent in expensive consumer electronics such as TVs or laptops with product numbers rather than names, with products that were dropped down to a great bargain price suddenly being pushed back to their MSRP again.\n\nIt’s also a very good idea to be flexible: for example, if you fancy a Samsung UHD TV it’s best to think about the features you want rather than a specific model number: the BRV553ABD34-82C-9218-X may not be discounted on Black Friday 2022, but an almost identical set with the specification you want probably will be.\n\nSo do your research on what matters and we’ll do our best to give you the right comparison needed.\n\nHowever, don’t be fooled into thinking that something that looks like a five-star set is the same but cheaper - certain elements (often with regards to screen quality or image processing) won’t be as high quality to achieve that lower price point.\n\nBlack Friday deals 2022: our predictions\n\nWe can make predictions of what we think Black Friday 2022 will bring based on last year's sale event. Due to concerns around shipping delays and supply issues, we saw retailers like Best Buy and Walmart launch Black Friday deals earlier than ever, with Amazon kicking things off in early October.\n\n\n\nTypically retailers reserve their best deals for Black Friday proper, but last year we saw the best deals leading up to Black Friday. This might be why, according to Adobe Analytics, spending was down 1.3% on Black Friday compared to last year, and Thanksgiving Day stayed flat. Consumers have spent $109.8 billion in November alone, which was up significantly (11.9%) compared to 2020. This falls in line with the trend of early sales, which drew consumers to make earlier purchases and not wait for Black Friday to snag a deal online.\n\n\n\nSo what does this mean for Black Friday 2022? It all depends on if retailers will face the same shipping and stock supply issues that plagued this year's sale. We do expect the trend of earlier sales to stay, but if stock issues aren't a problem, we think retailers will reserve their best deals for Black Friday proper to help keep the hype around Black Friday alive.\n\n\n\nWhile it's still early to know exactly what kind of deals we'll see at this year's sale, we can make predictions on what brands and products we'll see come November. According to Adobe, the hottest items at last year's Black Friday sale included AirPods, the Apple Watch, laptops, TVs, consoles, and toys from brands like Hot Wheels, Paw Patrol, and Nerf. Amazon's top Black Friday sellers consisted of its own devices like the Echo Dot, Fire TV Stick, and smart bulbs, and some interesting items included the Revlon one-step hair dryer and the Colorfulkoala yoga pants.\n\n\n\nWe expect Apple devices, toys, laptops, TVs, and Amazon's own devices to be top sellers at the Black Friday 2022 sale and new gadgets that will be released this year.\n\nWhy is it called Black Friday\n\nLet’s take a history lesson to find how why they call it Black Friday: the first known mention of Black Friday related to this shopping experience was in November 1951, when the journal Factory Management and Maintenance used it to describe people calling in sick the day after Thanksgiving so they could have an extra day off work.\n\nAt the same time, US police were using the phrases “Black Friday” and “Black Saturday” to describe the horrendous traffic that occurred at the beginning of the pre-Christmas shopping season.\n\nIn 1961, the local government moved to change the shopping season to “Big Friday” and “Big Saturday,” but it never caught on. The notion that it was the time when retailers moved 'back into the black' was seen far later and clearly an attempt to bring positivity to the term.\n\nImage credit: TechRadar\n\nThe best Black Friday deals from last year's sale\n\nTaking a look back at last year's Black Friday deals can help us get an idea of what will be on sale during Black Friday 2022. We've included the most popular categories below, including TV, laptops, smart home devices, and appliances from all your favorite brands like Apple, Samsung, Roomba, Keurig, Instant Pot, and more.\n\nThe best Black Friday deals: under $50\n\n$25 and under\n\nEcho Auto: $49.99 $14.99 at Amazon\n\nSave $55 - This Amazon Black Friday deal has a massive 70% discount on the handy Echo Auto. That brings the price down to just $199 which is the lowest price we've seen. The Echo Auto adds Alexa to your car so you can play music, make calls, and more completely hands-free.\n\nBlink Mini security camera: $34.99 $19.99 at Amazon\n\nSave $15 - The Blink Mini was a Black Friday best-seller at last year's sale and Amazon just dropped the smart security camera to $19.99 - the cheapest deal we've seen. The indoor HD camera works with Amazon Alexa and alerts your smartphone whenever motion is detected.\n\nEcho Glow: $29.99 $16.99 at Amazon\n\nSave $13 - Amazon's brilliant kid-friendly smart lamp, the Echo Glow, is cheaper than it's ever been, dropping its price by almost 45%, which makes it among the best bargains parents can score this Black Friday. And, this isn't any ordinary lamp either. It's capable of displaying so many colors, offers a Rainbow Timer to help the kids stay on track, and is unintrusive with its sleek and small design. Best of all, it works with Alexa and therefore, voice control.\n\nTile Mate (2020) 1pk: $24.99 $14.99 at Amazon\n\nSave $10: If you don't mind previous-gen tech, then you can avail of one of the best prices we've seen for any Tile Mate. Attach this Bluetooth tracker to your keys, wallet, or most other small items you're prone to losing. It'll work with your phone to locate your stuff at up to 200 feet away. Also this price at Best Buy. Deal ends November 27 at 2:59 am ET.\n\nMr. Coffee Iced Coffee Maker: $34.99 $24.97 at Walmart\n\n$10 off: For anyone who thinks iced coffee season is all-year round, this deal is for you. This machine will brew your favorite drinks in under four minutes. It's also quite eco-friendly – it includes a reusable tumbler and doesn't require any pods to brew. Nab it for $10 off while you can.\n\nSamsung Galaxy SmartTag tracker: $29.99 $17.99 at Amazon\n\nSave $12 - Here's a nice little stocking filler in this year's Amazon Black Friday deals with the lowest price yet on the Galaxy SmartTag tracker. Attach this one to your keys, luggage, or even your pets to never lose them again. Compatible with any Android 8.0 device or higher, you'll get live location updates directly to your phone.\n\nFire TV Stick Lite with Alexa Voice Remote: $29.99 $17.99 at Amazon\n\nSave $12 - If you're looking to pick up a cheap streaming device, Amazon's Black Friday deals event has the Fire TV Stick Lite on sale for a record-low price of just $17.99. The affordable streaming player allows you to enjoy tens of thousands of channels, apps, and Alexa skills and features an Alexa voice remote.\n\neufy Smart Scale C1: $32.99 $17.99 at Amazon\n\nSave $15 - A more detailed way of checking in with your health and what that number on the scales actually means, the eufy Smart Scale C1 can measure your body's body fat ratio, BMI, bone mass, muscle mass, as well as your weight. Now back down to their lowest price on Amazon.\n\nEcho Dot (3rd Gen) Smart Speaker: $49.99 $19.99 at Amazon\n\nSave $15 - The Echo Dot is always a Black Friday favorite, and Amazon has the 3rd-generation smart speaker on sale for just $19.99 - just $6 more than the record-low price. The 3rd-generation Echo Dot can play music, answer questions, check the weather, and more – all you have to do is ask Alexa. Note, this one's selling fast and delivery dates are currently early December. We'd act quickly on this one if you're interested.\n\n$50 and under\n\nApple MagSafe Charger: $39 $31.99 at Amazon\n\nSave $31.99 - A nice little 18% discount on this Apple accessory, the Apple MagSafe charger can be used to charge iPhone 12 models onwards, as well as AirPods with a wireless charging case. As a ubiquitous Apple accessoory, this is one of those essential bits of kit always worth snatching up in an Amazon Black Friday deal as a cheap stocking filler or gift.\n\nAmazon Echo Dot 4th generation: $49.99 $29.99 at Amazon\n\nSave $20: Want a cheap way to bring Alexa into your home? Pick up the compact 4th gen Echo Dot smart speaker. Now $20 off for Black Friday, it's within a buck of the all-time low that we saw around the same time last year. And should you have an eligible Amazon device to trade in, you can score another 25% off.\n\nBella Pro Series 4.2-qt. Analog Air Fryer: $59.99 $29.99 at Best Buy\n\nSave $30 – Pick up a cheap air fryer at Best Buy's Black Friday deals event. Marked down to just $29.99, the Bella 4.2-qt air fryer allows you to air-fry, broil, bake, roast, and reheat with little to no oil, so you can enjoy your favorite fried foods with less guilt.\n\nKasa Indoor Pan/Tilt Smart Home Camera: $39.99 $29.99 at Amazon\n\nSave $10 - Black Friday is the best time to invest in smart home devices big and small. With this Kasa Indoor Pan/Tilt camera at 25% off this Black Friday – the cheapest we've seen it all year – it might be time to invest in an indoor smart camera that works seamlessly with Alexa and your Echo devices. At $30, there's a lot of features to love here, including real-time motion and sound detection, a 113-degree tilt and 360-degree pan, and smart home integration that lets it perform Smart Actions like triggering the alarm or the spotlight when it detects motion during your chosen times in the day.\n\nAmazon Fire 7 tablet: $49.99 $34.99 at Amazon\n\nSave $15 - The cheapest Fire tablet deal, Amazon's Black Friday device deals include the Fire 7 on sale for just $34.99. The 2019 tablet features a 7-inch display, 16GB of RAM, and up to seven hours of battery life.\n\nRing Video Doorbell Wired with Echo Dot: $59.99 $41.99 at Amazon\n\nSave $18 - Amazon's Black Friday has the Ring Video Doorbell wired on sale for a record-low price of $41.99, and a free 4th generation Echo Dot smart speaker. The Alexa-enabled doorbell is installed using your existing doorbell wiring, so you'll get non-stop power and won't have to worry about replacing the battery. Note, this one's currently delivering in early December, so act quickly if you're interested.\n\nFujifilm Instax Mini 7+ bundle $85 $48 at Walmart\n\nSave $37 - This is a record-low price for our favourite instant camera. The Mini 7 is easy to use, includes a pop-out lens barrel for selfies and takes Instax Mini film - which is more affordable than its Polaroid equivalent. This special bundle at Walmart makes a great gift for anyone looking to dabble in instant photography. This great value bundle comes with 10 packs of Instax Mini Film, plus a magnetic frame, curved frame, pegs and an Instax photo album - that's more than enough ways to display your finest snaps.\n\nAmazon Echo Show 5: $89.99 $44.99 at Amazon\n\nSave $40 - If you're looking for a Black Friday deal on a smart home display, Amazon has the 2nd generation Echo Show 5 on sale for just $44.99. That's the lowest price we've seen and a fantastic deal for a feature-rich smart home display that includes the Amazon Alexa voice assistant.\n\nWyze Cam Spotlight: $52.96 $49.96 at Amazon\n\nSave $3 - While this $3 Black Friday discount might not seem like much, a security camera under $50 is a fantastic value, and the Wyze Cam is one of the best home security cameras on the market. The spotlight will turn on automatically when motion is detected and alerts will be sent to your phone.\n\nThe best Black Friday deals: TVs\n\nBest Buy Black Friday TV sale: smart TVs from $99.99\n\nGreat for cheap TVs: Best Buy has an enormous TV sale, with hundreds of smart TVs starting from as low as $99.99. The cheapest ones are usually 720p and in smaller sizes - good for in the kitchen, or a kid's room. But there are also record-low prices and in some cases up to $1,000 off higher-end sets from Samsung, Sony, and other big-name brands.\n\n60-85 inch TVs\n\nInsignia 70-inch 4K UHD Smart Fire TV: $749.99 $579.99 at Best Buy\n\nSave $170 - Best Buy has this 70-inch 4K TV from Insignia on sale for just $579.99. That's the lowest price we've seen and a fantastic Black Friday deal for a big-screen display. The Insignia set packs 4K Ultra HD resolution, DTS Studio Sound, and features the Fire OS for seamless streaming and a handy Alexa voice remote.\n\nSamsung 65-inch 4K Smart TV: $648 $568 at Walmart\n\nSave $80 – This is a solid saving on an excellent mid-range 4K TV from Samsung. At just $20 shy of the all-time low price, we haven't spotted it this low for over a year so it's a rare opportunity to snap up a great TV deal. This set includes a speedy Tizen processor and an Auto Game Mode to give you the smoothest gaming experience.\n\nSamsung 70-inch 4K Crystal UHD Smart Tizen TV: $749.99 $599.99 at Best Buy\n\nSave $150 - Only available at Best Buy, this stunning 70-inch display supports 4K content, HDR, and its UHD goes well beyond HDTV. If you're looking for a mid-range TV from a reputable brand that makes a real statement, this Black Friday deal is one to keep an eye on.\n\nTCL 65-inch 5 Series QLED 4K UHD Smart TV: $899.99 $699.99 at Best Buy\n\nSave $200 - A QLED display under $1,000 is extremely rare, but Best Buy's Black Friday sale has this 65-inch set from TCL down to a stunningly low price of just $699.99. You're not going to find a better deal for a big-screen QLED TV - so we'd grab this record-low price while you can.\n\nAll-New Toshiba 75-inch 4K UHD Smart Fire TV (2021): $999.99 $749.99 at Amazon\n\nSave $250 - This Toshiba 75-inch 4K smart TV is on sale for a record-low price at Amazon's 2021 Black Friday deals event. The 2021 set features an Alexa voice remote and the Fire TV OS and includes Dolby Vision HDR, HDR10, DTS Virtual: X for a premium picture experience.\n\nSamsung 60-inch Q60A Series QLED 4K Smart TV: $999.99 $797.99 at Amazon\n\nSave $202 - Amazon's Black Friday TV deals include Samsung's 60-inch QLED TV that's on sale for only $797.99. That's the lowest price we've ever seen and an incredible deal for a stunning QLED display. The Samsung set delivers a premium picture experience thanks to the Quantum Dot technology, which produces over a billion shades of brilliant color. You're also getting smart capabilities, a sleek, slim design, and Amazon Alexa built-in for hands-free control.\n\nTCL 6-Series 75-inch Mini-LED 4K UHD Smart TV: $2,299 $1,299.99 at Best Buy\n\nSave $1,000 - If you're looking for a huge saving on an even bigger display in this week's Black Friday TV deals, don't miss this huge price cut on the TCL 6-Series. With cutting-edge Mini-LED backlight technology, great upscaling, and Google Assistant, this one's a great choice if you're serious about your picture quality but don't want to break the bank on an LG or Samsung display.\n\nLG OLED G1 Series 55-inch OLED: $1,999.99 $1,696.99 at Amazon\n\nSave $303 - Black Friday TV deals are live at Amazon, and we've spotted LG's gorgeous OLED G1 series on sale for a record-low price of $1,696.99. The G1 from LG is an outstanding OLED TV that offers excellent contrast, better brightness than we've seen before, and an impressively thin design. It's no surprise that it's on TechRadar's list of best TVs of 2021.\n\nLG C1 OLED (65-inch): $2,499.99 $1,796 at Amazon\n\nSave $703 - One of the best Black Friday deals we've seen, Amazon has the brilliant LG C1 OLED TV on sale for a record-low price of $1,796. It's one of the best TVs you can buy, thanks to the stunning OLED display, Alpha a9 Gen. 4 processor, and virtual surround sound audio. If you're after the best price-to-performance ratio, the C1 OLED comes with our highest recommendation – especially now that it's getting a $700 discount.\n\nSamsung 65-inch QN900A Neo QLED 8K Smart TV (2021): $4,999.99 $3,297.99 at Amazon\n\nSave $1,700 - One of the best Black Friday TV deals we've spotted so far is this 65-inch QLED 8K TV from Samsung that's on sale for $3,299.99. That's a massive $1,700 discount and the lowest price we've seen for the stunning Samsung display. The Samsung QN900A is one of the best TVs you can buy, thanks to its exceptional picture quality and state-of-the-art design.\n\n50-59 inch TVs\n\nOnn. 50-inch C4K UHD LED Roku Smart TV: $349 $329 at Walmart\n\nSave $20 - Walmart has this 50-inch 4K TV from Onn. on sale for just $329 - a great price for a 4K Ultra HD TV that has the Roku experience built right in. This is one of the cheapest Black Friday TV deals we've seen for a mid-size 4K smart display and we've already seen the 70-inch version sell out - but be aware this was cheaper just hours ago. In short, we'd recommend grabbing this bargain now before it's totally gone.\n\nInsignia 55-inch F30 Series 4K UHD Smart Fire TV: $549.99 $299.99 at Best Buy\n\nSave $250 - An incredible price for a 55-inch 4K TV, Best Buy's Black Friday sale has this Insignia set on sale for a record-low price of just $299.99. The 55-inch TV packs smart capabilities, the Fire TV experience, 4K HD resolution, DTS Studio Sound, and an Alexa voice remote - all for under $300!\n\nInsignia 50-inch 4K UHD Smart TV: $449.99 $249.99 at Amazon\n\nSave $150: Yes, this is a 50-inch 4K TV, imbued with smarts (including Amazon Alexa!) for under $300. That's a $30 drop from the previous sale price in the lead-up to Black Friday and the best we've tracked for this TV. And once again, we stress that this is a stellar price for a TV of its class.\n\nAmazon Fire TV 50-inch 4-Series 4K UHD Smart TV: $469.99 $329.99 at Amazon\n\nSave $140 - if you're looking to pick up a cheap TV deal this Black Friday, you can grab Amazon's all-new 50-inch 4K Fire TV on sale for just $329.99. That's the first discount we've seen for the 2021 set and an incredible price for a mid-size 4K TV that's packed with premium features and has the Fire operating system built right in for easy streaming.\n\nLG 50-inch UP7000 Series 4K UHD Smart TV: $459.99 $399.99 at Best Buy\n\nSave $60 - Best Buy's Black Friday TV sale has this LG 50-inch 4K TV marked down to just $399.99 - the cheapest deal we've ever seen. The LG display packs a powerful Quad-Core processor 4K resulting in bold, bright colors and realistic images, and includes webOS for easy streaming.\n\nSamsung 55-inch 4K Smart TV: $499 $478 at Walmart\n\nSave $20 – If you're looking for a mid-size Black Friday TV deal, Walmart has the Samsung 55-inch 4K TV on sale for just $478. You're getting a stunning 4K Crystal display and smart capabilities, so you can easily stream all your favorite movies and TV shows from apps like Netflix, Hulu, Disney+, and more.\n\nSamsung 50-inch Q80A Series QLED 4K UHD Smart TV: $1,199.99 $897.99 at Amazon\n\nSave $302 - The QN900A Neo QLED may hold top spot on our best TVs buyer's guide, but it's the Q80A series that we'd pick out as a great 'value' option in today's Black Friday deals. It's capable of 120Hz (perfect for the PS5 or Xbox), has an incredibly powerful 4K Quantum processor, Full Array backlighting, and an ADS panel for unparalleled viewing angles. It's quite simply a beast of a display and today's price is the cheapest all year.\n\nVizio 55-inch OLED TV: $1,299.99 $999.99 at Best Buy\n\nSave $300 - You can grab this best-selling OLED TV from Vizio on sale for just $999.99 at Best Buy's Black Friday sale. That's the best deal we've seen and an incredible price for a premium OLED TV. The 55-inch set features 4K HDR, an OLED panel, Dolby Vision and HDR10+, HDMI 2.1, and a 120Hz panel.\n\nSamsung 55-inch The Frame QLED 4K Smart TV (2021): $1,499.99 $997.99 at Amazon\n\nSave $502 - If you're after the popular Frame TV, Samsung's 55-inch art-inspired is on sale for $999 in this epic Black Friday deal. That's a massive $500 discount and the cheapest deal we've ever seen. The 65-inch TV transforms into a beautiful piece of art to seamlessly blend into your home's decor and includes customizable bezels, a QLED display, and smart capabilities.\n\nSony 55-inch A80J BRAVIA OLED 4K Smart TV: $1,799.99 $1,399.99 at Best Buy\n\nSave $400 – Sony's A80J Bravia OLED TV has seen a sudden, massive price drop to just $1,799. The gorgeous OLED TV packs a stunning picture and excellent sound quality, thanks to the powerful cognitive processor XR, making it a fantastic choice for a home cinema upgrade. Don't miss out. 65-inch: $1,799 $1,399 | 77-inch: $3,499 $2,999\n\n32-49 inch TVs\n\nInsignia 24-inch Smart HD Fire TV: $169.99 $99.99 at Amazon\n\nSave $30 - Today's cheapest Black Friday TV deal is this 24-inch set from Insignia that's on sale for just $99.99 - a fantastic price if you're looking to pick up a cheap TV for the home. The HD display includes the Fire TV experience so you can stream movies from Netflix, Hulu, Amazon Video, and more.\n\nToshiba 32-inch Smart HD Fire TV: $179.99 $129.99 at Amazon\n\nSave $30 - One of Amazon's cheapest Black Friday TV deals is this Toshiba 32-inch Fire TV that's on sale for a record-low price of $129.99. This is an excellent option if you're looking to pick up a small display for an extra bedroom, and you're getting the Fire TV experience for seamless streaming.\n\nTCL 43-inch 4-Series 4K Smart Roku TV: $429.99 $299.99 at Walmart\n\nSave $130 - Walmart's Black Friday Deals for Days sale has this TCL 43-inch 4K TV on sale for just $299.99. You're getting the Roku operating system built-in, excellent smart capabilities, plus an easy-to-use remote that features voice search and control.\n\nToshiba 43-inch Smart HD Fire TV (2021): $369.99 $289.99 at Amazon\n\nSave $80 - If you're looking for a smaller budget set in today's Black Friday TV deals, Amazon has this 43-inch set from Toshiba on sale for just $229.99. While the smart TV lacks 4K resolution, you're getting the Fire TV experience and a handy voice remote with Alexa.\n\nSamsung 43-inch The Frame QLED 4K Smart TV (2021): $999.99 $797.99 at Amazon\n\nSave $202 - The Black Friday TV deals event is one of the best opportunities to snag Samsung's The Frame TV on sale, and we've just spotted this 43-inch display on sale for a record-low price of $799.99. The stunning TV features a QLED display and transforms into a beautiful piece of art when you aren't watching TV.\n\nSee more of the best Black Friday TV deals\n\nBlack Friday deals: laptops and computing\n\nLaptops under $300\n\nSamsung Chromebook 4 11.6-inch 32GB SSD: $199.99 $129 at Walmart\n\nSave $70.99 - Samsung makes great stuff if you're on a budget and this entry-level Chromebook 4 is no exception to that. It's not super powerful, but you don't need much for ChromeOS and it's solidly built for the price. At 11.6-inches, it's a smaller machine but perfect for school work or casual browsing online. Being on the light-side makes it very portable too - perfect for the rucksack.\n\nLenovo Chromebook Flex 3 (11.6-inch, 2-in-1): $319 $159 at Amazon\n\nSave $60 - Another solid Chromebook option if you're on a budget, this 11-inch Lenovo Chromebook Flex 3 is going to be a good one for covering the basics. The Mediatek processor isn't mindblowing, but it'll browse fine and you've also got 64GB of storage on this model - something that's not always seen on these super cheap Chromebooks. Being a 2-in-1 laptop too is fantastic for the price, allowing use as both a laptop and a tablet, which is particularly good for young kids.\n\nLenovo IdeaPad 3 11.6-inch Chromebook, Intel Celeron, 4GB RAM, 64GB SSD: $219.99 $149.99 at Amazon\n\nSave $70 – If you'd like to forgo the 2-in-1 form factor of the Flex 3 above for a more traditional laptop experience, then this IdeaPad 3 Chromebook is a fine option. It's got a more powerful Intel Celeron processor, 4GB of RAM, as well as that larger 64GB of storage too. Again, this one's more suited to simple browsing and school tasks but we'd absolutely consider it if you want something solid and subdued on a budget.\n\nLenovo Chromebook, 14-inch, Mediatek CPU, 4GB RAM, 32GB eMMC storage: $239 $185 at Walmart\n\nSave $57 – The 32GB eMMC flash storage in this cheap Lenovo Chromebook means you'll be best utilizing the extra storage from the cloud and microSD card slot for most of your files. The MediaTek processor is an unusual step away from mainstays Intel and AMD that you would see in more premium models. However, you do get 4GB RAM and up to 10 hours of battery life with this Chromebook making it great value for money for a basic machine.\n\nSamsung Chromebook 4+, 15.6-inches, Intel Celeron, 4GB RAM, 32GB eMMC: $299 $199 at Best Buy\n\nSave $100: This Samsung Chromebook is the upgraded version of the above \"super cheap\" non-plus model. It's still decently powerful with a Intel Celeron processor, 4GB of RAM, and 32GB of storage, but you'll also get a larger 15.6-inch screen. That makes this one a bit less portable but generally more usable for day to day tasks like school work or streaming videos. While a bit pricier, this is definitely a great buy if you're looking for something with more solid build quality and a decent screen.\n\nLaptop deals between $300-$500\n\nDell Inspiron 15 3000 Laptop: $534.98 $329.39 at Dell\n\nSave $195 – Here's almost $200 off an excellent mid-range Dell laptop. For a spec that features a fast i3 processor, 8GB RAM, and 128GB storage you'd usually pay above $400. It's a great price for a solid all-purpose device for general home or work tasks without compromising on any components. Limited quantities are available so you'll want to buy now to avoid missing out!\n\nHP 14z, Ryzen 3, 8GB RAM, 128GB SSD: $429.99 $349.99 at HP\n\nSave $80 – This HP laptop has a very similar spec to the Dell above but features a smaller 14-inch screen so will be a better choice for those who prefer portability. A Ryzen 3 processor, 8GB RAM, and a 128GB SSD are good value at this price and ideal for a general-purpose machine for light work and everyday tasks.\n\nHP 17.3-inch laptop, Intel i3, 8GB RAM, 256GB SSD: $549.99 $399.99 at Best Buy\n\nSave $150 – This excellent mid-range HP laptop is now $150 off at Best Buy. It features a large 17.3-inch screen, Intel i3 processor, 8GB of RAM and a 256GB SSD. All ideal components at this price point if you need an everyday machine for general browsing and light work.\n\nHP Pavilion Laptop 15 | Intel i5, Iris Xe, 8GB RAM, 256GB SSD: $699.99 $549.99 at HP\n\nSave $150 - A Black Friday discount on a laptop is hard to resist, which makes the already affordable HP Pavillion Laptop 15t an even more compelling option. Those looking to upgrade their laptop for one with new components will appreciate this particular configuration's 11th-gen i5, Iris Xe, 8GB memory and 256GB storage combo. And, that's before mentioning the long battery life that's also on offer.\n\nLaptop deals over $500\n\nAcer Swift 3, 14-inch, Intel i7, 8GB, 256GB | $849 $693 at Amazon\n\nSave $157 - The Swift 3 might be cheaper than the usual suspects from Dell, Samsung, or HP, but it's an ultrabook that can absolutely hang with the best. This particular model with an Intel Core i7-1165G7, 8GB RAM, and 256GB SSD is particularly good for the money if you need something with a bit of power under the hood. While you can use this machine for pretty much anything (aside from gaming), we'd recommend it particularly as a solid no-nonsense machine for work applications.\n\nHP 15t, Intel i7, 16GB RAM, 256GB SSD: $749.99 $529.99 at HP\n\nSave $220 – Of all the laptop deals HP has put live this Black Friday this is one of our favorites so far. The i7 processor and 16GB of RAM are fantastic inclusions at this price point and mean it's one for anyone who needs a device for more demanding work or lots of multitasking.\n\nDell XPS 13: $949.99 $649.99 at Dell\n\nSave $300 - The Dell XPS 13 has sat at the top of our laptop rankings for around a decade, only getting better with each new version. This discount is the cheapest we've seen an XPS 13 all year. It's a versatile machine with a 13.3-inch Full HD InfinityEdge display, Intel i5 processor, 8GB RAM, and a 256GB SSD. Basically, it's everything you could want from a high-performance laptop for work, school, or just general use.\n\nMicrosoft Surface Laptop 4: $899 $699.99 at Best Buy\n\nSave $200 - Score a powerful, premium ultrabook for its lowest ever price in today's Black Friday laptop deals at Best Buy. This particular spec for the Surface Laptop 4 includes an AMD Ryzen 5 4680U processor, 8GB of RAM, and 128GB SSD - great baseline specs for both casual and work tasks.\n\nSamsung Galaxy Book Flex2 Alpha (13.3-inch, 2-in-1): $1049 $609.99 at Samsung\n\nSave $440 - Samsung's excellent lineup of Galaxy ultrabooks also includes the Flex2 Alpha. Aside from having a slightly absurd name, this handy 2-in-1 laptop can be used as both a traditional laptop and a tablet. Despite that extra functionality, you'll also get a hefty Core i7 processor, 16GB of RAM, a 512GB SSD, and a gorgeous QLED screen with this model.\n\nMacBook Pro M1 (512GB, 2020) | $1,499 $1,349 at Amazon\n\nSave $150 - Apple blew us away when it launched the MacBook Pro with its own custom Apple M1 chip last year. Not only was it more powerful than most Intel U-series chips, but battery life is incredible too - and with 8GB RAM, this beast is $150 off at Amazon now.\n\nDell XPS 17, Core i7, 32GB RAM, 512GB: $2,299.99 $1,649.99 at Dell\n\nSave $650 - The XPS 17 is pricey at the best of times, but this Black Friday deal from Dell softens the blow significantly with an incredible $650 discount bring the price down to a record-low of $1,649.99. This laptop is pretty close to perfect, with the exception of its short supply of ports.\n\nGaming laptops\n\nHP Pavilion 15.6-inch gaming laptop: $799 $599.99 at HP\n\nSave $200 - One of this today''s best 'super cheap' gaming laptop deals is this 15.6-inch HP Pavilion. While it's not super powerful, it's very good value thanks to its GTX 1650 graphics card, 8GB of RAM, 256GB SSD, and Ryzen 5-5600H processor - a really decent CPU in particular to have at this price. If you're really on a budget this week this one will serve you well.\n\nHP Victus 16.1-inch gaming laptop: £1,249 $1,199.99 at HP\n\nA very reasonably priced RTX 3060 Black Friday gaming laptop deal can be found over at HP on this 16.1-inch Victus. While not quite as premium as the brand's Omen line, this machine looks great and also features an Intel Core i7-11800H, 16GB of RAM, and 512GB SSD - specs that'll handle nearly any game at 1080p no problem.\n\nGigabyte Aorus gaming laptop, 15.6-inch, Intel i7, Nvidia RTX 3080, 32GB, 1TB | $2,349 $1,899 at Best Buy\n\nSave $450 - Take your gaming on the go with this Gigabyte Aorus RTX 3080 gaming laptop, featuring an Intel Core i7-11800H processor, 32GB RAM, 1TB SSD, and a 15.6-inch full HD (1080p) display with a 240Hz refresh rate.\n\nDesktops and gaming PCs\n\nHP Pavilion TG01 Ryzen gaming desktop: $1,069.99 $969.99 at HP\n\nSave $100: If you're looking for a gaming PC on a budget we'd recommend this HP Pavilion. While you can build this one super cheap (starting at just $549), we'd recommend speccing this one up to an AMD Ryzen 5-5600G processor, 8GB of RAM, 256GB SSD, and crucially an RTX 3060 graphics card. That's still a nice budget build, but it's going to get you some great performance and give you a nice platform to upgrade in the future.\n\nAlienware Aurora R12 gaming desktop: $1,979 $1,371.99 at Dell\n\nSave $608 - Looking for a gaming desktop that's going to handle pretty much any game you can throw at it? This Alienware Aurora comes with an RTX 3060 Ti graphics card, Intel Core i7-11700F processor, 16GB of RAM, and a 512GB SSD - absolutely amazing specs for the price considering how premium this brand is. Considering you'd pay almost this for the graphics card alone on Ebay right now we'd say this is a very good option.\n\nApple iMac 24-inch, M1, 16GB RAM, 512GB, Yellow: $1,899 $1,849 at B&H Photo\n\nSave $50 - B&H Photo has a discount on the new iMac in yellow just in time for Black Friday. With the M1 chip and 16GB of RAM, this is a great performer, and the 512GB SSD offers plenty of space.\n\nMonitors\n\nMSI Optix G272 27-inch 1080p Gaming Monitor: $398 $188 at Walmart\n\nSave $210 - The MSi Optix G272 might only have full HD resolution (1080p), but it more than makes up for this with a refresh rate of 144Hz for more fluid visuals and a 1ms response time for quicker gameplay responsiveness, making this a great option for eSports enthusiasts.\n\nAlienware 27 Gaming Monitor- AW2720HF: $559.99 $399.99 from Dell\n\nSAVE $160 If you're looking out for a great monitor deal this Black Friday, this Alienware 27 could be for you. Offering a 240Hz refresh rate and true 1ms response time, it's 29% off with Dell now!\n\nSee more of the best Black Friday laptop deals\n\nThe best Black Friday deals: smart home\n\nSmart speakers\n\nEcho Dot (3rd Gen) + free Sengled bulb: $54.99 $19.99 at Amazon\n\nSave $34.99 - This Black Friday deal from Amazon slashes 63% off the price of the third-gen Echo Dot - and includes a free Sengled Bluetooth Color bulb. The smart speaker can play music, answer questions, check the weather and control your new smart bulb - all you have to do is ask Alexa. Note, Amazon's all out of immediate stock with this deal but you can still get it on backorder at the same price for an early December delivery.\n\nAmazon Echo Dot (4th gen): $49.99 $29.99 at Amazon\n\nSave $20 - Our favorite Black Friday device deal is a massive 40% discount on the best-selling Echo Dot. That brings Amazon's latest smart speaker down to just $29.99, which is just $5 more than the record-low price and a fantastic deal for this Alexa-enabled speaker.\n\nAmazon Echo (4th Gen): $99.99 $59.99 at Amazon\n\nSave $40 - If you're looking for a more robust smart speaker, Amazon's Black Friday deals event has the best-selling Echo on sale for a record-low price of $59.99. The powerful speaker delivers rich sound that adapts to any room and works with Amazon Alexa to become a smart home hub.\n\nEcho Dot with Ring Video Doorbell Wired: $59.99 $41.99 at Amazon\n\nSave $18 - Amazon's Black Friday deals event has the Ring Video Doorbell wired on sale for a record-low price of $41.99, and a free 4th generation Echo Dot smart speaker. The Alexa-enabled doorbell is installed using your existing doorbell wiring, so you'll get non-stop power and won't have to worry about replacing the battery.\n\nGoogle Nest Mini (2nd Generation): $49.99 $24.98 at Walmart\n\nSave $25 - Google's must-have home assistant speaker is a great combination of affordability and ability. The speaker is quite capable, and although you won't be hosting any parties with it, it's great for watching videos, listening to tunes when you're washing up, or as a backup in the bedroom. At this price at Walmart, it's a steal.\n\nStreaming devices\n\nFire TV Stick Lite with Alexa Voice Remote: $29.99 $17.99 at Amazon\n\nSave $12 - If you're looking to pick up a cheap streaming device, Amazon's Black Friday deals event has the Fire TV Stick Lite on sale for a record-low price of just $17.99. The affordable streaming player allows you to enjoy tens of thousands of channels, apps, and Alexa skills and features an Alexa voice remote.\n\nFire TV Stick 4K with Alexa Voice Remote: $49.99 $24.99 at Amazon\n\nSave $25 - Stream your favorite content in 4K resolution with HDR too, with the 4K Fire TV Stick that's on sale for just $24.99. That's a massive 50% discount and the lowest price we've ever seen. This fantastic Black Friday deal is currently in stock and ready to ship, so we recommend snagging this new low price now before it's too late.\n\nAll-new Fire TV Stick 4K Max: $54.99 $34.99 at Amazon\n\nSave $20 - Amazon's all-new Fire TV Stick 4K Max is on sale for $34.99. That's the cheapest deal you can find and the first discount we've seen on the powerful streaming device. Amazon's Fire TV Stick is 40% more powerful than the Fire TV Stick 4K and features support for next-gen Wi-Fi 6. We don't predict you'll see a better bargain during the official Amazon Black Friday sale, so we've snag today's record-low price while you can.\n\nFire TV Cube: $119.99 $79.99 at Amazon\n\nSave $40 - Today's Black Friday deal from Amazon includes the powerful Fire TV Cube on sale for $79.99. That's a $40 discount and the lowest price we've found for the hands-free 4K streaming player that's Alexa compatible.\n\nRing doorbells\n\nRing Wired video doorbell and Amazon Echo Dot: $99.98 $41.99 at Amazon\n\nSave $38 - Bundles are a great way to save on smart home tech on Black Friday. Not only has Amazon dropped the price of the Ring Video Doorbell Wired (see below), it's also bundling the device with a free Amazon Echo Dot (3rd generation), which is also currently discounted to just $19.99.\n\nAmazon Ring Wired and Amazon Echo Show bundle: $144 $61 at Amazon\n\nSave $82 - Get more than half off this Amazon Ring Wired Video Doorbell and Amazon Echo Show 5 (2nd Gen) bundle with 1080p video recording, two-way talk, advanced motion detection, and customizable privacy protection with real-time notifications sent right to your phone. Note, due to the popularity of this deal immediate stock has now all sold out at Amazon. You can, however, still order one at this price for a mid December delivery date.\n\nRing Video Doorbell (2020): $99.99 $79.99 at Amazon\n\nSave $20 - This is the latest Ring doorbell, with 1080p footage and improved motion detection. It's back down to its lowest price ever for Black Friday. Get notifications when someone's at the door, watch footage on your phone, control it using Alexa – the latest Ring doorbell does it all.\n\nSecurity cameras and systems\n\nBlink Mini security camera: $34.99 $19.99 at Amazon\n\nSave $15 - The Blink Mini was a Black Friday best-seller at last year's sale and Amazon just dropped the smart security camera to $19.99 - the cheapest deal we've seen. The indoor HD camera works with Amazon Alexa and alerts your smartphone whenever motion is detected.\n\nKasa Indoor Pan/Tilt Smart Home Camera: $39.99 $29.99 at Amazon\n\nSave $10 - Black Friday is the best time to invest in smart home devices big and small. With this Kasa Indoor Pan/Tilt camera at 25% off this Black Friday – the cheapest we've seen it all year – it might be time to invest in an indoor smart camera that works seamlessly with Alexa and your Echo devices. At $30, there's a lot of features to love here, including real-time motion and sound detection, a 113-degree tilt and 360-degree pan, and smart home integration that lets it perform Smart Actions like triggering the alarm or the spotlight when it detects motion during your chosen times in the day.\n\nWyze Cam Spotlight: $52.96 $49.96 at Amazon\n\nSave $3 - While this $3 Black Friday discount might not seem like much, a security camera under $50 is a fantastic value, and the Wyze Cam is one of the best home security cameras on the market. The spotlight will turn on automatically when motion is detected and alerts will be sent to your phone.\n\nSmart displays\n\nAmazon Echo Show 5: $89.99 $44.99 at Amazon\n\nSave $40 - If you're looking for a Black Friday deal on a smart home display, Amazon has the 2nd generation Echo Show 5 on sale for just $44.99. That's the lowest price we've seen and a fantastic deal for a feature-rich smart home display that includes the Amazon Alexa voice assistant. Note, these devices are now shipping for a mid-December delivery date due to this sale's popularity.\n\nAll-new Echo Show 5 with Blink Mini: $119.98 $49.99 at Amazon\n\nSave $29.99 - Our favorite Black Friday bundle deal is the All-new Echo Show 5 with the Blink Mini that's on sale for $49.99 at Amazon. The Echo Show 5 smart display retails for $49.99 on its own so with this deal you're getting a Blink Mini security camera for just $5. The Blink Mini works with the Echo Show so you can monitor your home from your display. Note, shipping for a mid-December delivery date.\n\nEcho Show 8 (1st Gen, 2019 release): $109.99 $59.99 at Amazon\n\nSave $50 - Black Friday and Cyber Monday are among the best times of the year to score an Amazon device for less. One of the best deals we've found this year is on this 2019 Echo Show 8, which offers an 8-inch HD display, stereo speakers, and a whole lot of convenience in accessing and controlling your smart home devices. It's almost 50% off this time around, the cheapest we've seen it this year. Plus, if you do a trade-in with one of your existing Echo devices, you can get up to $30 in the form of a gift card.\n\nKindle e-readers\n\nAll-new Kindle Paperwhite: $139.99 $104.99 at Amazon\n\nSave $35 – The newest Kindle Paperwhite just got its first-ever price cut in the US at Amazon's Black Friday deals event and it brings the e-reader down to just above $100. If you're after a Kindle with some nice quality of life additions like a blue light filter and a long battery life, this is the deal to get this Black Friday.\n\nAmazon Kindle: $89.99 $49.99 at Amazon\n\nSave $40 – Amazon's most basic Kindle is still on sale today despite all selling out of immediate stock. If you're looking to bag one at this price we'd hurry although note - the soonest delivery date is now late December. Unsurprisingly this excellent little e-reader is really popular this year thanks to its combination of great software and super long battery life.\n\nAmazon Kindle Oasis 8GB: $249.99 $174.99 at Amazon\n\nSave $85 – Only buy the top-end Kindle if you're a true bookworm, but this is the very best of the range if you're looking for something you'll be using every single day. This is for the 8GB version that comes with a metal design, a 7-inch display and an adjustable warm light display. Note, the basic 8GB model is now shipping for an early December delivery date. Need more storage? 32GB is down to $194.99\n\nAmazon Kindle Kids: $109.99 $59.99 at Amazon\n\nSave $50 – The Kindle Kids edition is similar to the standard model, but it comes in a protective case (that comes in a variety of colors) as well as including Amazon Kids+ for a year. If you've got a little one who wants to read more, the Kindle Kids could be the best route to go for them.\n\nMore smart home deals\n\nKasa Smart Plug HS103P2: $19.99 $14.99 at Amazon\n\nSave $5 - For just $14.99 you can get your hands on the best-selling Kasa smart plug at Amazon's Black Friday sale. The two-pack smart plugs allow you to add voice control to any outlet and you can turn off and on any device using your smartphone or the Kasa app. This is the lowest price we've seen for the smart plugs and a particularly handy purchase if you're planning a festive light display.\n\nPhilips Hue White and Color Lightstrip Plus 2M Starter Kit: $109.99 $68.99 at Best Buy\n\nSave $41 – There's a significant $41 saving on this starter set for the Philips Hue Lightstrip. Use it to jazz up the ambiance in any room around your home. Be that adding a customizable glow effect behind the TV, fitting strip lights in the kitchen, or whatever your imagination decides.\n\nGoogle Nest Learning Thermostat: $129.99 $89 at Amazon\n\nSave $40 - A great gift idea, you can get the best-selling Google Nest thermostat on sale for an all-time low price of $99 at Amazon's Black Friday deals event. The learning thermostat can program itself and automatically turns itself down when you're away to avoid heating or cooling an empty home.\n\nBlack Friday deals: headphones and audio\n\nEarbuds\n\nAirPods with wired charging case: $159 $99 at Amazon\n\nSave $59 - If you're looking for the cheapest Black Friday AirPods deal, Amazon has the 2019 AirPods with wired charging case on sale for just $99 when you apply the additional $15 coupon at checkout. That's just $10 more than the record-low price and the best deal we've seen in months. This offer is in stock and ready to ship, so we'd snap up this limited-time offer while you can.\n\nAll-new Apple AirPods Pro: $249 $169.99 at Amazon\n\nSave $79 - Amazon's record-low price for the new Apple Airpods Pro has unfortunately ended, but this current deal is only $10 more. With this latest edition, you'll not only get a refined version of the best-selling AirPods Pro but a handy new MagSafe Charging Case that works great with an iPhone 12 or 13.\n\nJBL Tune 225TWS True Wireless Earbuds: $99 $49.95 at Amazon\n\nSave $40 - Here's a great little pair of wireless earbuds from JBL that prove you don't have to spend big to get a decent set. At full price, these aren't the best call but a $40 discount from Amazon's Black Friday deals make them a really decent option if you're on a budget. With an AirPods-like aesthetic, these bass-heavy true wireless earbuds are great for rap, R&B, and EDM.\n\nPowerbeats Wireless Earbuds: $149 $79.97 at Amazon\n\nSave $69 - The Beats Powerbeats aren't true wireless like the AirPods or Studio Buds, but they'll literally never fall out of your ears during a run or workout thanks to their comfortable hook-round design. They sound great in our opinion, and having Apple's H1 chip inside means you're going to get great hands-free Siri performance and excellent device pairing.\n\nOver-ear headphones\n\nBeats Studio 3 wireless over-ear headphones: $349.99 $169.99 at Best Buy\n\nSave $180 - This enormous saving on the Beats Studio 3 is well worth looking into, especially if you're keen on scoring 6 months free of Apple Music, a fantastic trial to take the fantastic audio quality and noise cancellation of the Studio 3 over-ears for a spin.\n\nSony WH-1000XM4 Wireless Headphones: $349.99 $248 at Best Buy\n\nSave $101 - Hands-down the best headphones on the market, these XM4s deliver class-leading noise cancellation, audio upscaling, superior comfort, and a sleek design. While they're certainly not cheap, this is the best price we've ever seen on these cans, so they're definitely worth considering.\n\nBose QuietComfort 45: $329 $279 at Amazon\n\nSave $50 - Amazon's Black Friday deals include these fresh ANC cans from Bose seeing their first discount since their recent launch. For your money, you're getting a pair of wireless headphones with intuitive controls, excellent noise cancellation, and a comfortable design.\n\nApple AirPods Max: $549 $479 at Amazon\n\nSave $70 - Apple's powerful AirPods Max did hit a record-low price of $439.99, but this is still a sizable saving. The over-ear headphones feature active noise cancellation to block out unwanted noise and provide up to 20 hours of battery life.\n\nSpeakers and soundbars\n\nSamsung HW-T415 soundbar: $149 $99 at Walmart\n\nSave $50 - Samsung is a great brand that often carries a hefty price tag. That's not the case with this superb discount on the Samsung HW-T415 today at Walmat. While reasonably priced, it's definitely a solid option and comes with a wireless subwoofer, perfect for those who love punchy bass.\n\nMarshall Emberton: $150 $129.99 at Amazon\n\nSave $20 - Whether it's the IPX7 water-resistant rating, over 20 hours of use, or light weight, this portable speaker from Marshall has a lot going for it. And, this Black Friday, it's cheaper than we've seen it this year, now at 13% off. Of course, that wouldn’t matter if it didn’t sound good, which it does. In fact, its multi-directional sound means that you can hear the music clearly no matter where you’re sitting in relation to it.\n\nFluance RT81: $349.99 $249.99 at Walmart\n\nSave $100 - The Fluance RT81 is one of the best starter turntables you can buy, thanks to an easy setup and good sound quality - and at this price, it offers incredible value for money.\n\nSony SRS-RA3000 360 Reality Audio Wi-Fi / Bluetooth Wireless Speaker: $299.99 $178 at Amazon\n\nSave $121.99 - This stylish speaker from Sony promises 360-Reality Audio, omnidirectional sound, Wi-Fi, and Chromecast support. It also works with Alexa, so you can control it using your voice if you have an Echo speaker.\n\nSee more of the best Black Friday Airpods deals\n\nSee more of the best Black Friday headphones deals\n\nThe best Black Friday deals: tablets\n\niPads\n\n2021 Apple 10.2-inch iPad (256GB Wi-Fi): $479.99 at Amazon\n\nLooking for a new iPad this Black Friday? Finding a cheap one right now is very, very hard since the baseline 10.2 model is literally sold out everywhere across the board. We would, however, recommend this 256GB Wi-Fi model as a good alternative. There's no price cut, but there's no upcharge either, which makes it a fair purchase today. Note - there are price cuts on the Pro and Air models today, but these devices are much, much pricier. See our tablets section for more options.\n\niPad Air 2020 (256GB, Wi-Fi): $749 $699 at Amazon\n\nSave $40 - All baseline 64GB iPad Air's have been pretty much snapped up at most retailers today but you can still get yourself a nice little price cut on the 256GB version today at Amazon. The bad news is it's a fair bit pricier than the 64GB model, but the good news is you'll have so, so much more space for all your media, apps, and games. At only $100 more than a full-price 64GB version, we'd say this one's definitely worth the upcharge.\n\nApple iPad Pro 11 2021 (128GB, Wi-Fi): $799 $749.99 at Best Buy\n\nSave $50 - It's not a huge price cut, but this discount from Best Buy is the cheapest price around for the iPad Pro 11. Similar discounts have already sold out at Walmart and Amazon so we'd definitely pick this one up sooner rather than later if you're interested. If you're looking for a powerful tablet for design work you won't beat this model - although some would say it's overkill for the majority of casual applications.\n\niPad Pro 12.9-inch 2021 (128GB, Wi-Fi): $1,099 $999 at Amazon\n\nSave $100 - Amazon has the all-new 12.9-inch iPad Pro on sale for $999. That's a $100 discount and the lowest price we've seen for the 2021 tablet. The Apple iPad Pro delivers laptop-like power and speed thanks to Apple's M1 chip. Note, due to the popularity of this item, delivery dates are now early January - be aware of that before you jump in and snag one.\n\nAmazon Fire tablets\n\nAmazon Fire 7 tablet: $49.99 $34.99 at Amazon\n\nSave $15 - The cheapest Fire tablet deal has the Fire 7 on sale for just $34.99. The 2019 tablet features a 7-inch display, 16GB of RAM, and up to seven hours of battery life. If you're looking for a tablet to read a book on in the shade, watch the occasional YouTube video and order some shopping, it's a great choice - as we said in our review. But if watching movies or reading in sunlight are priorities, you’ll need to spend more.\n\nAmazon Fire HD 8 (32GB): $89.99 $44.99 at Amazon\n\nSave $45 - This is Amazon's mid-sized tablet, and half off makes it a tempting buy this Black Friday. You can get the same amount off the 64GB, or ad-free, versions of the slate, though they cost a bit more.\n\nAmazon Fire HD 10 Plus: $179.99 $104.99 at Amazon\n\nSave $75 - Amazon just dropped the Amazon Fire HD 10 tablet on sale for $104.99 - a new record-low price for the top-spec Fire device. The 10-inch tablet includes plus wireless charging, 4 GB RAM, and a powerful octa-core processor.\n\nMore tablets\n\nMicrosoft Surface Pro 7 12.3\": $1,199.99 $799.99 at Best Buy\n\nSave $400 - The Surface Pro 7 isn't a cheap piece of kit, but with a massive $400 knocked off it starts to look a little more attainable. Although it has now been superseded by the Pro 8, the 7 is still hugely powerful and puts up a good fight against similarly priced laptops. Unfortunately you'll have to buy the keyboard cover separately, but that's just how Microsoft does its thing.\n\nLenovo Tab P11 Pro | Wi-Fi | 128GB: $500 $359.99 at Walmart\n\nSave $55 - If you're looking for a good-looking and fairly powerful Android tablet, the P11 Pro could be a good option, with an 11-inch display, a mid-range processor, and a big battery - it's a good choice for work or play. It's currently on sale for $450 at Walmart's Black Friday sale.\n\nSamsung Galaxy Tab A7 Lite 8.7\" 64 GB: $199.99 $129.99 at Best Buy\n\nSave $70 - Fancy something just a little cheaper? How about the Galaxy Tab A7 Lite? While you won't want to push it with heavy-duty video editing and the like, as something for day to day streaming, handing over to the kids or chucking in your backpack on a day out, it's an excellent option.\n\nSamsung Galaxy Tab S7 11” 256GB with S Pen: $729.99 $529.99 at Best Buy\n\nSave $200 - Big savings on the Samsung Galaxy Tab S7 here, with an S Pen thrown in for good measure. The S7 is as close to an iPad killer as Android tablets have got so far, and while the app support isn't quite as robust as Apple's offerings, it's a true rival to Microsoft's Surface Pro.\n\nSee more of the best Black Friday tablet deals\n\nSee more of the best Black Friday iPad deals\n\nThe best Black Friday deals: gaming and consoles\n\nConsoles\n\nNintendo Switch (Neon) | Mario Kart 8 Deluxe + 3-months NSO: $299.99 at GameStop\n\nSave $70 – If this isn't your first Black Friday you'll no doubt recognize this Nintendo Switch bundle from the previous sales. In it, you get a Switch (Neon) console, a copy of Mario Kart 8 Deluxe, and 3-months of Nintendo Switch Online membership. It's still good value as all of these items would cost around $370 at full price.\n\nXbox Series S - Fortnite & Rocket League Bundle: $299.99 at GameStop\n\nThis bundles packs in an Xbox Series S plus content for Fortnite and Rocket League all for the price of the console on its own. GameStop is also offering a deal where you can get three months of Game Pass Ultimate for just $9.99 when you buy a console.\n\nXbox Series S: $299 at GameStop\n\nThis is the regular price for the Xbox Series S console and is already good value for money when paired with Xbox Game Pass to give you access to hundreds of games. Buy from GameStop and you can get three months of Game Pass Ultimate for just $9.99 when you buy a console.\n\nGames\n\nGuardians of the Galaxy: $59.99 $26.99 at GameStop\n\nSave $33 – A surprising 58% discount is already available on Guardians of the Galaxy at Amazon. The Eidos Montreal RPG has reviewed well and has only been out for a month so such a considerable price cut so soon is hardly ever seen. It's a smashing deal that's still live now Black Friday has passed.\n\nCall of Duty Vanguard: $69 from $39 at GameStop\n\nSave $30 – GameStop is here with the lowest price on Call of Duty Vanguard just two weeks after launch. At just $39 it's one of the best Black Friday gaming deals you can find today. We don't know how long this offer will be available for so if you've had your eye on the latest entry in the series you probably won't find a lower price this year.\n\nOutriders: $39.99 $19.99 at Best Buy\n\nSave $20 – A bargain price for one of the year's biggest surprise hits. This low price since mid-October so it's not a new low for Black Friday but it seems unlikely it'll be discounted further in a couple of weeks. Definitely one to pick up if you like your looter shooters.\n\nFar Cry 6 PS5 Standard Edition: $59.99 $35 at Amazon\n\nSave $24.99 - Straight from Ubisoft, take down Castillo's regime and play as Dani Rojas in a bid to liberate Yara in the creator's greatest long-running open-world shooter series - now down to its lowest ever price.\n\nXbox One: $59.99 $35\n\nMario + Rabbids Kingdom Battle: $59.99 $13.99 at GameStop\n\nSave $46 - A turn-based strategy game that no one saw coming, Mario and Co. team up with the raving Rabbids to restore order to the Mushroom Kingdom in this chaotic mashup. It's impossible not to recommend at this cheap price.\n\nMore gaming deals\n\nRazer gaming headsets, mice, keyboards: now on sale at Amazon\n\nAmazon's Black Friday sale always includes fantastic prices on Razer peripherals and this year is no exception to that - it is, after all, the most popular gaming brand nationwide. If you're looking for a top-end keyboard, a mice that perfectly suits your setup, or a decent headset that will last a good few years, this is a great option. We'd particularly recommend the Razer Viper mouse, the Razer BlackShark headset, and the Razer BlackWidow keyboard.\n\nRazer Iskur Fabric gaming chair: $499 $349 at Amazon\n\nSave $149 - Razer is known for making top-shelf gaming peripherals, but it only got into the gaming chair scene last year with the Razer Iskur. This year's follow-up, the Razer Iskur Fabric, improves on the original with a more breathable fabric construction while keeping all of the features that makes the Razer Iskur one of the best gaming chairs around.\n\nPlayStation Plus 12 month subscription: $59.99 $39.99 at Walmart\n\nSave $20 - Walmart's Black Friday sale is offering a $20 discount n 12 months of PS Plus. It's the same offer seen at Best Buy and GameStop right now so, if stock runs out, you can pick up the same offer at those retailers.\n\nXbox Controller: $59.99 $49.99 at Walmart\n\nSave $10 - You can never have enough Xbox controllers, especially if you're planning on Halo evenings soon. These never usually go down in price, so it's a perfect time to snap one up for the collection.\n\nRing Fit Adventure: $79.99 $54.99 at Amazon\n\nSave $25 – You can pick up Ring Fit Adventure for its cheapest price for Black Friday. The exercise-RPG hybrid is very clever at making your workout more enjoyable by wrapping a fun game around it. Sure, it won't replace the gym, but it'll add a new spin to your next set of reps.\n\nADATA XPG GAMMIX S70 Blade 1TB: $169.9 9 $129.99 at Amazon\n\nSave $40 - It might not be the most recognizable name, but the ADATA XPG is actually the fastest drive available for PS5 and at a super low price. With read speeds of 7400 MB/s, it's well above Sony's recommended speeds. It also includes a heatsink and is guaranteed to work on PS5.\n\nGaming headset\n\nTurtle Beach Wired Force Recon 70 Arctic Camo Headset: $37.99 $23 at Walmart\n\nSave 38% - These are optimized for Xbox and Windows PC for gaming, so if you play a lot of Games Pass, these are a good pick. With a saving of $14, they're perfect to plug into your controller for low latency chats and sounds when playing a Halo match.\n\nXbox Stereo Headset: $59.99 $49.99 at Best Buy\n\nSave $10 – This is a good price for the wired version of the official Xbox headset that launched at the start of the year. It's not the cheapest it's ever been – it was $40 just last week – so you can consider holding off for a return of that deal if you'd rather wait. Still, if you're on a budget, this is a great option as it supports high-fidelity audio and Dolby Atmos that are often found on more expensive headsets.\n\nEPOS H3 Gaming Headset: $99.99 $87 at Amazon\n\nSave nearly $12 on the EPOS H3 Gaming headset, which proudly sits on our list of the best Xbox Series X headsets. But this comfortable and sleek all-rounder headset doesn't just work on XSX, it's also compatible with PS5, Switch, PS4 and Xbox One.\n\nEPOS GSP 370 Wireless Gaming Headset: $199.99 $129.99 at Best Buy\n\nThe EPOS GSP 370 is another great headset from EPOS, offering top-notch sound, fantastic battery life and long-lasting comfort. And, with this whopping $70 discount from Best Buy, it's even better.\n\nThe best Black Friday deals: toys\n\nLego sets\n\nLego City Family House: $20 $15.99 at Amazon (save $4)\n\nIf you want a small gift-sized Lego City set, this is a great choice - it's only $4 cheaper but that's actually 20%, making this cute holiday-themed build even more affordable.\n\nLego Ideas Friends Central Perk: $60 $48 at Amazon (save $12)\n\nThis Friends-based set is perpetually on sale, but this is the lowest we've seen it hit. If you're a Friends fan (or know someone who is) this price makes it a lot more affordable than when it's at its original cost.\n\nLego Star Wars Skywalker Adventures Pack: $80 $50 at Walmart (save $30)\n\nWalmart is bundling together three different sets at a reduced price: they are Obi Wan's hut and the Sand Speeder from the original Star Wars, and the Mustafar showdown from Revenge of the Sith. An odd bundle, sure, but it's a pretty good price cut.\n\nNerf guns\n\nNerf sale at Amazon: up to 35% off\n\nA vast number of Nerf toys and blasters are reduced by up to 35% right now at Amazon. Prices start at just $5.99, so you can pick up a cheap gift or one of the various Fortnite tie-in items.\n\nNerf DinoSquad Rex-Rampage Motorized Dart Blaster $41.99 $31.99 at Amazon\n\nAge 8+ Save $8 on this dinosaur-styled motorized dart blaster. It comes with a 10-dart clip and 10 official Nerf Elite darts. You can fire 10 darts in a row at your targets before it's time to reload.\n\nNerf Fortnite Pump SG Blaster: $31.49 $16.99 at Amazon\n\nAges 8+ Save 25% on this Nerf Fortnite Pump SG Blaster. It's inspired by the pump shotgun in the game, and comes with four Nerf mega darts so you can load another dart and keep on battling.\n\nBoard games\n\nCatan: $55 $22 at Amazon\n\nAges 10+ There's a 60% discount on multiplayer strategy game Catan, one of the best board games of all time, right now at Amazon. It's suitable for ages 10+ and you'll need 3-4 players. This $20 saving is not to be sniffed at, but we did see Catan drop lower in price last year so a bigger discount could be had during Black Friday.\n\nExploding Kittens: $20 $9.99 at Amazon\n\nAges 7+ This ridiculous Russian roulette-style card game is designed for \"people who are into kittens and explosions\". It's easy to pick up, suitable for both adults to kids, and has an average rating of 4.7 out of 5 stars from over 50,000 user reviews on Amazon. With 50% off, it's well worth a look.\n\nPandemic: $44.99 $17.99 at Amazon\n\nAges 8+ This 2-4 player game is (not surprisingly) one of the most popular around at the moment. It's all about teamwork and strategy, and suitable for age 8 upwards. Right now there's a 60% discount - we highly recommend it.\n\nSee more of the best Black Friday toy deals\n\nSee more of the best Black Friday lego deals\n\nThe best Black Friday deals: home and kitchen\n\nCoffee machines\n\nInstant Milk Frother: $49.95 $27.99 at Amazon\n\nSave $22: Yes, that's Instant as in Instant Pot. Become the best at-home barista there is with this milk frother. It features a two-button control plus four foam settings so you can make lattes and cappuccinos as you like 'em. Now 44% off for Black Friday, it's the lowest price we've tracked. (Walmart charges a couple of bucks more.) Deal ends November 27 at 2:59 am ET.\n\nMr. Coffee Iced Coffee Maker: $34.99 $24.96 at Walmart\n\n$10 off: For anyone who thinks iced coffee season is all-year round, this deal is for you. This machine will brew your favorite drinks in under four minutes. It's also quite eco-friendly – it includes a reusable tumbler and doesn't require any pods to brew. Nab it for $10 off while you can.\n\nKeurig K-Duo Essentials Coffee Maker: $99 $79 at Walmart\n\nSave $32 – The Keurig K-Duo is a more premium coffee maker, but it does include a single-serve and carafe option. With support for multiple cup sizes and a brewing time of under one minute, you can make a morning cup (or pot) of Joe without the fuss.\n\nKeurig K-Select Single-Serve Coffee Maker: $129.99 $99.99 at Amazon\n\nSave $30 - Amazon has the top-selling Keurig coffee maker on sale for $99.99 at its 2021 Black Friday sale. The single-serve coffee maker can brew a cup in less than one minute and the strength control allows you to make coffee that suits your taste. While today's deal isn't the lowest price we've seen, it's the best deal you can find right now and it's currently in stock and ready to ship.\n\nKeurig K-Cafe coffee machine: $199 $179.99 at Amazon\n\nSave $20 - You'll be able to re-create all your coffee shop favorites with the Keurig K-Cafe. Lattes, cappuccinos, espresso's, and much more in fact. While still a pod-machine, this is the one you'll want to get if you're really serious about your homebrew coffee.\n\nKitchen devices\n\nMagic Bullet Essential Personal Blender: $31 $15 at Walmart\n\nSave $16 - A blender for $15? Yes, please! Walmart's Black Friday sale has a massive 50% discount on the top-rated Magic Bullet - a personal blender that's ideal for anyone trying to portion soups, smoothies, and more. Simply load up the cup, attach the blades, and twist to operate for super quick blends.\n\nNutri Ninja personal blender QB3001: $69.99 $59.99 at Amazon\n\nSave $10 - Ninja's entry-level personal blender, which is often called a smoothie maker, comes with two 16 fl oz canisters and two to-go cups so you can blend your drink and take it with you without having to decant it. While it's not as low as we saw last year when the holiday sales got underway, it's still a good discount. So if you're in the market for a personal blender right now, it's worth snapping up.\n\nBella Pro Series 4.2-qt. Analog Air Fryer: $59.99 $29.99 at Best Buy\n\nSave $30 – Pick up a cheap air fryer deal at Best Buy's 2021 Black Friday sale. Marked down to just $29.99, the Bella 4.2-qt air fryer allows you to air-fry, broil, bake, roast, and reheat with little to no oil, so you can enjoy your favorite fried foods with less guilt.\n\nNinja AF101 Air Fryer: $119.99 $99.99 at Amazon\n\nSave $20 - The best-selling Ninja air fryer just got reduced to $89.99 at Amazon's Black Friday 2021 sale. The four-quart air fryer has over 28,000 positive reviews can whip up all your favorite fried foods without guilt and is dishwasher safe for easy cleanups. Today's deal is the best price you can find right now and just $30 more than the record-low.\n\nInstant Vortex Pro 10 Quart Air Fryer Oven: $159.99 $109.95 at Amazon\n\nSave $50 - Amazon's Black Friday deals event has the top-rated Instant Vortex Pro on sale for $109.95 - just $5 more than the record-low price. The 10-quart air fryer features a pull-down door and can hold two trays of food at the same time and features nine different functionalities, including air fry, bake, broil, dehydrate, roast, proof, toast, reheat, and rotisserie.\n\nNinja Foodi 4-in-1 8-Quart Air Fryer: $179.99 $139 at Walmart\n\nSave $40 - Walmart's Black Friday Deals for Days sale has the Ninja Foodi air fryer marked down to $139. That's $20 more than the record-low price and $20 less than Amazon's current price. Reviewed as one of our best air fryers, the Ninja Foodi features two independent baskets which allow you to cook two different foods, two ways at the same time.\n\nInstant Pot Duo Plus 8-Quart: $139.99 $79.95 at Amazon\n\nSave $60 - With an easier-to-use steam release and a sous-vide cooking function, the Instant Pot Duo Plus offers a handful of upgrades over the brand’s entry-level Instant Pot Duo , and the 8-quart model is now on sale for a record-low price of $79.95 at Amazon's Black Friday sale.\n\nInstant Pot Duo Crisp 11-in-1: $149.99 $129.99 at Amazon\n\nSave $30 - Amazon's Black Friday sale just dropped the best-selling Instant Pot Duo Crisp to a record-low price of $129.99. One our list for the best Instant Pots, the 6-quart multi-cooker can grill, roast, bake, and air fry alongside the usual cooking methods and features an easy-to-release steam valve.\n\nCordless and corded vacuums\n\nSamsung Jet 60 Fit Cordless Stick Vacuum: $299 $179 at Walmart\n\nSave $120 - Walmart is offering an impressive $120 off the Samsung Jet 60 right now, a vacuum that provides a more affordable alternative to premium suckers from the likes of Dyson and Shark. The Jet 60 features a lightweight and manoeuvrable design, as well as a removable battery that can be easily swapped for a spare (extending cleaning time by 40 minutes). Being a Samsung, too, you'll get plenty of intelligent tech bundled inside this one.\n\nShark VACMOP Vacuum Mop Bundle: $99.99 $62.99 at Amazon\n\nSave $38 - This Shark Vacmop has over 17,000 positive reviews and is on sale for a record-low price of just $69.99 at Amazon's Black Friday sale. The vacuum/mop combo includes 12 disposable Vacmop pads and a 12 oz. cleaning solution.\n\nDyson Cyclone V10 Absolute: $549.99 $499.99 at Dyson\n\nSave $50 - Engineered to deep clean anywhere, with up to 60 minutes of run time and three power modes, the Dyson Cyclone V10 Absolute was, for a time, the best vacuum offered by the brand. In fact, it was this cordless device's sucking prowess that made Dyson decide to stop developing corded vacuums going forward.\n\nDyson Outsize Cordless Vacuum Cleaner: $799.99 $599.99 at Best Buy\n\nSave $200 - The Dyson Outsize isn't strictly part of the V11 range, so we're hesitant to include it here, but it's nonetheless the most comparable option given the lack of V11 vacuum deals out there right now. This model is exclusive to the US, and falls somewhere between the Dyson V11 Outsize and Dyson V15 Detect. Put simply, it's a swiss army knife of a vacuum, and Best Buy has slashed its price by $200 – the biggest discount we've ever seen on the hardware. In the absence of Dyson V11 deals in the US, then, this is, in our opinion, the best option beyond the pricey V15 Detect.\n\nDyson Outsize Total Clean cordless vacuum: $849.99 $649.99 at Best Buy\n\nSave $200 - Dyson vacuums are always Black Friday best-sellers, and Best Buy has the Dyson V11 Outside on sale for $649.99. That's a massive $200 discount and the lowest price we've seen for the powerful stick vacuum. The Dyson V11 works across hardwood floors and carpets and can transform into a handheld vac for quick and convenient clean-ups.\n\nRobot vacuums\n\nEufy Robovac 25C Robot Vacuum: $149 $127 at Walmart\n\nSave $23 – This discount beats the previous record low price and makes it one of the most affordable robot vacuum cleaners you can buy right now. Multiple control options – including touch and voice – and the 100-hour battery life make it a convenient and low-effort way to keep your home clean.\n\niRobot Roomba 692 Robot Vacuum: $299.99 $174.99 at Amazon\n\nSave $125 - Roomba robot vacuums are one of the most popular Black Friday deals, and Amazon has a $100 discount on the best-selling iRobot Roomba 692. That brings the price down to just $174, which is a fantastic price for a robot vacuum and the lowest price we've ever seen.\n\niRobot Roomba i1+ Wi-Fi Connected Self-Emptying Robot Vacuum: $579 $349 at Walmart\n\nMake cleaning easier with this self-emptying, Wi-Fi-connected robot vacuum cleaner. It cleans in neat rows and has patented dirt-detect technology to give more attention to the dirtier areas of your home.\n\nShark EZ Robot Vacuum RV912S: $549.99 $299.99 at Best Buy\n\nSave $250 - Roomba might be the biggest name in robot vacuums, but it's not the only one. This cleaning bot from Shark is self-emptying, works well on tricky corners, and has a huge $250 discount at Best BUy ahead of Black Friday.\n\nBedding, mattresses and sleep accessories\n\nNectar Memory Foam mattress: from $798 $499 + $399 free gifts at Nectar Sleep\n\nEditor's choice - This superb mid-range, all-foam mattress sits at number two in our mattress rankings and is exceptional value for money. It offers strong support, pressure relief and motion isolation - we loved sleeping on it - and is a great option for anyone who likes to be 'hugged' by their mattress or who has a restless partner. It's extremely competitive priced, with a queen down from $1,298 to $799, and you'll get two free cooling pillows, sheets and a mattress protector worth $399 added to your order. There's also a year-long risk-free trial to decide whether you like it, and a forever warranty. Some find it warm though, so if you sleep hot we'd advise a hybrid like the Saatva Classic below instead.\n\nSaatva Classic mattress: from $899 - save $250 when you spend $975 or more at Saatva\n\nHotel luxury - The Saatva Classic is number one in our best mattress guide. It costs more than the Nectar, but this premium mattress has been approved by the Congress of Chiropractic State Associations, and is super customizable - it comes in three different firmness options and two heights, and We found it delivers excellent pressure relief in all sleeping positions, while keeping you cool and well-supported at night. It's an excellent choice for hot sleepers, or anyone who likes a traditional mattress feel with a little bounce. Our exclusive Black Friday mattress deal makes a queen size $100 cheaper than on the Saatva site: $1,345, down from $1,595 - there's free white glove delivery too.\n\nThe DreamCloud mattress: from $1,198 $699 + $399 free gifts at DreamCloud\n\nGreat-value hybrid - If the Saatva Classic above sounds great but is out of budget, try the DreamCloud - we think it's the best-value hybrid mattress you can buy, with a $500 discount and $399-worth of free gifts added to your order. Graded as 'luxury firm' (6.5/10), it's a generous 14 inches deep, with five layers, including contouring gel memory foam to relieve pressure, and a layer of individually cased innersprings to provide extra support and increased airflow. if you're a hot sleeper it's well worth considering.\n\nCocoon Chill Memory Foam mattress: from $769 $499 + $199 free gifts at Cocoon by Sealy\n\nBudget cooling - This is one of the best budget cooling mattresses in the US, with effective temperature-regulation features that set it apart from rival all-foam mattresses. It's medium-firm, with excellent pressure relief and motion isolation - if you're a hot sleeper who likes the feel of memory foam you should get on well with it. Currently it's just $30 off the lowest price we've ever seen for itm and it comes with two free pillows and a sheet set worth up to $199.\n\nHelix Midnight mattress: from $699 $599 + 2 free pillows at Helix\n\nGreat for side sleepers - This medium hybrid mattress is designed specifically for side sleepers, people who toss and turn at night, and couples with different firmness preferences. Inside, memory foam and support foam contour to your body and provide pressure relief, while pocket coils cradle your body. There's also a reinforced perimeter for extra support. Helix's Black Friday mattress sale cuts $100-$150 off the price - a queen costs $999 - and you'll get two free pillows.\n\nTempur-Essential: from $1,665 $999 at Tempur-Pedic\n\nCheapest Tempur mattress - Tempur-Pedic's brought back its special-edition medium-soft mattress for Black Friday, and there's up to a $1,332 discount, depending on which size you choose. It's 10-inches deep, with four foam layers that cushion and support you while you sleep. It's a very god choice for anyone who prefers a softer mattress. This one sold out last year (it's the cheapest Tempur mattress you can buy, so that isn't surprising) - so if you like the sound of it grab while you can.\n\nSee more of the best Black Friday mattress deals\n\nThe best Black Friday deals: Fashion\n\nRetail sales\n\nadidas at Amazon: hundreds of items $25 or less\n\nWhether you need a new pair of slides or some fresh workout clothes, we highly recommend you check out the Amazon Black Friday adidas sale, with hundreds of items marked down to $25 or less. You'll find discounts of up to 50% off on tees, shorts, socks, bags, and much more. Stock up before you make that new year's commitment to hit the gym again.\n\nGap Black Friday Sale: 40% + 20% off sitewide, 50% off sale items\n\nFall into big-time savings at Gap this Black Friday. Most items sitewide are 40% off plus an extra 20% off (reflected at checkout). Meanwhile, Really Big Deals are 50% off (prices as marked). Find sweaters from $25, tees from $12, and cold weather accessories from $10.\n\nLevi's Indigo Friday Sale: 40% to 50% off + free shipping sitewide\n\nTime to stock up on some new denim during the Levi's Black...er, Indigo Friday Sale. All full-priced items receive 40% off while sale styles are discounted an extra 50% off (reflected at checkout). Plus, all orders qualify for free shipping and free returns. Still not convinced? How does Levi's jeans from $19.50 sound? Amazing? We thought so.\n\nRalph Lauren Black Friday Event: 40% off orders of $125+\n\nYou may be grimacing at the fact that Ralph Lauren has a minimum purchase requirement for its Black Friday discount, but it's quite easy to hit that threshold at RL – especially since the offer applies to full- and sale-priced items. It's the perfect opportunity to score a significant bargain on a killer outfit for any upcoming holiday parties.\n\nUnder Armour Black Friday Sale: up to 50% off select styles\n\nUnder Armour is discounting over 2,500 items during its Black Friday sale. (Prices are as marked.) Most items fall comfortably in the 25% off range. You'll find the largest markdowns on socks, accessories, and older styles of tees and pants. Sign up for a free UA membership for free shipping on all orders.\n\nThe best Black Friday deals: Fitness and outdoors\n\nFitness equipment\n\nAmazon Basics 36in High-Density Round Foam Roller: $20 $14 at Amazon\n\n30% off: Amazon's best-selling foam roller is at one of the lowest prices we've seen for Black Friday. You can pick up a 36-inch roller in black for the same price as the 18-inch size. Foam rollers are great for increasing balance and maintaining flexibility – at this low price, it's worth picking one up to keep yourself nice and limber.\n\nHydro Flask Water Bottle with Straw Lid: $49.95 $37.46 at Amazon\n\n25% off: Keep yourself well-hydrated with this stainless steel Hydro Flask water bottle. It's $12 off and the lowest we've tracked. It's available in six colors at this discounted price and comes with a wide-mouth straw lid.\n\nSuperFit 2.25HP 2 in 1 Dual Display Folding Treadmill: $729.99 $299.99 at Walmart\n\nSave $430 - Now this is a saving if we ever saw one. This foldable treadmill has movable arms, so you can hold on in front and sprint for your life, or flatten them down to walk along without support. Reviews report that it's quite compact, but the 4.3/5 rating attests to its quality - and at less than $300, you'd be hard-pushed to find a better jogging machine for the money.\n\nProForm - 750R Rowing Machine: $1,099.99 $599.99 at Best Buy\n\nSave $500 - If you're looking for a rowing machine this Black Friday, you can't go wrong with this incredible $500 discount from Best Buy on the ProForm 750R. This iFIT-enabled machine allows you to digitally adjust your resistance to simulate the feeling of rowing in different waters. If you don't have an iFIT subscription, the ProForm 750R still comes with 20 pre-programmed workouts to choose from, as well as a five-inch high contrast display, ergonomic molded seat, and an integrated tablet holder.\n\nNordicTrack RW500 Rower: $999.99 $799.99 at Best Buy\n\nSave $200 - If you're serious about rowing, the NordicTrack RW500 boasts some of the latest and greatest tech in the game. It comes equipped with an adjustable console that allows you to track your stats (including strokes, time, watts and estimated calories burned) and also sports an inertia-enhanced flywheel, which supposedly delivers more natural and fluid motion. You can fold this one up, too, and roll it away using its handy, built-in transport wheels - perfect for convenient home storage.\n\nSchwinn Crewmaster Rower: $799.99 $499.99 at Best Buy\n\nSave $300 - Best Buy is offering a whopping $300 off the Schwinn Crewmaster Rower right now. For $799.99, you're getting a great all-rounder, one which sports a smooth rail mechanism, large pedals and an LCD screen allowing you to track time, distance and pulse during your workout. This is a great deal on an otherwise expensive bit of fitness kit.\n\nBowflex SelectTech 552 Adjustable Dumbbells: $399 $299 at Amazon\n\nSave $100: Just in time for Black Friday, you can pick up this Bowflex adjustable dumbbells set for $100 off its regular price. This is an excellent way to achieve a full-body workout right at home, especially since it includes a one-year JRNY membership (valued at $149) for a wide variety of on-demand workouts.\n\nSports and outdoors\n\nBounce Pro 7-Foot My First Trampoline With Flash Light Zone: $149.99 $119.99 at Walmart\n\nSave $30 - It's a modest saving, but a welcome one. This trampoline is suitable for kids aged 3-10, and with its high, see-through wallas your kids will be safe, and you can still keep an eye on them. The Flashlight Zone is a neat addition, which flashes and changes color on every jump.\n\nHover-1 H1 Electric Self-Balancing Scooter 9 mph max speed - Iridescent: $269.99 $199.99 at Best Buy\n\nSave $70 - Hover-1 is one of the biggest hoverboard manufacturers and this is one of its best models, with a top speed of 9mph and a nine-mile range. With a $70 discount on Best Buy, this is a fantastic Black Friday deal.\n\nSegway Ninebot E45 Electric Scooter: $839.99 $699.99 at Amazon\n\nSave $140: While the best-selling Ninebot E45 hit a record low of $589 last Prime Day, a $150 saving is still quite impressive, given that it seldom dips below $800 otherwise. Cruise to work or events in style with this Segway electric scooter.It features front and rear brakes, a max speed of 18.6mph, and up to 28 miles of travel per charge.\n\nThe best Black Friday deals: Furniture\n\nWayfair Black Friday Furniture Sale: thousands of items up to 80% off\n\nWhether you're eyeing a new sectional for the living room or want to refresh your patio furniture in the off-season, Wayfair's massive Black Friday furniture sale has you covered with markdowns on hundreds of thousands of indoor and outdoor pieces. And if you're keen on doing some redecorating before company comes calling for the holidays, rest easy knowing that many items qualify for free 2-day shipping.\n\nOverstock Black Friday Furniture Sale: extra 20% to 25% off\n\nCheck out the Overstock Black Friday Sale for up to an extra 25% off already-reduced home furniture. Among the deals, you'll find are beds for $300 or less, accent chairs for under $150, and end tables for just $30. And to make these discounts even sweeter: all items qualify for free shipping sitewide.\n\nAmazon Black Friday Furniture Sale: up to 30% off select items\n\nNow is the perfect time to make your living room, bedroom, or home office as comfortable and cozy as you want – Amazon is knocking up to 30% off select beds, desks, chairs, and sofas just in time for Black Friday. Shop discounted pieces from Nathan James, Dorel, Christopher Knight, Max & Lily, and more.\n\nMacy's Black Friday Event: 20% to 60% off thousands of items\n\nThrough November 29, Macy's is slashing prices by as much as 60% on furniture, rugs, and mattresses. Notable discounts include bedroom sets from $950, sofas starting at $139, desks for as little as $59, and dining sets as low as $189. With over 40,000 items on sale, we reckon you won't have a difficult time finding something you fancy.\n\nWalmart Black Friday Furniture Deals: prices from $17\n\nThere's no need to break the bank when it comes to furniture shopping at Walmart. The retailer consistently has low prices on all types of pieces, and now its Black Friday sale is dropping them even further. Find end tables from $17, TV stands from $59, and office chairs from $30.\n\nTarget Black Friday Furniture Sale: up to 25% off\n\nTarget's Black Friday furniture specials are exclusive to its online storefront so you can shop and save from the comfort of your own home. Featured sales include accent chairs from $250, sofas starting at $500, and media stands for as low as $150.\n\nThe best Black Friday deals: Beauty and health\n\nHair care and grooming\n\nGHD Classic Styler: $249 $199.20 + free gift at GHD\n\nSave $50 - There's a sweet 20% discount on GHD's original styler for Black Friday over at GHD. Our sister site Woman & Home rates it as one of the best hair straighteners of all time, and we agree - one of our team has had hers for 15 years and they're still going strong. The latest versions heat up in 30 seconds, glide through your hair, and switch off automatically after 30mins (if you accidentally leave them on). There are higher spec straighteners out there, but these iconic irons perform extremely well and are built to last. This is the cheapest you'll find them.\n\nDyson Airwrap Complete Styler (refurbished): $549.99 $449.97 at Nordstrom Rack\n\nSave $100 - Black Friday discounts on the highly coveted Dyson Airwrap are extremely rare, and we typically only see bundled deals. If you don't mind a refurbished product, Nordstrom Rack has the Airwrap Styler on sale for $449.97 - the best deal we've seen so far.\n\nRevlon One-Step Hair Dryer And Volumizer Hot Air Brush: $59.99 $34.88 at Amazon\n\nSave $25.11 - Join the viral crazy of the top-rated Revlon hair dryer brush that's on sale for $34.88 in this Black Friday deal at Amazon. The one-step hair dryer will make you feel like you just stepped out of a salon with shiny and voluminous hair. Today's offer is the best deal you can find right now and just $12 more than the record-low price.\n\nShark HyperAir IQ hairdryer: $229.99 $199.99 at Amazon\n\nSave $30 - There’s a 13% saving on the first hairdryer from the brand, which is better known for its vacuum cleaners. It’s simple to use, with three air speed and three temperature settings to choose from. The hairdryer also includes a concentrator nozzle for creating sleek, smooth tresses, and a styling brush that can be used for more voluminous locks. As we’ve already mentioned this is a record-low price for this hairdryer, which is only a few months old.\n\nMake up and skincare\n\nBeauty products: Up to 51% off Revlon, Pantene and more at Amazon\n\nFrom $3.74 - Lots of trending beauty products have discounts on Amazon today - like the REVLON x Megan Thee Stallion Big Bad Face eyeshadow palette, which has dropped from $18.40 to $13.35. You'll also find discounts on a wide range of household favourites including Pantene's Shampoo and Sulfate-free Conditioner kit, popular items from Herbal Essences, Head and Shoulders, Rimmel, Clairol and more.\n\nGlamGlow Supermud Charcoal Instant Treatment Mask: $60 $42 at Sephora\n\nSave $18 - There's a 30% discount on this super-popular face mask at Sephora. It's rated 4 out of 5 stars from over 6,000 user reviews, and uses exfoliating acids and activated charcoal to help clear pores and improve the complexion of normal, combination, and acne-prone skin. You can get it in a range of different sizes - this one is 1.7oz/50g, and it comes with free shipping too.\n\nDental care\n\nWaterpik CC-01 electric toothbrush and water flosser: $129.99 $99 at Amazon\n\nSave $30 - Waterpik's electric toothbrush and flosser combo claims to be 99.9% effective at keeping plaque build up at bay and has three powerful sonic modes - massage, clean and whitening - to help keep your mouth fresh. It's down from $129.99 to $99 in today's sales. We did see it around $10 cheaper in the summer, but this is the lowest price in months.\n\nPhilips One By Sonicare battery toothbrush: $24.95 $14.95 at Walmart\n\nSave $10: This stylish electric travel toothbrush is $10 off as part of Walmart's Black Friday Sale. Small enough to fit inside a purse or doppler bag, it includes a travel case and one AAA battery. Plus, it comes in four fun colors.\n\nPhilips Sonicare Electric Toothbursh for Kids 3 Years+: $49.99 $29.95 at Amazon\n\nSave $20 - Sneak this one into their Christmas stocking this year and kid's can enjoy an interactive brushing experience with a free educational app. Now with a 40% discount, this one comes parent-approved.\n\nOral-B Pro 1000 CrossAction Electric Toothbrush: $49.94 $29.97 at Amazon\n\nSave $9.97 - Oral B dominates our top electric toothbrush rankings. This model averages 4.7/5 stars from over 44,000 user reviews on Amazon, and there's a huge 40% discount with this Black Friday deal at Amazon - that's just 34c more than the lowest price we've seen. Unlike more advanced (and expensive) options, there's only one cleaning mode, but it comes with the only feature you actually need: a pressure sensor to tell you if you're pressing too hard. There's also an in-built timer to help you brush for the recommended two-minutes.\n\nSee more of the best Black Friday Dyson Airwrap deals\n\nThe best Black Friday deals: Baby products\n\nMonitors\n\nEufy Video Baby Monitor: $159.99 $129.99 at Amazon\n\nSave $30 - Amazon's Black Friday deals event has the Eufy baby monitor on sale for a record-low price of $129.99. The Eufy baby monitor has over 4,000 positive reviews and features two-way audio and will send you instant alerts when your baby is crying\n\nKasa Indoor Pan/Tilt Smart Home Camera: $39.99 $29.99 at Amazon\n\nSave $10 - Black Friday and Cyber Monday are the best times to invest in smart home devices big and small. With this Kasa Indoor Pan/Tilt camera at 25% off this Black Friday – the cheapest we've seen it all year – it might be time to invest in an indoor smart camera that works seamlessly with Alexa and your Echo devices. At $30, there's a lot of features to love here, including real-time motion and sound detection, a 113-degree tilt and 360-degree pan, and smart home integration that lets it perform Smart Actions like triggering the alarm or the spotlight when it detects motion during your chosen times in the day.\n\nMore baby product deals\n\nNon-Contact Thermometer for Adults and Kids: $29.99 $15.99 (or less) at Amazon\n\nSave up to $17 - These days, a no-contact thermometer is a necessity, especially when you've got kids and seniors in your household. Luckily, Disen's highly-rated smart thermometer gun is not only cheaper than it's ever been but also comes with an extra $3.20 saving for Prime members. That's a lot of savings on something that's potentially life-saving. It can detect temperature from up to 3 cm (1.18 inches) accurately and store up to 35 readings, which comes in handy when you're taking care of a sick child.\n\nEcho Glow: $29.99 $16.99 at Amazon\n\nSave $13 - Amazon's brilliant kid-friendly smart lamp, the Echo Glow, is cheaper than it's ever been, dropping its price by almost 45%, which makes it among the best bargains parents can score this Black Friday. And, this isn't any ordinary lamp either. It's capable of displaying so many colors, offers a Rainbow Timer to help the kids stay on track, and is unintrusive with its sleek and small design. Best of all, it works with Alexa and therefore, voice control.\n\nRuvalino Diaper Bag Backpack: $43.99 $31.78 at Amazon\n\nSave $12 - This diaper bag from Ruvalino comes with multiple compartments and pockets to keep all the baby stuff – nappies, milk bottles, extra clothing, teethers – organized. Because parents' lives are chaotic enough, having this backpack on hand for day trips and running errands is definitely a weight off. Especially with this Black Friday deal that slashes a combined $14 off the navy blue color when you clip the on-page 20% off coupon – although the other shades are discounted as well.\n\nGraco DuoGlider Double Stroller in Glacier: $169.99 $125.98 at Walmart\n\nSave $44 - Every parent knows that having one child is expensive enough, let alone two, which makes this two-passenger stroller a massive money saver. More than $40 off for Black Friday, you're not only getting a big discount, you're also saving a lot by not buying two strollers – so now you've got more money to spend on nappies and snacks. The Graco DuoGlider Double Stroller boasts stadium-style seating so the rear passenger could have a better view, as well as reclining capabilities, rotating canopies, and footrests for comfort.\n\nThe best Black Friday deals: smartwatches\n\nApple Watches\n\nApple Watch 7 (41mm, GPS): $399.99 $379.99 at Amazon\n\nSave $19 - Today's best Apple Watch deal is the all-new Apple Watch 7 that's on sale for $379.99. That's a $19 discount and a new record-low price for the 41mm smartwatch. This discount applies to the Green, Red, and Blue sport bands, which are the only colors that are currently in stock. This is the cheapest deal we've seen for the Series 7 smartwatch, so we'd grab this fantastic Black Friday deal now before it's too late.\n\nApple Watch 5 GPS and Cellular, 44mm: $749 $459 at Amazon\n\nSave $290 - Amazon has the Apple Watch Series 5 with Celluar on sale for just $459 - just $10 more than the record-low price. The 44mm smartwatch includes LTE connectivity, which allows you to get internet and phone connectivity on your watch even when your iPhone is far away.\n\nApple Watch Series 6 (40mm, GPS): $399 $349 at Amazon\n\nSave $50 - The Apple Watch 6 is always a Black Friday best-seller, and Amazon has the smartwatch on sale for $349. while this isn't the lowest price we've seen, it's the best deal you can find right now, as discounts on the Series 6 have been rare as of late. Please note, this deal applies to the Red sports band model and is the only color currently in stock.\n\nApple Watch Series 3, 38mm: $199 $169 at Best Buy\n\nSave $30 - We have seen the Series 3 as low as $109 this Black Friday, but the stock was supremely limited and this is still a solid deal for the Apple Watch 3. This one's an older device but it's still a great smartwatch and worthy of the 4.5 out of 5 stars we gave it in our review. It's slower and less feature-rich than the SE, plus it's likely to lose watchOS support in the next few years. If you want a truly cheap Apple Watch, it's the best.\n\nActivity trackers\n\nFitbit Inspire 2: $99.95 $59.95 at Amazon\n\nSave $40 - The sleek Fitbit Inspire 2 is the more affordable device in Fitbit's current lineup, and with this Black Friday deal at Amazon it's even better value. The offer applies to the Lunar White, Black, and Desert Rose colorways, and is one of the best offers we've seen on the Inspire 2 to date. If you're on a tight budget, it's one to check out.\n\nFitbit Luxe: $149.95 $99.95 at Amazon\n\nSave $50 - Black Friday Fitbit deals are always popular and Amazon has the Fitbit Lux on sale for a record-low price of $99.95. The Fitbit Luxe is one of the best fitness trackers you can buy, thanks to the ultra-slim design and features such as sleep tracking, stress management, and 24/7 heart rate monitoring.\n\nFitbit Versa 2 Smartwatch: $199.95 $118.99 at Walmart\n\nSave $81 - Walmart's Black Friday Deals for Days sale has the feature-packed Fitbit Versa 2 smartwatch on sale for a record-low price of $118.99. The smartwatch provides a remarkable six-day battery life and allows you to store 300 or so songs on your wrist.\n\nFitbit Charge 5: $179.95 $129.95 at Amazon\n\nSave $50 - The latest Fitbit Charge has finally dropped in price, now offering fitness-minded folks a 28% discount, which is a lot considering how affordable this fitness tracker already is. Alongside its stress management tools, sleep tracking capabilities, and a 24/7 heart rate monitor, it also comes with built-in GPS so that you won't have to take your phone when you're on a run or quick hike.\n\nFitbit Versa 3: $229.95 $179.95 at Fitbit\n\nSave $50 - The Fitbit Versa 3 is one of the latest and most high-tech Fitbit wearables, so a $50 saving is notable. Beyond the core fitness tracking features the Versa 3 also boasts blood oxygen readings and a great screen, all packaged in a lightweight and comfortable shell.\n\nFitbit Sense Advanced Smartwatch: $299.95 $199.95 at Amazon\n\nSave $100 - You can pick up a Fitbit Sense Advanced at a $100 discount with this Black Friday deal. The Fitbit Smartwatch packs an ECG app, built-in GPS and tracks on-wrist skin temperature. This is the best deal you can find right now and much cheaper than the previous lowest price.\n\nThe best Black Friday deals: smartphones and plans\n\niPhones\n\nApple iPhone 13: save up to $800 with a trade-in, plus $800 with a switch at Verizon\n\nThere's not one, but two fantastic deals currently available at Verizon on the iPhone 13. First up, both new and existing customers can get up to $800 with a trade-in on an eligible unlimited data plan. Switching over from another carrier? You'll get an additional gift card worth up to $800 as a welcome bonus too.\n\nApple iPhone 12: $20 $15/mo with an unlimited plan at AT&T\n\nAT&T's got a great saving on the iPhone 12 this week which you don't even need to trade-in to access. Simply pick up a device with a new line on an unlimited data plan and the carrier will cut your monthly device installment down by a whole $5 per month. That's a price cut of $180 over a 36-month plan duration - a nice little price cut that's good if you don't happen to have a decent phone to trade. Note, savings are also available on the 12 Mini.\n\nApple iPhone 12 mini: free with a new unlimited line (no trade needed) at Verizon\n\nLooking for a free 5G capable flagship? Check out the iPhone 12 mini at Verizon. Right now this great little flagship is going for free with a new unlimited plan with no trade-ins needed. That makes this one not only a super accessible option, but also the first time this carrier has ever offered a 5G capable iPhone for free with a plan.\n\nApple iPhone 12: $20 $15/mo with an unlimited plan at AT&T\n\nAT&T's got a great saving on the iPhone 12 this week which you don't even need to trade-in to access. Simply pick up a device with a new line on an unlimited data plan and the carrier will cut your monthly device installment down by a whole $5 per month. That's a price cut of $180 over a 36-month plan duration - a nice little price cut that's good if you don't happen to have a decent phone to trade. Note, savings are also available on the 12 Mini.\n\nApple iPhone 11: $499 free with eligible trade-in at Apple\n\nApple directly has one of the best trade-in schemes for the iPhone 11 right now, offering a free device with eligible trade-ins. Of course, as the device is pretty affordable now, even cheaper smartphone trade-ins will save you a considerable amount on this device right now.\n\nAndroid phones\n\nSamsung Galaxy S21 Ultra: save up to $1,000 with a trade-in, plus $800 with switch at Verizon\n\nVerizon has the standout carrier Galaxy S21 Ultra deals this week with a fre", "images": ["https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg", "https://cdn.mos.cms.futurecdn.net/6WijC2bNkTKYrXaVfXRhK6-320-80.jpg", "https://www.techradar.com/media/img/missing-image.svg", "https://search-api.fie.futurecdn.net/img/misc/no-image-available.svg", "https://cdn.mos.cms.futurecdn.net/6WijC2bNkTKYrXaVfXRhK6-1200-80.jpg"], "top_img": "https://cdn.mos.cms.futurecdn.net/6WijC2bNkTKYrXaVfXRhK6-1200-80.jpg", "keywords": [], "authors": ["Mackenzie Frazier"], "canonical_link": "https://www.techradar.com/black-friday/black-friday-deals-sales", "title": "Black Friday 2022: date, tips, and deals we expect to see", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "pub_date": "2021-11-27T01:40:31+00:00", "description": "Your guide to the Black Friday 2022 deals event with everything you need to know such as the date, tips, and sales we can expect.", "robots": "max-image-preview:large", "msapplication-TileColor": "#000000", "msapplication-TileImage": "https://vanilla.futurecdn.net/techradar/429786/apple-touch-icon.png", "og": {"site_name": "TechRadar", "image": {"identifier": "https://cdn.mos.cms.futurecdn.net/6WijC2bNkTKYrXaVfXRhK6-1200-80.jpg", "width": 1200}, "type": "article", "title": "Black Friday 2022: date, tips, and deals we expect to see", "url": "https://www.techradar.com/black-friday/black-friday-deals-sales", "description": "Your guide to the Black Friday 2022 deals event"}, "article": {"publisher": "https://www.facebook.com/TechRadar", "published_time": "2021-11-27T01:40:31Z", "modified_time": "2022-01-13T18:00:01.145Z"}, "parsely-type": "post", "parsely-post-id": "A6Z7AwX8Mv95rqJVoZah9o", "parsely-pub-date": "2021-11-27T01:40:31Z", "parsely-title": "Black Friday 2022: date, tips, and deals we expect to see", "parsely-link": "https://www.techradar.com/black-friday/black-friday-deals-sales", "parsely-image-url": "https://cdn.mos.cms.futurecdn.net/6WijC2bNkTKYrXaVfXRhK6.jpg", "parsely-section": "Black Friday", "parsely-tags": "Category: Black Friday,Category: Other,Category: Black-friday,deals,techdeals,Black Friday,Black Friday sales,black friday deals,holiday,black friday 2020,type_deal,_van_ads_none,van-disable-inbody-ads,deals,channel_other,blackfridayhub,van-block-taboola,exclude-from-homepage,van_sticky_side_nav,no-recommended,contentdev,van-black-friday-breadcrumbs,hotjar-enabled,serversidehawk", "parsely-author": "Mackenzie Frazier", "fb": {"app_id": 235441786508054}, "twitter": {"card": "summary_large_image", "site": "@TechRadar", "title": "Black Friday 2022: date, tips, and deals we expect to see", "description": "Your guide to the Black Friday 2022 deals event", "creator": "@TechRadar", "image": "https://cdn.mos.cms.futurecdn.net/6WijC2bNkTKYrXaVfXRhK6-1200-80.jpg", "account_id": 15560223}, "google-site-verification": "jEzBNX-r47v-rgc86g7xG47qMqF4VJuXdLUueTx8saU", "p": {"domain_verify": "10329f1fd4d0a2cd5c0d3b3b809cb4cd"}, "OMG-Verify-V1": "1036697-2d2c9025-5430-4e79-8349-e8c1c926dd73", "taboola": {"url": "https://www.techradar.com/black-friday/black-friday-deals-sales"}, "botify-site-verification": "xkNFqB6l1qBl8BEqMjQvrHuYinhxlJVe", "msvalidate.01": "CC462E6DF91492086145CA5EBDCB615E", "theme-color": "#2f6e91", "lomadee-verification": 22816996}, "movies": [], "publish_date": 1637977231.0, "source": "https://www.techradar.com", "summary": ""}