{"url": "http://www.nbcuniversal.com/press-release/e-news%E2%80%99-snapchat-show-%E2%80%9Cface-forward%E2%80%9D-returns-second-season-saturday-march-24", "text": "UNIVERSAL CITY, Calif. – Mar. 14, 2022 – NBCU LAUNCH, the umbrella brand that houses the comprehensive diversity, equity and inclusion efforts across NBCU’s television portfolio, has forged a new partnership with Telemundo to increase the number of Hispanic female directors in scripted television. This partnership is an extension of the Hispanic network’s award-winning corporate initiative Mujeres Imparables (Unstoppable Women).\n\nAccording to the latest DGA Episodic TV Director Inclusion Report, only 2.4% of scripted series episodes were helmed by Latina directors out of more than 4,300 episodes produced in the 2019-20 season. This new partnership with Telemundo aims to address the need for more directing opportunities for this severely underrepresented community.\n\nAs a major step in achieving this goal, NBCU LAUNCH is introducing a Telemundo track to its landmark Female Forward initiative, which has successfully provided experienced female directors an opportunity to break into episodic television over the last four years. Along with the NBCU LAUNCH TV Directors Program (formerly known as the Emerging Director Program), they are the entertainment industry’s first scripted directing programs that guarantee at least one in-season directing credit for its participants.\n\nStarting with the upcoming 2022-23 class and thereafter, two Female Forward applicants who select the Telemundo track of the program will shadow on at least two episodes of a Telemundo scripted series, culminating in an in-season directing assignment on the same series. This expansion of Female Forward coincides with Telemundo’s Mujeres Imparables (Unstoppable Women) initiative which seeks to advance Latinas by sharing their diverse success stories, highlighting their contributions to all sectors of society and fostering solutions for the challenges that remain for their progress.\n\n“Our new partnership with Telemundo is emblematic of one of our core goals, which is to combine inclusion efforts with our sister networks and studios so that together we can create comprehensive and meaningful change,” said Jeanne Mau, Senior Vice President, TV Programming Diversity, Equity & Inclusion at NBCUniversal. “Our shared objectives with Telemundo give us a unique opportunity to place an even greater focus on Hispanic female directors. This evolution of our groundbreaking Female Forward initiative is just the beginning of our efforts to grow this underrepresented community while we also continue to focus on other marginalized groups who still desperately need opportunities in the director’s chair.”\n\n“The numbers don’t lie – Latinas are underrepresented across our industry, and especially in the director’s chair,” said Mónica Gil, EVP, Chief Administrative & Marketing Officer, NBCUniversal Telemundo Enterprises. “We’re thrilled to be working hand in hand with our colleagues at NBCUniversal to support a shared commitment to our Latina community. We can’t wait to meet the directors and bring even more visionary and unstoppable women to the network.”\n\nSubmissions for the new classes of Female Forward and the NBCU LAUNCH TV Directors Program opened today on the NBCU LAUNCH site and will close on April 3.\n\nThe goal of the combined NBCU Launch TV Directors Program and FEMALE FORWARD is to systemically increase the number of experienced directors of underrepresented backgrounds in episodic television. Female Forward is focused on female directors while the NBCU LAUNCH TV Directors Program is intended for ethnically diverse male and nonbinary directors. Participants shadow on up to two episodes of an NBCU scripted series before directing an in-season episode of the same series.\n\nRecent program alumni include Heather Jack, SJ Main Muñoz, Katie Locke O’Brien, Monica Raymund, Lisa Robinson, Mahesh Pailoor and Dinh Thai who are all now working directors in scripted television.\n\nAmong the eligibility requirements, all candidates should have directing experience in their respective fields, including, but not limited to, feature films, short films, music videos, commercials, digital content and unscripted programming. An applicant can have no more than one scripted television directing credit. To be eligible for Female Forward’s Telemundo track, applicants should be fluent or have a full professional proficiency in Spanish.\n\nMore information on both programs including submission requirements can be found on the NBCU LAUNCH site.\n\nABOUT NBCU LAUNCH\n\nNBCU LAUNCH houses the comprehensive diversity, equity and inclusion efforts across the entertainment networks in the NBCU Television and Streaming portfolio – NBC, Bravo, E!, Oxygen, SYFY, Universal Kids, USA and Peacock – as well as Universal Studio Group – which comprises four powerhouse studios, Universal Television, Universal Content Productions (UCP), Universal International Studios and Universal Television Alternative Studio. NBCU LAUNCH supports the company’s goal to produce authentic and compelling content by developing the next generation of diverse content creators through talent development programs, partnering with internal creative executives and producers to hire diverse talent in meaningful positions in front of and behind the camera across the company’s extensive breadth of programming, and strengthening the company’s meaningful partnerships with key advocacy groups and organizations. For more information, visit NBCUniversalLaunch.com and follow handles on Instagram and Twitter.", "images": ["http://www.nbcuniversal.com/img/Icon_Rotate.png", "http://www.nbcuniversal.com/themes/custom/universal/src/img/icons/icon_menu.png", "http://www.nbcuniversal.com/themes/custom/universal/images/ajax-preloader.gif", "http://www.nbcuniversal.com/img/icons/icon_gray_menu_arrow.svg", "http://www.nbcuniversal.com/_flysystem/s3-flysystem/NBCUNI_favicon_1.jpg", "http://www.nbcuniversal.com/themes/custom/universal/src/img/icons/icon_close.png", "http://www.nbcuniversal.com/img/icons/icon_gray_hamburger.svg", "http://www.nbcuniversal.com/_flysystem/s3-flysystem/nav_logo.png", "http://www.nbcuniversal.com/themes/custom/universal/src/img/icons/dropdown-arrow-down.svg"], "top_img": "http://www.nbcuniversal.com/_flysystem/s3-flysystem/NBCUNI_favicon_1.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.nbcuniversal.com/newsroom", "title": "NBCUNIVERSAL MEDIA", "meta_data": {"keywords": "NBCUniversal, Homepage, Featured Section, Careers, Our History, History of the year, Newsroom, Brands, Our Values, About Us", "abstract": "We are one of the world’s leading media and entertainment companies in the development, production, and marketing of entertainment, news and information to a global audience.NBCUniversal is a subsidiary of Comcast Corporation.", "Generator": "Drupal 9 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": null, "source": "http://www.nbcuniversal.com", "summary": ""}