{"url": "http://www.youtube.com/user/dscclive#p/f/7/1kfaEJYg8uA", "text": "firma Google\n\ndostarczania i utrzymywania usług, na przykład do śledzenia przerw w ich działaniu lub do ochrony użytkowników przed spamem, oszustwami i nadużyciami;\n\npomiaru zaangażowania odbiorców i generowania statystyk na temat witryn w celu lepszego zrozumienia, jak są używane usługi Google.\n\npoprawiania jakości obecnych usług i opracowywania nowych;\n\nwyświetlania reklam i mierzenia ich skuteczności;\n\nwyświetlania spersonalizowanych treści (w zależności od Twoich ustawień);\n\nwyświetlania spersonalizowanych lub niespersonalizowanych reklam (w zależności od Twoich ustawień) w usługach Google i w innych miejscach w internecie.\n\nGoogle wykorzystuje pliki cookie i inne dane do:Jeśli się na to zgodzisz, pliki cookie i inne dane będziemy wykorzystywać także do:Reklamy i treści niespersonalizowane mogą być dobierane na podstawie czynników takich jak aktualnie przeglądane treści czy Twoja lokalizacja (wyświetlanie reklam jest oparte na przybliżonej lokalizacji). Reklamy i treści spersonalizowane również są dobierane według tych czynników oraz dodatkowo na podstawie Twojej aktywności, na przykład haseł wyszukiwanych w Google czy filmów oglądanych w YouTube. Reklamy i treści spersonalizowane to między innymi trafniejsze wyniki i rekomendacje, indywidualna strona główna w YouTube oraz reklamy dopasowane do Twoich zainteresowań.\n\nJeśli chcesz przejrzeć dostępne możliwości, w tym opcje rezygnacji z plików cookie używanych do personalizacji lub informacje o opcjach na poziomie przeglądarki pozwalających zrezygnować z niektórych lub wszystkich plików cookie używanych w innych celach, kliknij „Dostosuj”. W każdej chwili możesz też wejść na stronę g.co/privacytools.", "images": ["http://www.google.com/favicon.ico", "http://www.gstatic.com/ac/cb/cb_yt_logo_d_header_118x26_4dfe7c3d17767ffd2294ae90fb54337e.png", "https://www.gstatic.com/ac/cb/scene_cookie_wall_youtube.svg"], "top_img": "http://www.google.com/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Zanim przejdziesz do YouTube", "meta_data": {"viewport": "initial-scale=1, maximum-scale=5, width=device-width"}, "movies": [], "publish_date": null, "source": "http://www.youtube.com", "summary": ""}