{"url": "http://www.nfib-sbet.org/", "text": "SMALL BUSINESS ECONOMIC TRENDS\n\nThe NFIB Small Business Optimism Index increased slightly in December to 98.9, up 0.5 points from November. Twenty-two percent of small business owners reported that inflation was their single most important problem encountered in operating their business. Price raising activities has reached levels not seen since the early 1980’s when prices were rising at double digit rates.\n\n“Small businesses unfortunately saw a disappointing December jobs report, with staffing issues continuing to impact their ability to be fully productive,” said NFIB Chief Economist Bill Dunkelberg. “Inflation is at the highest level since the 1980’s and is having an overwhelming impact on owners’ ability to manage their businesses.”\n\nKey findings include:\n\nTwenty-two percent report inflation as the single most important problem operating their business, a 20-point increase from the beginning of 2021 and the highest level since Q4 1981.\n\nOwners expecting better business conditions over the next six months increased three points to a net negative 35%. Owners remain pessimistic about future economic conditions as this indicator has declined 23 points over the past six months.\n\nForty-nine percent of owners reported job openings that could not be filled, an increase of one point from November.\n\nAccording to NFIB’s monthly jobs report, a net 48% (seasonally adjusted) of owners reported raising compensation, up four points from November and a 48-year record high reading. A net 32% plan to raise compensation in the next three months. Thirteen percent cited labor costs as their top business problem, up three points and a 48-year record high reading and 25% said that labor quality was their top business problem.\n\nFifty-seven percent of owners reported capital outlays in that last six months, up two points from November. Of those making expenditures, 41% reported spending on new equipment, 25% acquired new vehicles, and 19% improved or expanded facilities. Six percent of owners acquired new buildings or land for expansion and 13% spent money for new fixtures and furniture. Twenty-nine percent plan capital outlays in the next few months, up two points from November and two points higher than the 48-year average.\n\nA net 1% of all owners (seasonally adjusted) reported higher nominal sales in the past three months. The net percent of owners expecting higher real sales volumes increased by one point to a net 3%.\n\nThe net percent of owners reporting inventory change increased four points to a net 7%. Thirty-six percent of owners report that supply chain disruptions have had a significant impact on their business. Another 30% report a moderate impact and 21% report a mild impact. Only 11% report no impact from recent supply chain disruptions.\n\nA net 9% of owners viewed current inventory stocks as “too low” in December, down six points from November. A net 8% of owners plan inventory investment in the coming months, down two points from November but five points above the 48-year historical average.\n\nThe net percent of owners raising average selling prices decreased two points to a net 57% (seasonally adjusted). Unadjusted, 5% of owners reported lower average selling prices and 58% reported higher average prices. Price hikes were the most frequent in wholesale (85% higher, 0% lower), construction (74% higher, 5% lower), and retail (70% higher, 7% lower). Seasonally adjusted, a net 49% plan price hikes (down five points).\n\nThe frequency of reports of positive profit trends increased three points to a net negative 14%. Among the owners reporting lower profits, 29% blamed the rise in the cost of materials, 22% blamed weaker sales, 17% cited labor costs, 10% cited the usual seasonal change, 8% cited lower prices, and 4% cited higher taxes or regulatory costs. For owners reporting higher profits, 63% credited sales volumes, 11% cited usual seasonal change, and 15% cited higher prices.\n\nTwo percent of owners reported that all their borrowing needs were not satisfied. Twenty-six percent reported all credit needs met and 62% said they were not interested in a loan. A net 4% reported that their last loan was harder to get than in previous attempts. Zero percent reported that financing was their top business problem. A net 4% of owners reported paying a higher rate on their most recent loan.", "images": ["http://www.nfib-sbet.org/wp-content/themes/nfib/img/spinner-page.gif", "http://www.nfib-sbet.org/wp-content/themes/nfib/img/homespinner.gif"], "top_img": "http://www.nfib-sbet.org/wp-content/themes/nfib/img/spinner-page.gif", "keywords": [], "authors": [], "canonical_link": "", "title": "NFIB", "meta_data": {"viewport": "width=1024"}, "movies": [], "publish_date": null, "source": "http://www.nfib-sbet.org", "summary": ""}