{"url": "www.latimes.com/politics/essential/la-pol-ca-essential-politics-updates-caitlyn-jenner-may-run-for-u-s-senate-1500243172-htmlstory.html", "text": "Kamala Harris works to forge relationship with Central Valley\n\nSen @kamalaharris talking grapes with Fowler Packing Co president Dennis Parnagian in the fields outside metro Fresno pic.twitter.com/smVuRfbSpQ — Cathleen Decker (@cathleendecker) July 5, 2017\n\nThe drought may be over in the minds of urban Californians, quite literally washed away by huge accumulations of rain last year that filled reservoirs and left the state’s mountains covered with snow even now.\n\nBut the farmers and others in the Central Valley, veterans of multiple drought-and-flood cycles, know the reprieve is only temporary. On Wednesday they pressed new U.S. Sen. Kamala Harris to work to ensure a more reliable source of water for the nation’s most bountiful farming region.\n\n“This area is drying on the vine,” Ryan Jacobsen, executive director of the Fresno County Farm Bureau, told Harris during a roundtable with Central Valley officials.\n\nA long-term solution can only come through federal and state action to protect the area’s water supply, he said.\n\nJason Phillips, chief executive of the Friant Water Authority, said recent rainfall had done little to stem problems caused by nearly a decade of drought.\n\nA canal that runs from Fresno to north of Bakersfield sunk in some places as much as 2 feet in two years, he said, wreaking havoc on a system that operates on the force of gravity.\n\n“We cannot get all the water to our growers,” he said.\n\nThe meeting between Harris and nearly two dozen agriculture and water officials was meant to ease what is typically a fraught relationship between the state’s Democratic leaders — all of whose power bases are in metropolitan areas — and the mostly Republican Central Valley powers that traditionally look at them with skepticism.\n\nSen. Dianne Feinstein has worked for two decades to aid the agricultural industry — at the roundtable, several nodded as Harris referred to the senior senator as an “incredible warrior” for the area.\n\nBut Harris’ predecessor, former Sen. Barbara Boxer, was allied more with environmental groups that have fought dams and other water systems. As a result, she was viewed negatively by many here.\n\nHarris was intent Wednesday on persuading the Central Valley representatives of her interest in places beyond her base in Alameda and San Francisco counties.\n\nThey, on the other hand, worked to convince her to be more in the Feinstein mold on issues important to the area — from reliable water to immigration programs to environmental protections that take into consideration the area’s needs.\n\nPresident Trump was highly popular in much of the Central Valley, apart from Fresno County, which leans Democratic because of its metropolitan shadings. But some issues important to the valley cut in politically unorthodox ways.\n\nRepublicans here are more concerned than those elsewhere with passing a plan that would give legal status to immigrants, on whom agriculture depends. With undocumented workers worried about deportation, and the border tightening to those not yet here, the labor supply has already shrunk, farmers said.\n\n“They’re out there working, being productive people,” said farmer Joe Del Bosque. “They work hard for us, and we have nowhere to reach.”\n\nDel Bosque said he recently held a training session for new workers. Of the 200 people who showed up, only a handful were born in the United States, he said.\n\nEnvironmental regulations prized by Democrats elsewhere are often frowned on by some party members here and blamed for the area’s water difficulties.\n\nSeveral of the participants lobbied Harris for her support of dams that have long been under consideration by federal and state officials, particularly the Temperance Flat Dam, which would be constructed on the San Joaquin River.\n\nHarris offered no assurances on the topic to the group on Wednesday. Afterward, speaking to reporters, she also did not take a position.\n\n“One of the things that we’re going to have to figure out ... is what is the right solution for that,” she said of a plan to construct the Temperance Flat Dam and several others. “Is it going to be about the building of dams? Is it also going to be about looking at — also looking at — other sources of renewable and sustainable reliable sources?”\n\nBoth sides signaled they did not expect an alliance on all fronts. But Harris said she would serve as an advocate for farmers during the crafting of a new farm bill and other measures before the Senate.\n\nWilliam Bourdeau, executive vice president of the politically influential Harris Farms, told the senator he wished the majority of her supporters who reside in urban areas would have a “better understanding” of the risks and challenges of farming.\n\n“We need somebody to explain the symbiotic relationship we have,” he said.\n\n“I agree with you completely,” she replied.", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg"], "top_img": "https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.latimes.com/politics/essential/la-pol-ca-essential-politics-updates-201707-htmlstory.html", "title": "California politics updates: Rams football legend Rosey Grier ends his bid for governor", "meta_data": {"og": {"title": "California politics updates: Rams football legend Rosey Grier ends his bid for governor", "url": "https://www.latimes.com/politics/essential/la-pol-ca-essential-politics-updates-201707-htmlstory.html", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "url": "https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "width": 1200, "height": 630, "type": "image/jpeg", "alt": "LA Times logo"}, "description": "This is Essential Politics, our daily look at California political and government news. Here's what we're watching right now: Former NFL player Rosey Grier has dropped out of the race for California governorAngered by his decision to block a bill on single-payer healthcare, a group of activists has…", "site_name": "Los Angeles Times", "type": "website"}, "twitter": {"card": "summary_large_image", "description": "This is Essential Politics, our daily look at California political and government news. Here's what we're watching right now: Former NFL player Rosey Grier has dropped out of the race for California governorAngered by his decision to block a bill on single-payer healthcare, a group of activists has launched an effort to recall Assembly Speaker Anthony Rendon from office.Rohrabacher faces hostile crowd during panel about Russia and Trump at Politicon in PasadenaHow 2018 could be the year of the rookie in California's pivotal congressional racesBe sure to follow us on Twitter for more, or subscribe to our free daily newsletter and the California Politics Podcast. Also don't miss our Essential Politics page in Sunday's California section.", "site": "@latimes", "title": "California politics updates: Rams football legend Rosey Grier ends his bid for governor"}, "fb": {"app_id": 134435029966155, "pages": 5863113009}, "viewport": "width=device-width,initial-scale=1", "description": "This is Essential Politics, our daily look at California political and government news. Here's what we're watching right now: Former NFL player Rosey Grier has dropped out of the race for California governorAngered by his decision to block a bill on single-payer healthcare, a group of activists has launched an effort to recall Assembly Speaker Anthony Rendon from office.Rohrabacher faces hostile crowd during panel about Russia and Trump at Politicon in PasadenaHow 2018 could be the year of the rookie in California's pivotal congressional racesBe sure to follow us on Twitter for more, or subscribe to our free daily newsletter and the California Politics Podcast. Also don't miss our Essential Politics page in Sunday's California section.", "brightspot.contentId": "0000016c-68c4-d4d6-a16e-eaef180d0000", "brightspot.cached": "false"}, "movies": [], "publish_date": null, "source": "http://www.latimes.com", "summary": ""}