{"url": "http://politifact.com/truth-o-meter/statements/2010/feb/04/paul-krugman/krugman-calls-senate-health-care-bill-similar-law-/", "text": "The recent Massachusetts Senate election captivated Americans far beyond the Bay State. In that contest, Republican Scott Brown picked up a seat formerly held by the late Democratic giant Edward Kennedy. Brown's upset victory was aided by a wave of frustration over how Congress and President Barack Obama have been handling health care reform legislation.\n\n\n\nDuring the campaign, Brown said that if he was elected, he would become the 41st Republican senator, enabling the GOP to block the Democratic majority from reaching the 60-vote threshold required to pass key legislation, including a health care bill. The Senate has already passed a version of health care, but it needs to be reconciled with a different bill passed by the House and then signed by the president before it becomes law.\n\n\n\nAs it happened, Massachusetts passed its own health care reform plan in 2006, with the help of both Republican Gov. Mitt Romney and a heavily Democratic legislature. Brown, then serving in the state Senate, voted for the plan.\n\n\n\nOn the Jan. 31, 2010, edition of ABC's This Week, host Barbara Walters asked Brown about his vote on the Massachusetts plan. \"Why isn't what's good for Massachusetts good for the whole country?\" she asked.\n\n\n\nBrown responded, \"In Massachusetts, the free market, the free enterprise has taken control, and they're offering a wide range of plans. I've never ever said that people should not get health insurance. It's just a question of if we're going to take a one-size-fits-all government plan or we're going to do something where the individual states can tailor their plans as we've done.\"\n\n\n\nWhen Walters asked him, \"Do you think the whole plan should be scrapped?\" Brown said, \"Yes.\"\n\n\n\n\"The whole plan?\" Walters continued.\n\n\n\n\"Yes,\" Brown said.\n\n\n\nLater, during the show's round-table segment, liberal New York Times columnist Paul Krugman expressed disbelief at Brown's response.\n\n\n\n\"That was the most evasive answer,\" Krugman said. \"If you think this is a straightforward guy, that was an incredibly evasive answer on health care, because the Senate bill, which has now stalled, is identical to the Massachusetts health care plan -- the same thing. Only in the finest of fine print is there any difference. He voted for the Massachusetts plan. A majority of voters in Massachusetts who voted for him approve of the Massachusetts health care plan. Nonetheless, their plan is dead.\"\n\n\n\nWe wanted to see whether the Massachusetts plan was indeed \"the same thing\" as the bill passed by the U.S. Senate. So we looked at the details of both plans and consulted with an ideologically diverse group of health policy experts.\n\n\n\nThe consensus among our experts was that Krugman is basically right on the overall structure, although some of the details differ. As Elizabeth A. McGlynn, associate director of RAND Health, put it, \"Same recipe, different amounts on the ingredients.\"\n\n\n\nHere are elements of the two plans that are broadly the same, along with some of the differences in details:\n\n\n\n• Individual mandate to buy health insurance. Everyone in Massachusetts must purchase health insurance or else pay a penalty; the same goes for the Senate plan, though the penalty structures vary between the two.\n\n\n\n• Employer responsibilities for offering health insurance. Companies with more than 10 employees in Massachusetts need to offer health insurance or else pay a penalty. The Senate bill sets the bar for companies at 50 employees, though technically the bill falls short of a mandate.\n\n\n\n• Health insurance exchanges. Both the Massachusetts and U.S. Senate plans involve the use of voluntary \"exchanges\" that individuals and small businesses can use to purchase private-sector health insurance. These exchanges are designed to offer a range of plans with different benefits and premium levels.\n\n\n\n• Affordability subsidies. Under both plans, lower-income individuals and families can receive government subsidies to help them pay their health insurance premiums. In the Massachusetts plan, subsidies are allotted on a sliding scale up to 300 percent of the federal poverty level. Under the U.S. Senate plan, the sliding-scale subsidies go up to 400 percent of the federal poverty level.\n\n\n\n• Expansion of Medicaid. The Massachusetts plan expands Medicaid to all children up to 300 percent of the federal poverty level. The U.S. Senate plan also expands Medicaid, but in a different fashion, offering it to all individuals (not just children) up to 133 percent of the federal poverty level.\n\n\n\n• Insurance market regulation. Both plans restructure the insurance market, in similar but slightly different ways. In Massachusetts, the reform bill merged the individual and small-group markets (that is, it merged the market serving individuals not covered by their employer's plan with the market serving smaller employers). The U.S. Senate bill placed new regulations on those two markets but kept them separate. In Massachusetts, dependents up to age 25 can be covered on their parents' plan, while the U.S. Senate bill allows such dependent coverage up to age 26. And young adults in Massachusetts from age 19 to 26 can purchase a special lower-cost, lower-benefit plan through the exchange; the U.S. Senate bill creates a category of lower-cost, lower-benefit plan in the exchange for those up to age 30 who cannot find affordable coverage.\n\n\n\n• Limits on the ratio between the highest and lowest premiums. In Massachusetts, the highest premiums can generally only be twice as high as the lowest premiums. The only factors that can be used to vary premiums are age, tobacco use, geographic area, the nature of the employee's industry, an unusually low participation rate (for group plans) and participation in a wellness plan. The U.S. Senate bill allows premiums in the individual and small-group market and on the exchange to vary based only on age (limited to a 3-to-1 ratio), geographic area, family composition and tobacco use (limited to 1.5 -to-1 ratio). Wellness programs do not factor into ratings variations under the Senate bill, but the bill does provide other incentives for such plans.\n\n\n\nThe bills differ more noticeably in several other areas.\n\n\n\n• Cost containment. Critics of the Massachusetts plan have taken it to task for its lack of cost-containment provisions. The U.S. Senate bill makes changes to Medicare that are intended to lower program costs, such as restructuring how payments are made to Medicare Advantage plans -- the HMO option under Medicare. Since Medicare is a federal program, the Massachusetts plan does not address this issue. The U.S. Senate bill also authorizes the Food and Drug Administration to approve generic versions of certain drugs. This, too, is a federal rather than a state responsibility.\n\n\n\n• Financing. Both the Massachusetts plan and the Senate bill are financed in part by revenue generated from the individual and employer mandates. But the Massachusetts plan's financing is heavily dependent on leveraging federal matching funds, while the Senate bill, in addition to cost savings from Medicare, imposes taxes on drugmakers, device manufacturers, health insurers and indoor tanning services. It also taxes high-cost (\"Cadillac\") health care plans. The Massachusetts plan does not do any of these things.\n\n\n\n\"The Senate probably has more cost containment,\" said John Holahan, a health expert at the Urban Institute who has studied the Massachusetts plan extensively. \"And the financing is different. But the structure is the same.\"\n\n\n\nSo it seems that there's broad agreement that, despite some operational differences, the broad structure of the Massachusetts health care plan is quite similar to that in the U.S. Senate bill -- certainly more similar than either one is to, say, a single-payer health care plan or even to the current system. Krugman's comparison of the two plans is Mostly True.", "images": ["https://static.politifact.com/CACHE/images/politifact/mugs/Screen_Shot_2018-07-05_at_4.16.09_PM/f1533287a85a3f2e38799c41e6697ac8.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/Gaspard_pic/c698516159fe200a0192798fe47f9cf0.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/SPICER/63e5edcb7dcb683b0d3e2dc0d1cda651.jpg", "https://static.politifact.com/img/meter-mostly-true-th.jpg", "https://static.politifact.com/img/meter-barely-true-th.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/shutterstock_258726044/5396b6656c42fa7674f78fadddee4f1a.jpg", "https://static.politifact.com/img/meter-pants-fire.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/millermug/3ecf01eeacabf3ef6ebc72e79d0a6317.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/Twitter/5a09f91f97a11c38d58405becf218e8c.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/shutterstock_258726044/171806b3129aa99d83c974340d58d9c0.jpg", "https://static.politifact.com/img/meter-mostly-true.jpg", "https://static.politifact.com/img/meter-true-th.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/Facebook_Logo_2019/3b3162a610bc8b3cbeaa2f750c7b6868.jpg", "http://www.facebook.com/tr?id=292850974235854&ev=PageView&noscript=1", "https://static.politifact.com/img/logo-footer.png", "https://static.politifact.com/CACHE/images/politifact/mugs/download_11/84037afba6af587ce4e963c4e3d2c303.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/millermug/b1c5b4cb8fc496f19ac3623b8724255a.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/shutterstock_566530930/8ef1f10571f92f0da1a0b9bebbad2816.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/Peskov_mug_2/3a995055b5730cb7c6797fd9198877c3.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/mitt_romney_june_2021/559a6716fb4794f6ce7c76645bebc695.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/AP_22010661643993_copy/d03f4510b19c56640f0e78f293ad2d47.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/Sotomayor_mug/7a9699009174473afe4d505344a41bc7.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/Nikki_Fried_headshot_square_new/6ec02d4d552912ea56f3a342ee2f80f3.jpg", "https://static.politifact.com/CACHE/images/politifact/rulings/meter-false/6078f198eb8fad1b553c23b0d3edc735.jpg.", "https://static.politifact.com/CACHE/images/politifact/mugs/AP_19138732015030/2cb3b2bb75f9524e6686057114a37124.jpg", "https://static.politifact.com/img/meter-false.jpg", "https://static.politifact.com/politifact/rulings/meter-false.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/2014-06-11_15_00_39-Greenshot/2ed0af830d4979e46c540664f6da1272.jpg", "https://static.politifact.com/img/meter-pants-fire-th.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/SPICER/14e725d63009d7d6cce5691dfc1a4ff8.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/Facebook_Logo_2019/7cf81e6f294db8af7f47a3cb47f42fc2.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/shutterstock_566530930/96b6b7abb296ff4667ad648bb5f1b748.jpg", "https://static.politifact.com/img/meter-half-true-th.jpg", "https://static.politifact.com/politifact/rulings/meter-mostly-true.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/krugman/cb784aa17630c9e6c575c307eebed24a.jpg", "https://static.politifact.com/img/meter-half-true.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/2014-06-11_15_00_39-Greenshot/28e160b2f2c9913deca1b74b087f04c9.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/Sotomayor_mug/83fb3accdcec628afc7c07a56dc17cd6.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/download_11/b589d0dffedf765268f1c48853f4fc25.jpg", "https://static.politifact.com/CACHE/images/politifact/rulings/meter-mostly-true/24f90cc35c51ac926348d9241eb9ee99.jpg.", "https://static.politifact.com/CACHE/images/politifact/staffers/zwPolitifactHeadshots15/ace56c74d01e7f6db1865de25199e76f.JPG", "https://static.politifact.com/CACHE/images/politifact/mugs/Nikki_Fried_headshot_square_new/c55dd3f18f0f6ed7c031cd5e41ac91e9.jpg", "https://static.politifact.com/img/meter-barely-true.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/AP_201226623741161/63c9996e0a11c5966c706f4a1d8b54ab.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/Twitter/58840a801728fb16b65bf50c585680f2.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/krugman/60ba11a30da5281fa076cd0d62fe69bf.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/Gaspard_pic/912a53dd46491ddaab925701a08cc24a.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/Peskov_mug_2/0e0fa726f09fb9d906e31ae28961acce.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/Russian_embassy_logo/2d974d3321962ee35d35cbb2f2a48977.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/mitt_romney_june_2021/0a1bcf69cc31dbbcdc5dae0d0cf2ca78.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/Russian_embassy_logo/3469f63a7653dbd06d683419bc56fb74.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/Screen_Shot_2018-07-05_at_4.16.09_PM/5a133722eadcff54f61b827cc7188120.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/AP_22010661643993_copy/a008c326407ae90fefb91d00457f79c7.jpg", "https://static.politifact.com/img/meter-true.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/AP_201226623741161/117f3f00210167a598b3d3d34bed9bf6.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/AP_19138732015030/e5a78d6c95b215c26ef2678ad9f5e9fd.jpg", "https://static.politifact.com/img/meter-false-th.jpg"], "top_img": "https://static.politifact.com/politifact/rulings/meter-mostly-true.jpg", "keywords": [], "authors": ["February"], "canonical_link": "https://www.politifact.com/factchecks/2010/feb/04/paul-krugman/krugman-calls-senate-health-care-bill-similar-law-/", "title": "Krugman calls Senate health care bill similar to law in Massachusetts", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "The recent Massachusetts Senate election captivated Americans far beyond the Bay State. In that contest, Republican Scot", "og": {"url": "https://www.politifact.com/factchecks/2010/feb/04/paul-krugman/krugman-calls-senate-health-care-bill-similar-law-/", "image": {"identifier": "https://static.politifact.com/politifact/rulings/meter-mostly-true.jpg", "secure_url": "https://static.politifact.com/politifact/rulings/meter-mostly-true.jpg", "width": 600, "height": 600}, "title": "PolitiFact - Krugman calls Senate health care bill similar to law in Massachusetts", "type": "website", "site_name": "@politifact", "description": "The recent Massachusetts Senate election captivated Americans far beyond the Bay State. In that contest, Republican Scot"}, "fb": {"pages": 61308923432, "admins": 750116788}, "twitter": {"username": "PolitiFact", "card": "summary", "site": "PolitiFact", "url": "https://www.politifact.com/factchecks/2010/feb/04/paul-krugman/krugman-calls-senate-health-care-bill-similar-law-/", "title": "PolitiFact - Krugman calls Senate health care bill similar to law in Massachusetts", "description": "The recent Massachusetts Senate election captivated Americans far beyond the Bay State. In that contest, Republican Scot", "image": "https://static.politifact.com/politifact/rulings/meter-mostly-true.jpg"}}, "movies": [], "publish_date": 1265238000.0, "source": "http://politifact.com", "summary": ""}