{"url": "https://www.visitdeepcreek.com/pages/MemberNews1", "text": "MARYLAND DEPARTMENT OF AGRICULTURE AWARDS 2022 SPAY/NEUTER GRANT TO HART FOR ANIMALS\n\nPosted 3/14/22\n\nHART for Animals was awarded a 2022 grant by the Maryland Department of Agriculture as part of their Spay and Neuter Program designed to reduce the number of unwanted cats and dogs euthanized in shelters across the state. This is the seventh year in which HART has been awarded the grant and, to date has provided 2,978 no-cost spay/neuter surgeries to low-income Maryland residents in Garrett and Allegany Counties. This year’s grant will enable HART’s Lifesaver program to perform 49 dog spays, 105 cat spays, 49 dog neuters, and 105 cat neuters. Residents who meet the income-eligibility requirements for Lifesaver are now scheduling their appointments for this year. Dog and cat owners may call 301.387.7729 to schedule.\n\nThe Maryland Spay/Neuter Program was conceived and initiated by Maryland Votes for Animals (MVFA) and implemented in accordance with the recommendations of a task force created by an act of the Maryland General Assembly in 2011. The task force’s report detailed that 50% of the cats and 33% of the dogs in Maryland’s shelter populations were being euthanized at a tremendous cost to Maryland taxpayers.\n\nThe bill to develop the state Spay and Neuter Grants Program became law in 2013. The objective of the program was to provide affordable spay and neuter services throughout the state in order to reduce shelter intake and euthanasia rates. Funding for the program is provided from fees paid by the pet food industry.\n\n“Spaying and neutering your pet does matter,” says Caroline Robison, HART’s Program Manager. “We all want to reduce the shelter intake and euthanasia rates. But also, 18% of neutered dogs live longer than unneutered dogs, and spayed females live 23% longer than unspayed female dogs, and have less health-related issues” she adds. “Another reason for the reduced lifespan of unaltered pets can be attributed to their increased urge to roam, which exposes them to fights with other animals, getting struck by cars, and other life-threatening situations.”\n\nHART’s veterinarian, Dr. Jessy Vandevender, notes that altered pets also have a reduced risk of certain types of cancers. “An unspayed female dog or cat has a greater chance of developing pyometra (a potentially fatal uterine infection), mammary cancer, and other cancers of the reproductive system.” Male dogs have health issues as well. The doctor adds, “Besides preventing unwanted litters, neutering your dog helps prevent cancer of the reproductive organs.”\n\nThe effectiveness of HART’s Lifesaver program and its low-cost HARTHelp program has been very positive, says Paula Yudelevit, Executive Director of HART. “HART has been keeping rescue and intake statistics from the Garrett County Animal Shelter since 2003. In 2011, the shelter took in 1,684 animals – the highest number ever – but in 2021, that number dropped to 1,200. The difference lies in the 12,155 animals HART has spayed or neutered through our programs since 2009.”\n\nHART for Animals, Inc. is a charitable animal welfare organization founded in 2003 to improve the condition of homeless animals in the Western Maryland region. HART is a 501 (c) (3) corporation and all donations are tax-deductible. HART uses 84% of all revenue to pay for its programs, including rescue, transport, spay/neuter, sheltering, and adoption. For additional information on HART, the HART Animal Center, or any of its programs, or to donate, visit the HART website at www.hartforanimals.org", "images": ["https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/New_Chamber_Logo/gcchamber_stackedlogo_20210916.jpg", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/convert/www.visitdeepcreek.com/assets/layouts/gcc/images/watermark-top.png", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/convert/www.visitdeepcreek.com/assets/layouts/gcc/images/watermark-bottom.png", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/Annual_AGF_Logo.jpg", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/convert/www.visitdeepcreek.com/files/242.png", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/convert/www.visitdeepcreek.com/files/241.png", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/convert/www.visitdeepcreek.com/files/240.png", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/248.jpg", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/Maryland-Tourism-Logo_URL_4C_website2.jpg", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/convert/www.visitdeepcreek.com/assets/images/favicon.png", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/convert/www.visitdeepcreek.com/files/248.jpg", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/convert/www.visitdeepcreek.com/files/221.png", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/MountainMarylandLogo_NEWwebsite-3.jpg", "https://devchambermaster.blob.core.windows.net/cms/media/icons/add-icon-flat.png", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/convert/www.visitdeepcreek.com/files/243.png", "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/instagram.png"], "top_img": "https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/847/CMS/convert/www.visitdeepcreek.com/assets/images/favicon.png", "keywords": [], "authors": [], "canonical_link": "", "title": "Garrett County Chamber of Commerce, MD", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "google-site-verification": "bjyG5Qi25FglgZwP992CTLTgewwezxwbM6avneSs_9g"}, "movies": [], "publish_date": null, "source": "https://www.visitdeepcreek.com", "summary": ""}