{"url": "https://en.wikipedia.org/wiki/Joey_Potter", "text": "Fictional character\n\nJosephine Lynn Potter[1] (previously thought to be born May 13, 1983, however there are conflicting opinions as in Season 6 her birthday is after they return from Summer break, which usually occurs in August or September in the USA)[1] is a principal character from the WB television drama Dawson's Creek, portrayed by Katie Holmes since the pilot. Joey appeared in all episodes of the series, which ran from 1998–2003.\n\nJoey, created by Kevin Williamson based on his childhood friend, is a tomboyish teenager growing up in the fictional town of Capeside. The series chronicles her journey from adolescence into adulthood, focusing in particular on her complex and evolving relationship with childhood friend Dawson Leery (James Van Der Beek).\n\nFictional biography [ edit ]\n\nBackground [ edit ]\n\nJoey has been best friends with Dawson Leery since they were in 3rd grade, and considers him 'her family'. She spent much of her early childhood at the Leery house, and Dawson was a constant comforting presence during traumatic events in her childhood. They spend many nights bonding over films and tv shows in his bedroom.\n\nShe has also known Pacey Witter her whole life, though they tolerate each other due to their friendships with Dawson until high school.\n\nShe lives with her older sister, Bessie, Bessie's son Alexander and (sometimes) boyfriend, Bodie. Her father, Mike, is in and out of prison for drug trafficking. Her mother, Lillian, died of breast cancer when Joey was thirteen.\n\nSeason 1 [ edit ]\n\nIn season one, Joey is the \"girl next door.\" She is confused by her growth into a teenager and her developing feelings for her longtime best friend Dawson, who believes is her soulmate.\n\nShe immediately becomes jealous when Jen Lindley arrives and steals Dawson's attention. She is intimidated by Jen, who grew up in New York and does not know how to compete. She lives with her pregnant sister Bessie, and she works for her at the Ice House, the Potter family restaurant. She is frustrated with having to deal with work and taking care of her sister along with significant helpings of teenage angst. Nonetheless, Joey manages to be helpful with the birth of Bessie's son, Alexander, as does their critical neighbor, Evelyn Ryan. One day she is convinced to compete in the beauty pageant, which she does so that she can win the cash prize. But instead of winning the contest, she wins Dawson's heart, as he finally sees past his best friend image, and realizes that he has strong romantic feelings towards her. At the end of the season, she finds herself with the opportunity of going to Paris for a year, but rejects it in favor of staying in Capeside with Dawson after she and Dawson kiss.\n\nSeason 2 [ edit ]\n\nAt the start of the season, she and Dawson begin dating and things start out well, but Joey struggles with figuring out her identity independently from their relationship. During a full moon, her co-worker Jack McPhee kisses her. Dawson finds out during a school dance and punches Jack. Distraught, Joey seeks Dawson out to apologize but decides she needs to take a break from him to \"find herself\".\n\nJoey immediately throws herself into a relationship with Jack, which becomes confusing when Jack is eventually outed as being potentially gay. Joey begins to lean on Dawson for support as Jack struggles and eventually confirms his sexuality to Joey. Joey struggles with readjusting to single life. Joey's father is released from prison and comes back into her life. At first, this change is uneasy, but they heal the rift between them.\n\nAfter Dawson supports Joey through this uneasy period, she apologizes to him, thanks him for putting up with her, and kisses him. Their reignited relationship is put at risk, however, when Dawson finds out that Joey's father is dealing cocaine. After a fire at the restaurant which was started by rivals of Joey's father, Dawson tells his parents who advise him he needs to go to the police. He tells Joey instead. He convinces her to work with the police, and she eventually agrees and get a confession from her father so that nothing like the fire will happen again.\n\nKnowing that she had betrayed her father, she lashes out at Dawson. She breaks up with him and tells him she doesn't even want to know him and that she will never forgive him.\n\nSeason 3 [ edit ]\n\nAfter Dawson returns from visiting his mom over the summer, Joey regrets breaking up with him and offers herself to him. Sensing his hesitancy, she attempts to manipulate him into reigniting the relationship, but Dawson rejects her, fearing another blowout will destroy their friendship permanently. Joey flees and Dawson asks Pacey Witter to keep an eye on her.\n\nJoey takes a job at a Logan's Marina, where she receives unwanted sexual advances from her supervisor, Rob Logan.\n\nJoey struggles with Dawson keeping his distance, and attempts to heal the rift in their shaky friendship. Meanwhile, she finds herself spending more and more time with Pacey. Joey has a brief relationship with a college student, A.J. Moller (Robin Dunne). This relationship makes Pacey jealous, and after she breaks up with A.J., Pacey kisses Joey. Joey is initially angry when Pacey kisses her; however, later forgives him after he apologizes for putting their friendships at risk.\n\nDuring a trip to the home of Dawson's aunt, Gwen (Gail's sister), Pacey continues to put himself in Joeys path, trying to convince her she might have feelings for him too. Joey feels a spark after he touches her and Pacey kisses her again. Pacey tells Joey she needs to figure out what she wants and leaves. Joey stops him and pulls Pacey into a kiss, but Dawson's aunt Gwen sees this happen and warns her not to be careless with Dawson’s heart. After this realization, they begin a secret romantic relationship.\n\nJoey grows more anxious the longer she keeps their relationship secret. When Jen accidentally tells Dawson first, he reacts furiously. Dawson confronts the two over their secrets, ends his friendship with Pacey and gives Joey an ultimatum between dating Pacey and saving their friendship. Joey tearfully ends things with Pacey in an effort to cling on to her lifelong friendship with Dawson, leaving all three alone and devastated.\n\nDawson and Joey begin to converse again, however, Joey is dismayed that Dawson considers his friendship with Pacey forever destroyed. Dawson decides to win Joey back, including competing in a sailing race with Pacey and throwing an alternative prom with Joey as his date. However, when Dawson witnesses Joey and Pacey share a romantic dance, he leaves devastated. Joey once again chooses her friendship with Dawson and climbs back through his window.\n\nIn the season finale, Joey confesses to Dawson that whilst she considers their friendship her first priority, if she thought he might forgive her then she might have continued to pursue a romantic relationship with Pacey. Dawson eventually urges Joey to follow her heart, and with his urging, Joey rushes off to tell Pacey that she is in love with him before he departs for a summer at sea on his boat. She joins Pacey on his boat, the True Love, and the two then sail off into the sunset.\n\nSeason 4 [ edit ]\n\nPacey and Joey return from their summer at sea madly in love, however, Pacey becomes increasingly worried by Joeys eagerness to begin rebuilding her friendship with Dawson. Joey reaches out to Dawson with a symbolic present, and whilst it appears he is moving on from the incident, he isn’t sure whether he wants Joey in his life anymore, leaving her devastated and determined to fix it.\n\nJoey discovers Pacey has returned to academic probation after irresponsibly skipping summer school, while Joey dreams of admittance to the prestigious Worthington College in Boston. Joey and Pacey continue dating, although their relationship begins to become strained by Joeys determination to rebuild her friendship with Dawson and prioritize his feelings over her relationship. She struggles with watching Dawson move on romantically with Gretchen and continues reaching out to him in an attempt to heal their friendship. She is eventually relieved and delighted that he starts to soften his stance and confide in her again.\n\nOn a ski trip with the senior class, Pacey and Joey finally sleep together for the first time, which she struggles with emotionally. She runs into Dawson whilst walking through Capeside, and is delighted when he agrees to spend the night with her. However, she later lies to him about having slept with Pacey.\n\nGretchen discovers the lie and confronts Joey over it, to which Joey reacts defensively and possessively, prioritizing her fragile friendship with Dawson over the Witters. Gretchen informs Pacey, leaving their relationship further strained.\n\nJoey is admitted to Worthington but discovers she won’t receive enough financial aid, and confesses her lie to Dawson after he offers to front her a payment from Mr Brooks inheritance. She is beyond relieved when Dawson accepts her apology and reaffirms the survival and importance of their bond. She eventually accepts the money from Dawson to attend Worthington.\n\nAfter Joey returns from New York with Jen, she discovers from Gretchen that Pacey was arrested for public drunkenness and that she also believes she may be pregnant. Bessie soon finds out that Joey believes she may be pregnant at Gail's baby shower, and Bessie argues with her about not being ready to have a baby, and having an immature boyfriend who would never cope with a child. Joey later defends herself by saying that whatever happens in her life will be different. Joey does a test and finds out she is not pregnant, but the situation draws the sisters close together. When Joey finally reaches Pacey on the phone, she doesn’t tell him about the pregnancy scare and is disappointed that Pacey didn't tell her about his arrest.\n\nPacey grows more and more frustrated by the belief that he’s holding her back and that he feels worthless in their relationship. After seeing Dawson and Joey dancing happily at prom, Pacey explodes at Joey in front of all their peers, leaving her crying and embarrassed. She and Pacey end their relationship. She seeks solace in her reignited friendship with Dawson, and is disappointed that Pacey runs away as a crew member in a boat on the Caribbean.\n\nDuring the month after graduation, Joey and Dawson throw themselves back into their friendship in an attempt to heal their broken hearts. Joey begins to get over Pacey but becomes increasingly dismayed at Dawson’s impending departure.\n\nOn Dawson’s last night in Capeside, he and Joey both feel underwhelmed at their initial goodbye and seek each other out.\n\nAfter watching E.T. and reminiscing about the highs and lows of the last four years, Joey tearfully confesses her appreciation for Dawson and their friendship; somehow their bond survived everything and everyone else, including her failed relationship with Pacey. She declares him incredible, compares their friendship to magic, and asks him to stay. He gently reinforces his need to get out of his room and start living his life, and they share a goodbye kiss.\n\nSeason 5 [ edit ]\n\nJoey begins her first semester at Worthington University in Boston, where she meets and tolerates her new roommate Audrey Liddell. Joey and Dawson are in touch but struggling with interpreting their complicated friendship after their goodbye kiss. Dawson eventually drops out of U.S.C. to move to Boston, exciting Joey about the future. Meanwhile Joey discovers Pacey's presence in Boston and greets him, wanting to try to be friends again and reintegrate him into their friendship group.\n\nThrowing everyone for a loop, Mitch is killed in a car accident. Joey attempts to support a struggling Dawson as he makes arrangements and hold things together for his family. Joey’s attempts at comforting Dawson clash with his needs, and he asks to be alone. Upon returning to her dorm room in Boston, a crying Joey is comforted by Audrey.\n\nJoey struggles to support Dawson in the coming months and becomes worried when he begins pulling away and leaning on Jen for support. Whilst Jen and Dawson are away for the weekend, Joey catches Jack in a 'bid' to get one of his frat brothers in bed with Audrey during the fraternity's Winter Formal. At a group dinner, she is shocked and secretly devastated when the gang catch Dawson and Jen returning from their weekend away blissfully together, and it becomes apparent they have slept together. Joey confronts Dawson over their failing friendship and is devastated when he confirms he needs space away from her.\n\nJoey later joins the band, Aggressive Mediocrity, as lead singer with Jen's cheating ex, Charlie Todd (Chad Michael Murray). They embark on a whirlwind romance before she tells him to leave to pursue his dream of being a touring musician. She has an unforgettable run-in with a mugger who gets hit by a car shortly after robbing her at gunpoint. However, when she is requested to be at his side in the hospital, Joey discovers that the mugger is also a drug addict, and has a young daughter, Sammie, with his wife, Grace. When the mugger dies with Joey at his side, she returns to the waiting room, all of her belongings returned, including the money. Thinking of Sammie, whose situation reminds her of the relationship she has with her own father, Joey leaves all the money hidden in Grace's backpack.\n\nIn the aftermath of the incident, Joey is delighted when a concerned and terrified Dawson begins spending time with her again, and she eventually confides in him about her complicated relationship with her professor. Their friendship blooms further after his relationship with Jen ends, and she urges him to join her and their friends for spring break in Florida.\n\nAfter the semester ends, Joey returns to Capeside with Audrey in tow, and is shocked to discover Dawson had traveled to Florida to reignite their romantic relationship over spring break. Her delight is mellowed by news that Dawson is returning to L.A, and when she confronts Dawson over Florida and he confesses to her that his feelings for her have returned, she rejects him out of fear of holding him back from his life.\n\nAfter reading a goodbye note Dawson left for her, she rushes to the airport to intercept him, declaring her love for him but convincing him to go start his life. She passionately kisses him and sends him off. As she goes to get a refund for her gate ticket, she is offered the chance to go to Paris, and the audience is left hanging.\n\nSeason 6 [ edit ]\n\nIt is revealed that Joey didn't end up going to Paris, but went home to Capeside. She had a fling but ended it after he declared he liked her. She hangs out with her friends and is surprised that no one has remembered her birthday. After not talking all summer, she and Dawson meet up and have an incredibly romantic evening. After Dawson surprises her with a birthday present, they kiss and end up sleeping together multiple times over the next day.\n\nAfter spending the day together, Joey discovers Dawson has had a casual relationship whilst in California. Despite having her own summer fling, Joey freaks out and uses it as an excuse to push him away again, leaving them both devastated. She later caters his film set and nearly gets him fired. They tearfully part ways, hoping with time and space they will be able to salvage their friendship.\n\nShe takes a job as a waitress at Hell's Kitchen, with the help of aspiring drummer, Emma Jones. Joey eventually falls for the bartender, Eddie Doling (Oliver Hudson). They both have a love for writing and literature, but it turns out that he is not officially a student at Worthington, as his family was too poor to afford the tuition.\n\nAt Christmas, Joey brings Eddie to the Leery household, where an intoxicated Audrey calls out her, Dawson, and Pacey's complicated history. Dawson and Joey share their first conversation in months, finding solace in each other’s company.\n\nAfter Christmas, Eddie disappears without telling Joey, going back to Worcester to live with his parents. In trying to find him, Joey gets some help from Harley Hetson—the 15-year-old, alienated, headstrong daughter of her snobbish and somewhat misogynist English professor, Greg Hetson (Roger Howarth), whom Joey clashes with several times during the entire season. Harley lies, telling Eddie that Joey was pregnant with his child in order to lure him back to Boston.\n\nJoey and Pacey share a kiss at his apartment during a party. After being locked overnight in a K-Mart together, they discuss their past and current relationship. How they feel uncomfortable talking about sex with each other or how they never discuss their past and how the fact they never had closure impacts them. In an intimate moment Joey shaves his beard. When they go to sleep she tells him a fantasy she had when she was a teenager. In the fantasy they would be castaways in an idyllic island, living their love away from everyone. They share a bittersweet kiss after her confession. Each admits that they miss the other.\n\nHowever, when Eddie returns from California, Joey ends things with Pacey and reunites with him. Soon, she realizes things are not working with Eddie and the best thing for her is to spend sometime alone thinking about her life.\n\nJoey returns to Capeside and is delighted to read Dawson’s new screenplay. She visits the Leery house and reignites her friendship with Dawson. After a great day together, she is devastated at Paceys revelation of losing Dawson’s money. She tries to keep them calm, but they explode at each other again, reigniting their years-old fued and leaving all three alone and devastated once again.\n\nJoey takes it upon herself to pick up a devastated and despondent Dawson and manages to gather enough hands and equipment for him to begin production. When Pacey tries to use her as an in-between to give him money, Joey refuses to get in the middle again. She spends her last night in Capeside with Dawson, before finally flying to Paris. Before leaving she secretly schemes to get Pacey and Dawson together, hoping her absence will help them to finally repair their friendship without her in the middle.\n\nSeries finale [ edit ]\n\nThe final two episodes are set approximately five years after the season finale. Joey is a junior editor living in New York with her writer boyfriend, Christopher (Jeremy Sisto). Joey returns to Capeside for Gail Leery's wedding to her new husband, which her old high school friends are attending, including her soulmate.\n\nThe five friends reunite at Pacey's restaurant to reminisce about the past. Afterwards, Joey once again finds herself at Dawson's house, feeling like she didn’t get enough alone time with her oldest friend. The two talk at length about their lives and relationships, cementing their friendship once again. She sleeps over, like she has so many times before, before leaving to prepare for the wedding.\n\nDuring Gail's wedding reception, Joey and Pacey kiss (reigniting lingering feelings between the two), but the moment is interrupted when Jen collapses. It is later discovered that Jen has a deadly heart condition. The night she finds out, she races over to find solace with Dawson.\n\nJoey, Pacey and Dawson each play important roles in Jens last days. Joey comforts a distraught Dawson after he helps Jen film a video for her daughter Amy, whilst Jen insists Joey deal with her feelings and decide what she wants once and for all. Joey ends her relationship with Christopher. She finds herself at Paceys restaurant and the two have an honest conversation. Whilst he is prepared to let her go, she stops him. Joey tells him that she loves Dawson, she acknowledges that he is her soulmate, he is tied to her childhood, a love that is pure, eternally innocent and necessary to her life.\n\nShe also confesses her love for Pacey, which confuses him. They are interrupted before she can clarify...\n\nJoey visits Dawson at the Leery house, where he is crying whilst remembering Jen's first day in Capeside. The two discuss work, love, and life, and both verbalise the importance of their bond to their lives. Dawson acknowledges that whether or not they end up together - \"In some ungodly way... its always gonna be you and me\". Joey declares Dawson her soulmate, and as they watch their younger siblings play like Joey and Dawson did so many years ago, Joey tearfully tells him she loves him. He reciprocates, and through her tears she declares -\n\n“You and me, always.”\n\nThey smile and cry, delighted that their childhood bond has survived the complications of growing up.\n\n—EPILOGUE—\n\nWeeks later, whilst watching the season finale of “The Creek” from Joey's New York apartment, it is revealed that Joey and Pacey have reconciled and are apparently living together.\n\nThey call Dawson immediately after, having reconciled their friendships. Dawson reveals that tomorrow he is going to meet his hero, Steven Spielberg, and Pacey and Joey converse ecstatically with him as the camera pans to a photograph of Dawson, Joey, Jen and Pacey from Season 4.\n\nNotable relationships [ edit ]\n\nAnderson Crawford Fling Beginning: \"Kiss\" (1.03) Broke Up: \"Kiss\" (1.03) Reason: They didn't continue because he went back to boarding school.\n\nDawson Leery Kiss \"Detention\" (1.07) Reason: They were dared to kiss each other despite him being with Jen. Kiss ‘’’”Boyfriend”’’’ (1.08) Reason: Joey was drunk and laying down when she pulled Dawson in for a kiss while he was talking about their complicated relationship. \"Coda\" (4.23) Reason: They kiss to mark the beginning of the next phase of their lives. \"High Anxiety\" (5.06) Reason: Joey kiss him to show that she still believes they can find each other in the future. Boyfriend First Relationship: Beginning: \"Decisions\" (1.13) End: \"The Dance\" (2.06) Reason: After Jack kisses her, she gets confused about who she really is and what she wants. Second Relationship: Beginning: \"A Perfect Wedding\" (2.18) End: \"Parental Discretion Advised\" (2.22) Reason: Dawson convinced her to get her father to confess to burning down the ice house and she blames him for it. Third Relationship: Beginning: \"The Kids Are Alright\" (6.01) End: \"The Song Remains The Same\" (6.02) Reason: After they sleep together, she finds out he had a summer fling.\n\nJack McPhee Kiss \"Full Moon Rising\" (2.05) Reason: She was still with Dawson. Boyfriend Beginning: \"The Reluctant Hero\" (2.08) Broke Up: \"...That Is The Question\" (2.15) Reason: He finds out after writing a poem that he's gay\n\nA.J. Moller Boyfriend Beginning: \"Northern Lights\" (3.13) Broke Up: \"Cinderella Story\" (3.17) Reason: Didn't continue to be a couple because she finds out his best friend loves him and he loves her but doesn't know it yet.\n\nPacey Witter Kissed \"Double Date\" (1.10) Reason: Joey was in love with Dawson. Kissed \"Cinderella Story\" (3.17) \"Neverland\" (3.18) Reason: She pulls away angrily that he has violated her boundaries. Boyfriend First Relationship: Beginning: \"Stolen Kisses\" (3.19) End: \"The Longest Day\" (3.20) Reason: Dawson gives her an ultimatum and she chooses their friendship. Second Relationship: Beginning: \"True Love\" (3.23) End: \"Promicide\" (4.20) Reason: Pacey evicerates Joey in front of their peers at the prom. Third Relationship: Beginning: Castaways\" (6.15) End: \"Love Bites\" (6.18) Reason: Joey chooses her boyfriend over him. Fourth Relationship: Beginning: ...Must Come To An End\" (6.24) Note: Jen tells Joey her final wish is for Joey to stop running away. Jen's death motivates Joey to reunite with Pacey.\n\nDrue Valentine Kissed Beginning: \"The Tao of Dawson\" (4.11) End: \"The Tao of Dawson\" (4.11) note: they got locked in a storage locker together, he caught her when she fell and kissed her. She pushed him away immediately, and punched him. She was in love with Pacey.\n\nCharlie Todd Kissed Beginning: \"Something wild\" (5.11) Broke Up: \"Something wild\" (5.11) Reason: Because he cheated on Jen. Fling Beginning: \"100 Light Years From Home\" (5.19) Broke Up: \"Separate Ways (Worlds Apart)\" (5.20) Reason: She tells him to go off and fulfill his dream of being a musician\n\nElliot Almost Fling but never kissed Beginning: \"Sleeping Arrangements\" (5.12) Broke Up: \"Guerrilla Filmmaking\" (5.14) Reason: She met him when she wasn't over Dawson. Then she thought he slept with Audrey, and after finding out he never slept with her, she gives him another second chance. But she later bails on a date with him (by claiming she was sick) to go to a thing with Wilder who she later kissed and the next day tells him she can't go out with him off-screen.\n\nProfessor David Wilder Kissed/Almost Fling Beginning: \"Something Wilder\" (5.13) Broke Up: \"In A Lonely Place\" (5.16) Reason: Joey inadvertently stands David up after getting mugged. This gives him the time to reflect upon the relationship and he realizes that he can't have an affair with a student.\n\nEddie Doling First Kiss: \"Instant Karma!\" (6.04) Eddie thinks she only kissed him to get back at Dawson; so it doesn't lead to anything until later episodes. Boyfriend First Relationship: Beginning: \"Ego Tripping At The Gates Of Hell\" (6.07) Broke Up: \"Rock Bottom\" (6.13) Reason: He left without telling her Second Relationship: Beginning: \"Love Bites\" (6.18) Broke Up: \"Catch-22\" (6.20) Reason: They didn't see a future with each other\n\nChristopher Boyfriend Beginning: About a year or two before \"All Good Things...\" (6.23) End: \"...Must Come To An End\" (6.24) Reason: Joey breaks up with him over the phone after having found a ring in his drawer back in New York.\n\n\n\nHolmes' thoughts on Joey Potter [ edit ]\n\n\"I'm a lot like Joey,\" said Holmes. \"I think they saw that. I come from a small town. I was a tomboy. Joey tries to be articulate and deny that she doesn't have a lot of experience in life. Her life parallels mine, which is all about new everything—relationships, personal perceptions—and about being guarded.\" Holmes filmed the pilot of Dawson's Creek in Wilmington, North Carolina, during spring break of her senior year of high school in 1997.[2][failed verification] When the show was picked up by The WB, Holmes moved to Wilmington, where the show filmed.[citation needed]\n\nDawson's Creek ran from 1998 to 2003, and Holmes was the only actor to appear in all 128 episodes. \"It was very difficult for me to leave Wilmington, to have my little glass bubble burst and move on. I hate change. On the other hand it was refreshing to play someone else,\" she said in 2004.[3] Holmes confirmed that, as often happens on soaps, the character was a caricature of the actor:\n\nI miss her spirit, and her spunk, and I miss her anxiety. She always had these long speeches about her fears and her future and love. It was a great tool for me personally because I got to get it all out. I was able to psychoanalyze all of it everyday [sic?] with her and then I wouldn't have to do it on my own. So much of me is in Joey and it really felt like I grew up on television.[4]\n\nReception [ edit ]\n\nKatie Holmes received high acclaim during second season and has since been referred to as the series' central character by the media.\n\n\"Joey Potter is a headstrong, vibrant, wily, sultry, and determined go-getter. And yet, in a gloriously contradictory manner, in spite of her tough-as-nails exterior demeanor, Joey's also a frail, sometimes uncertain, emotionally sensitive, in-need-of-love person\", said the show's official book.[5] Joey, named for Jo in Little Women, for years had been climbing in Dawson's bedroom window and platonically sharing his bed. Joey's mother had died from cancer when Joey was thirteen and her father, Mike (Gareth Williams), was in prison for \"conspiracy to traffic in marijuana in excess of 10,000 pounds.\" Her harried, unmarried, and very pregnant sister, Bessie (Nina Repeta), about ten years older than Joey,[n 1] was raising her while running the Ice House restaurant, where Joey worked as a waitress. GQ described Joey as \"kind of an uptight fussbudget—one who's always twisted up over doing the right thing and bungling-up ways to hook up with her crush and across the creek neighbor, Dawson.\"[6]\n\nThe 5 ft 9 in (1.75 m) tall[6][7] brunette enchanted the press, writers of both sexes commenting how Holmes was the sort of girl one wants to bring home to meet the parents and to marry.[8][6] \"The Audrey Hepburn of her generation\", was one typical comment.[9] Time called her \"impossibly lovely\" and Entertainment Weekly said she was \"next up for idolhood.\"[10][11] Variety, reviewing the pilot, said Holmes \"is a confident young performer who delivers her lines with slyness and conviction.\"[12] Holmes made such an impression in Hollywood, The New York Times Magazine claimed everyone was seeking to cast a \"Katie Holmes type\", who, the reporter claimed, \"is a throwback to the 1950s: she is a smart girl next door (as opposed to the babe-o-rama blondes)\"—the sort represented by her Dawson's Creek co-star Michelle Williams.[13] But her \"type\" was no less attractive, Arena magazine declaring her \"the most coquettishly sexy woman on television. Anywhere.\"[14]\n\nHolmes was soon on the covers of magazines such as Seventeen, TV Guide, and Rolling Stone. Jancee Dunn, an editor at Rolling Stone said she was chosen for the cover because \"every time you mention Dawson's Creek you tend to get a lot of dolphin-like shrieks from teenage girls. The fact that she is drop-dead gorgeous didn't hurt either.\"[15]\n\nReviews were mixed. The Blade said the characters \"just talk like they came from a planet ruled by Manhattan psychologists, one where small talk is punishable by death.\"[16] Holmes herself needed help with the dialogue. \"Sometimes before we read a script, I have to get my dictionary and call people to make sure I'm pronouncing some of the words correctly.\"[17] The show brought her national attention and many fans back home; Toledo's Thanksgiving Day parade in November 1998 had record attendance when Holmes was named grand marshal.[18][19]\n\n\"As Joey\", said Life magazine, \"Holmes has had seismic influences on teen life... Through it all, Joey has managed to hang on to her integrity... The show—and Katie's character in particular—has touched a nerve.\"[20]\n\nHer Season 3 arc with Pacey is often praised in pop culture. Jezebel said \"their screwball dynamic, coupled with actors Katie Holmes and Joshua Jackson’s untapped chemistry and an intricately plotted courtship subverted everything expected of the show. It unsurprisingly still resonates with so many millennial women who grew up watching the series. There was a time when we had come for the angst, but now we were staying for the romance.\".[21] They were included in TV Guide's list of \"The Best TV Couples of All Time\".[22] They are also in MsMojo's lists \"Top 10 Cutest Teen Drama Couples\" and \"Top 10 Iconic TV Couples of the 2000s\". And also featured on the Buzzfeed's \"19 Friends-To-Lovers TV Couples That Stole Fans' Hearts\" list.[23]\n\nNotes [ edit ]\n\n^ Dawson's Creek, Season 2, confirmed Bessie was in high school when Joey was in kindergarten", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/1/1d/JoeyPotter.jpg/200px-JoeyPotter.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Katie_Holmes%2C_2009.jpg/180px-Katie_Holmes%2C_2009.jpg", "https://upload.wikimedia.org/wikipedia/en/1/1d/JoeyPotter.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1"], "top_img": "https://upload.wikimedia.org/wikipedia/en/1/1d/JoeyPotter.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Joey_Potter", "title": "Joey Potter", "meta_data": {"generator": "MediaWiki 1.38.0-wmf.25", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/1/1d/JoeyPotter.jpg", "width": 640, "height": 755}, "title": "Joey Potter - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}