{"url": "www.latimes.com/entertainment/la-et-entertainment-news-updates-katherine-1484668920-htmlstory.html", "text": "AEG Live’s ties to anti-LGBT groups ‘nothing more than fake news,’ says Philip Anschutz\n\nCoachella in 2016. (Katie Falkenberg / Los Angeles Times)\n\nFollowing news this week that the Coachella Valley Music and Arts Festival had booked Radiohead, Kendrick Lamar and Beyoncé to lead its 2017 lineup, the owner of the company that oversees the festival’s organizers has come under fire for his political interests.\n\nAccording to a widely picked-up report in Uproxx, Philip F. Anschutz, the owner of AEG, whose AEG Live division is the world’s second largest presenter of live music, sports and entertainment after Live Nation, has donated to a number of anti-LGBTQ groups such as Alliance Defending Freedom, National Christian Foundation and Family Research Council.\n\nA number of these organizations have been listed as “extremist groups” by the Southern Poverty Law Center.\n\nBecause AEG Live oversees Coachella promoter Goldenvoice, people have taken to social media to question if anyone should drop hundreds of dollars for the destination festival out of fear that their money would fund anti-gay groups. General admission passes to Coachella sold out in an hour on Wednesday.\n\nIn a statement to The Times on Thursday, Anschutz said he was unaware of the anti-LGBTQ work done by any of the organizations he had supported and that he had ceased all contributions after learning.\n\n“Recent claims published in the media that I am anti-LGBTQ are nothing more than fake news – it is all garbage. I unequivocally support the rights of all people without regard to sexual orientation,” the statement read. “We are fortunate to employ a wealth of diverse individuals throughout our family of companies, all of whom are important to us – the only criteria on which they are judged is the quality of their job performance; we do not tolerate discrimination in any form.”\n\nAnschutz is one of the richest people in America, amassing fortunes in oil, railroads, telecom and real estate on top of his entertainment endeavors (he came in at No. 42 on Forbes’ U.S. billionaires list last year) and the conservative dealings of his foundation were reported by the Washington Post over the summer in a piece that labeled him as one of the “enemies of equality.”\n\nHis foundation was said to have donated $110,000 to Alliance Defending Freedom, a group that “advocates for your right to freely live out your faith”; $50,000 to National Christian Foundation, an organization that funds groups that have worked to fight LGBT rights; and $30,000 to Family Research Council, which is labeled as an “extremist group” by the SPLC. The contributions were made between 2010 and 2013.\n\nAnschutz said he and his foundation contribute to numerous organizations “that pursue a wide range of causes.”\n\n“Neither I nor the Foundation fund any organization with the purpose or expectation that it would finance anti-LGBTQ initiatives,” the statement continued, “and when it has come to my attention or the attention of The Anschutz Foundation that certain organizations either the Foundation or I have funded have been supporting such causes, we have immediately ceased all contributions to such groups.”", "images": ["https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.latimes.com/entertainment/la-et-entertainment-news-updates-january-2017-htmlstory.html", "title": "Today in Entertainment: Oprah Winfrey to join ‘60 Minutes’ as contributor; AFI voices support for Asghar Farhadi", "meta_data": {"og": {"title": "Today in Entertainment: Oprah Winfrey to join '60 Minutes' as contributor; AFI voices support for Asghar Farhadi", "url": "https://www.latimes.com/entertainment/la-et-entertainment-news-updates-january-2017-htmlstory.html", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "url": "https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "width": 1200, "height": 630, "type": "image/jpeg", "alt": "LA Times logo"}, "description": "Major award shows such as the Grammys and the Oscars are right around the corner, but much of the arts and entertainment world is spending more time reacting to the new presidency of Donald Trump and his recent executive order on immigration. Here's what's new and interesting in entertainment and…", "site_name": "Los Angeles Times", "type": "website"}, "twitter": {"card": "summary_large_image", "description": "Major award shows such as the Grammys and the Oscars are right around the corner, but much of the arts and entertainment world is spending more time reacting to the new presidency of Donald Trump and his recent executive order on immigration. Here's what's new and interesting in entertainment and the arts:AFI voices support for Oscar nominee Asghar FarhadiWatch the final 'Beauty and the Beast' trailerJames Corden protests Trump's travel banOprah Winfrey to join '60 Minutes' as the first contributor in the show's historyCelebrities join LAX protest of travel ban", "site": "@latimes", "title": "Today in Entertainment: Oprah Winfrey to join '60 Minutes' as contributor; AFI voices support for Asghar Farhadi"}, "fb": {"app_id": 134435029966155, "pages": 5863113009}, "viewport": "width=device-width,initial-scale=1", "description": "Major award shows such as the Grammys and the Oscars are right around the corner, but much of the arts and entertainment world is spending more time reacting to the new presidency of Donald Trump and his recent executive order on immigration. Here's what's new and interesting in entertainment and the arts:AFI voices support for Oscar nominee Asghar FarhadiWatch the final 'Beauty and the Beast' trailerJames Corden protests Trump's travel banOprah Winfrey to join '60 Minutes' as the first contributor in the show's historyCelebrities join LAX protest of travel ban", "brightspot.contentId": "0000016c-68c4-d4d6-a16e-eaef17780000", "brightspot.cached": "false"}, "movies": [], "publish_date": null, "source": "http://www.latimes.com", "summary": ""}