{"url": "https://www.cosmopolitan.com/style-beauty/beauty/how-to/a33187/how-to-defrizz-your-hair/", "text": "Let it be known that there is absolutely nothing wrong with frizzy hair. Like, nothing at all. Frizz is natural and nothing to “tame\" or \"control,\" but if that's not the look you're going for at the moment (it's your hair and you can do what you want with it), you might be looking for ways to smooth or get rid of your frizzies, flyaways, or wispies. And personally, I get it: Few things are as frustrating as spending all your time styling your hair only for it to frizz-out with a tiny bit of humidity or wind.\n\nBut since smoothing your frizz and flyaways isn't all that simple, we created this helpful list of tricks for you to refer to next time you want to try a smoother style. Before we jump, though, a quick refresher of what frizz is and what leads to frizzy hair:\n\nWhat causes frizz and frizzy hair?\n\nWhen your hair is damaged, dry, or chemically treated, the cuticle (outer layer of the hair strand) raises and opens up, which lets moisture enter, causes it to swell, and creates frizz. Knowing this, the key to smoothing frizz is making sure your hair cuticles are as flat and sealed as possible.\n\nSo how exactly do you do that? That's where we come in. We gathered a bunch of advice, tried-and-true tricks, and product recs from professional hairstylists, beauty editors, and even a dermatologist to share with you below. If smooth, flyaway-free hair is your goal, keep reading for the 19 best tips for frizzy hair, and take notes.\n\n1. Take your time when blow-drying\n\nGHD Air Professional Performance Hairdryer ulta.com $199.00 SHOP NOW\n\nIf you haphazardly blow dry your hair, chances are you'll have knots, tangles, flyaways, frizz—you name it—by the end of your styling sesh. Blow-drying your hair in sections with a boar bristle brush to create the tension needed to smooth the hair, and actually using the nozzle attachment that comes with your blow dryer can make all the difference. “When blow-drying, use the concentrator nozzle so that you can control the direction of airflow, pointing downward, so you are encouraging the cuticle to lay down flat,” says Aaron Grenia, co-founder of .\n\n2. Apply oil on damp or dry hair\n\nOlaplex No.7 Bonding Oil amazon.com $28.00 SHOP NOW\n\n“ , or any lightweight hair oil, is my true BFF for second-day flyaways on my 2c hair,” says Sami Roberts, beauty assistant at Cosmo. “I shake three to four drops into in my palm, flip my head over, and rake oil through the length of my hair. It adds shine and lays down frizz without looking greasy.”\n\nCelebrity hairstylist and R+Co collective member Anthony Campbell loves using oil on frizzy hair when dry as well but also suggests applying it to damp, towel-dried hair after a shower. “I would use less oil on finer textures and a little more for thicker textures,” Campbell says.\n\n\n\n3. Use mousse for hairline frizzies\n\nHerbal Essences Totally Twisted Curl-Boosting Mousse with Berry Essences amazon.com $3.25 SHOP NOW\n\nIf your hair frizzes up around your hairline or roots, Cosmo deputy beauty director Chloe Metzger has the perfect trick for smoothing it out when wearing a bun hairstyle or updo. “When I want a sleeker finish fast, I wet my hands, rub the tiniest puff of mousse between my hands to dilute it—think: 90 percent water, 10 percent mousse—then smooth my hands over my roots and hairline,” Metzger says. “Since it’s just the top layer of my hair, it doesn’t take a long time to dry, and I’m left with smooth, but not stiff, curls, thanks to the hint of mousse.”\n\n\n\n4. Finish styling with a hair serum\n\nSEEN Magic Serum, Fragrance Free helloseen.com $36.00 SHOP NOW\n\nHair serums are one of the best answers to frizz and flyaways, but they're often filled with silicones. While some hair types may find silicones beneficial for heat-styling protection, conditioning, adding shine, and smoothing the cuticle, if you're trying to avoid them (as someone with curly hair or fine hair might), Iris Rubin, board-certified dermatologist and founder of Seen Hair Care, says to look for products with silicone alternatives.\n\n“Hemisqualane is a plant sugar-derived silicone alternative that provides color and heat protection and is great at reducing frizz,” Dr. Rubin explains. “Squalane is also wonderful for adding moisture and shine into hair.” The Seen Magic Serum is fragrance-free and only contains three ingredients: squalane, hemisqualane, and ethylhexyl olivate, which softens the hair.\n\n5. Stick with smoothing styling formulas\n\nKenra Professional Smoothing Spray ulta.com $19.99 SHOP NOW\n\nSmoothing formulas are ideal when talking about frizz and flyaways, but what works for someone with thick, coarse hair wouldn't be best for someone with thin or fine hair. If your individual hair strands are thick and you've got a whole lot of 'em, Grenia says to go with a that has a bit of weight to the formula. But if your hair strands are finer or don't have as much density, Grenia recommends a lightweight aerosol that won't weigh down your hair.\n\n6. Get frequent trims to prevent breakage\n\nFagaci Professional Hair Scissors 6 Inch amazon.com $79.99 $59.99 (25% off)\n\nOne of the easiest ways to prevent damage and breakage that can lead to flyaways? Make sure you trim your hair at least once every three months. Split ends are especially prone to dryness (aka frizzy hair's worst nightmare) and can lead to breakage that makes the strand much shorter than the rest of your hair, so schedule regular appointments with your hairstylist to avoid any long-term damage.\n\nAnd, yes, since I know you're thinking it—you can trim your own hair at home, but make sure you invest in a pair of legit . “Think of cutting your hair as you would cutting fabric—you want a pair of good-quality shears to make sure you're getting a clean and safe cut,” Cory Aaron Scott, celebrity hair expert and founder of Loft 647 in West Hollywood, previous told Cosmo about the best hair cutting scissors. Scott recommends a pair from Fagaci for quick and easy maintenance in-between salon visits.\n\n7. Try keratin treatments\n\nGussi At-Home Keratin Treatment Kit gussihair.com $60.00 SHOP NOW\n\nIf you're looking for a long-term solution to frizzy hair, ask your hairstylist about an in-salon hair-smoothing treatment. There are a handful of gentle, formaldehyde-free options on the market rn (see: Cezanne and Goldwell Kerasilk) that help soften and elongate your hair texture—no damage included.\n\n“Formaldehyde-free treatments smooth frizz without removing your texture,” Kathy Combs, global director of Education at Cezanne, has told Cosmo about keratin treatments. “That means your hair will retain its natural curl when you air-dry, but it can still look smooth and sleek with a quick blow-dry.” Celebrity hairstylist Laura Rugetti, who works with Tori Spelling, Teddi Mellencamp, Audrina Patridge, and Lisa Rinna, loves the Pura Luxe straightening treatment and suggests asking your stylist about it as well.\n\nThere are even a few at-home keratin treatments worth trying too. This product from Gussi is spiked with keratin amino acids (to strengthen and repair split ends), castor oil (to smooth damaged cuticles), and a dose of moringa oil (for frizz).\n\n8. Dry your hair with a diffuser\n\nDyson Special Edition Supersonic Hair Dryer ulta.com $429.99 SHOP NOW\n\nIf you've got curly or coily hair, you know that traditional blow-drying can leave you with more frizz and flyaways. If that's not your goal, try a diffuser attachment instead—it'll help evenly disperse the airflow from your dryer so you get more definition and volume. Hairstylist Leigh Hardges previously told Cosmo in an article about hair diffusers that one with a lot of tiny holes (like this diffuser by Dyson) decreases drying time without disturbing the curls.\n\nP.S. Need a visual? This tutorial is a great place to start for type 4 hair, and this one's excellent for looser curls. Just take your time with it and don't be afraid to customize your technique to fit your hair and its needs.\n\n9. Block out humidity\n\nOribe Impermeable Anti-Humidity Spray dermstore.com $23.00 SHOP NOW\n\nHumidity is a big reason behind unwanted frizz, and since you can't control the weather, try the next best thing: anti-humidity sprays. “The top of my head measures a foot tall if I don’t use any product post-shower, so preventing frizz is atop my list (especially in the summer),” says freelance beauty assistant Valeriya Chupinina. “I like to pat my roots with an anti-humidity hairspray, like the , to shield my hair from any heat or frizz-inducing foe I might encounter throughout my day.”\n\n10. Prep your hair with heat protectant\n\nIGK Good Behavior 4-in-1 Prep Spray amazon.com $29.00 SHOP NOW\n\nFried, sizzled hair is way more prone to frizz and flyaways than healthy, nourished hair, so if you know you're using a hot tool, make sure you've got a solid heat protectant on hand. Don't have one? Consider a multipurpose styling product that offers not only heat protecting but other benefits as well so you get the most bang for your buck. Grenia recommends the as the first step in your styling routine. When applied to damp hair, it can help detangle, smooth frizz for hours, add shine, and of course, protect against heat up to 450 degrees.\n\n11. Ditch harsh shampoos\n\nDavines OI Shampoo amazon.com $35.00 SHOP NOW\n\n“Find a shampoo that is sulfate-free to prevent frizz,” says Rugetti. Shampoos with sulfates can strip and damage your hair over time, which will mess with your hair cuticle and lead to frizz. “My favorite gentle shampoo is —it's super moisturizing and leaves your hair feeling silky,\" she says.\n\n12. Wash with cleansers that contain glycerin\n\nBriogeo Farewell Frizz™ Smoothing Shampoo sephora.com $24.00 SHOP NOW\n\nAlong with cutting out the sulfates, look for a shampoo with glycerin as one of the first ingredients (the closer the ingredients are to the top of the list, the more concentrated they are in the formula). Not only does glycerin help combat frizz by penetrating the hair shaft and hydrating it from the inside out, but it also creates a protective coating on the strand, helping mitigate damage, says celebrity hairstylist Mark Townsend, who works with Elizabeth Olsen, Jennifer Lawrence, and virtually every other celeb you love.\n\n13. Smooth frizz with a rich conditioner\n\nMatrix Biolage Smoothproof Conditioner $20.00 SHOP NOW\n\n“Clients often ask me if they need conditioner, and the answer is absolutely,” says Giovanni Vaccaro, hairstylist and artistic director at Glamsquad. “Conditioner is your number-one weapon in dealing with frizz.” Try Biolage SmoothProof Conditio ne r (Vaccaro's favorite), or . Apply it from mid-shaft down to your ends, keeping it away from your roots, and wait at least five full minutes—yes, really—before rinsing it out.\n\n\n\n14. Deep condition your hair\n\nR+Co Bleu De Luxe Reparative Masque dermstore.com $73.00 SHOP NOW\n\nIf your hair isn’t properly hydrated and moisturized, you’ll have a harder time smoothing frizz with styling products later on, which is why hairstylist Clariss Rubenstein says smoothing frizz starts in the shower. Opt for a smoothing shampoo and conditioner when you wash your hair, and add a deep-conditioning mask that suits your hair needs (whether that's moisturization or restoration) to your routine. Rubenstein's favorite for a silky finish is the , which is low in proteins and contains moisturizing ingredients like tananu, maracuja, and argan oil.\n\n\n\n15. Dry hair with a microfiber hair towel\n\nAquis Lisse Luxe Hair Turban sephora.com $30.00 SHOP NOW\n\nAs you know, your hair is at its most vulnerable state when it’s wet. That means using the wrong towel can literally make (or break) your hair, which is why your fabric choice is that much more important. “Cotton towels create friction with your hair, leading to frizz and breakage,” says Vaccaro. “I love and always recommend to dry your hair—they have a microfiber technology that prevents friction and helps dry hair faster.” You can also use an old T-shirt (Grenia's tip) to wring out any excess water without roughing up the cuticle.\n\n16. Smooth flyaways and wispies with hairspray\n\nAmika Fluxus Touchable Hairspray sephora.com $26.00 SHOP NOW\n\nIf you get flyaways around your hairline and part that are really obvious when wearing a sleek, straight hairstyle, Vaccaro prefers to use hairspray to smooth them instead of oil, as \"these guys need a stronger solution,\" he says. Instead of blasting your hair with a layer of spray, opt for a lighter touch: Spritz a clean toothbrush with hairspray (try ), then brush it over your hairline or part to keep those wisps down.\n\n17. Style with high-quality heat tools to reduce damage\n\nNuMe Megastar X Hair Straightener Tourmaline Flat Iron – 1.75 Inch amazon.com $199.00 $139.30 (30% off) SHOP NOW\n\nAccording to hairstylist Mark Garrison , nothing will seal the cuticle like intense heat from a flat iron, but you also don't want to risk damage for the sake of a smooth cuticle. You may think that your flat iron from 2011 works just fine, but it might actually be causing more damage and frizz than you realize. Hairstylist Jessica Shakir swears by the and recommends it for clients. \"It has this negative ion conditioning technology that seals the hair’s cuticle to keep it smooth,\" she says. “I also spritz a lightweight over damp hair before I use any hot tool to help prevent frizz, and I'll also use it to smooth any flyaways on dry hair later in the day.”\n\n18. Apply leave-in conditioner\n\nAdwoa Beauty Baomint Leave In Conditioning Styler sephora.com $24.00 SHOP NOW\n\nNot to sound like a broken record, but if there's one piece of advice you take away from this article, let it be that moisture is the key to smoothing frizz. “I love to load the hair up with leave-in conditioner while wet to ensure my hair cuticle is filled with nourishing ingredients that will give the hair softness and shine,” says celeb hairstylist and R+Co collective member Marwa Bashir. When the humidity is higher and you need a bit more control, Bashir recommends the , but if you're wanting a silicone-free option, we suggest using the , which is packed with curl- and coil-loving oils.\n\n19. Sleep on a silk pillowcase for smoother hair\n\nSwurly Co. Solid Queen Silk Pillowcases swurlyco.com $65.00 SHOP NOW\n\nIf you're still sleeping on cotton and wake up with frizz, now is officially the time to switch to a silk pillowcase. “Silk really helps protect your hair while you sleep,” says Vaccaro. “It maintains your hair's natural oils, which is especially important if your hair is fragile from chemical treatments.\"\n\nBrooke Shunatona Brooke Shunatona is a contributing writer for Cosmopolitan.com. Ruby Buddemeyer Ruby was the beauty editor at Cosmopolitan, where she covered beauty across print and digital.\n\nThis content is created and maintained by a third party, and imported onto this page to help users provide their email addresses. You may be able to find more information about this and similar content at piano.io", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/antifrizz-shampoo-1646062240.png?crop=1.00xw:1.00xh;0,0&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/flyaways-1583254525.jpg?crop=1xw:1xh;center,top&resize=1200:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/flyaways-1583254525.jpg?crop=0.5xw:1xh;center,top&resize=480:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/flyaways-1583254525.jpg?crop=1xw:1xh;center,top&resize=1200:*", "keywords": [], "authors": ["Brooke Shunatona", "Brooke Shunatona Is A Contributing Writer For Cosmopolitan.Com.", "Ruwas The Beauty Editor At Cosmopolitan", "Where She Covered Beauty Across Print"], "canonical_link": "https://www.cosmopolitan.com/style-beauty/beauty/a33187/how-to-defrizz-your-hair/", "title": "19 Frizzy Hair Hacks and Products for 2021", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=6", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "These 19 Tricks for Smoothing Flyaways Are Lowkey Genius", "description": "Prepare to have your sleekest look yet.", "url": "https://www.cosmopolitan.com/style-beauty/beauty/how-to/a33187/how-to-defrizz-your-hair/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/flyaways-1583254525.jpg?crop=1xw:1xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2021-12-09 04:07:23", "published_time": "2021-12-09 04:07:00", "section": "Beauty", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/flyaways-1583254525.jpg?crop=1xw:1xh;center,top&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "19 Frizzy Hair Hacks and Products for 2021 - How to De-Frizz Hair", "description": "There's nothing wrong with frizz or flyaways, but they can certainly be annoying. We found 19 solutions to help you have your best hair day yet.", "keywords": "frizzy hair, best products for frizzy hair, best shampoo for frizzy hair, best conditioner for frizzy hair, hairstyles for frizzy hair, how to tame frizzy hair", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/flyaways-1583254525.jpg?crop=0.5xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Beauty & Style,style-beauty,beauty,Most Popular,Mark Garrison,Mark Townsend", "sailthru.date": "2021-12-09T16:07:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/flyaways-1583254525.jpg?crop=1xw:1xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/flyaways-1583254525.jpg?crop=0.5xw:1xh;center,top", "sailthru.socialtitle": "These 19 Tricks for Smoothing Flyaways Are Lowkey Genius", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1639019220.0, "source": "https://www.cosmopolitan.com", "summary": ""}