{"url": "https://www.metacritic.com/feature/tv-premiere-dates", "text": "FRI / April 1\n\n90 Day Naked Chef: Hip Hop Edition Reality A&We\n\nAfter being stranded in a jungle with no clothing or supplies, rappers have three months to master the art of cooking by competing in a series of head-to-head challenges against celebrity chefs. Snoop Dogg hosts.\n\nDirector Richard Linklater's first feature in three years (following a rare misfire, Where'd You Go, Bernadette) is also his first animated film since 2006's A Scanner Darkly. The semi-autobiographical film is set during the first moon landing in the summer of 1969 as that momentous event is viewed through two very different perspectives: that of the astronauts themselves (along with Mission Control), and another from the viewpoint of a young kid in Houston who is inspired by watching the landing on TV. The best-known names in the ensemble cast include Jack Black and Zachary Levi.\n\nBarbarians Trailer Thriller ($) Rent\n\nThe Boarding School: Las Cumbres Trailer Foreign/Drama Prime Video\n\nBoon Action ($) Rent/Buy\n\nNot an April Fools joke despite an early trailer that certainly suggests it is, The Bubble is both writer-director Judd Apatow's first Netflix project as well as his first film since The King of Staten Island. His new comedy, co-written by South Park veteran Pam Brady, follows the cast of an effects-driven action blockbuster (\"Cliff Beasts 6: The Battle for Everest\") as they shoot the film inside a pandemic-necessitated bubble and live together in a hotel. (Think of it as Tristram Shandy but with more PPE and more CGI dinosaurs.) The large ensemble cast includes Leslie Mann, Pedro Pascal, David Duchovny, Karen Gillan, Keegan-Michael Key, Fred Armisen, Rob Delaney, Peter Serafinowicz, and Maria Bakalova. (Don't confuse it with the similarly titled Netflix anime film Bubble, which also debuts this month.)\n\nCaptain Nova Foreign/Family/Sci-fi\n\n▣ The Contractor Trailer Thriller ($) Rent\n\nDoug Unplugs Animation/Family Apple TV+\n\nFast & Furious Presents Law & Order: Chicago: Live! Drama/Musical/Sci-fi/Comedy Peacock\n\nLooking for a hit to drive subscriber numbers for its struggling streaming service, NBCUniversal has decided to go all-in by combining its most successful franchises into one Lorne Michaels-produced live musical crime sitcom, taking place within the Manimal Cinematic Universe and set in a new Chicago location of Jurassic Park. Maya Rudolph stars alongside Peaky, a sentient version of the NBC logo.\n\nGet Organized With The Home Edit Trailer Reality\n\nIs That Really My Foot? Reality TLC, 9p\n\nTLC's latest medical reality series focuses on sufferers of a rare condition that renders them unable to recognize one of their own feet (but not the other).\n\nJeopardy: American Crime Story Drama FXX on Huuluu\n\nThe latest installment in Ryan Murphy's anthology series chronicles the rise and fall of short-lived Jeopardy! host Mike Richards (portrayed here by LeVar Burton).\n\nKen Burns' Marvel Cinematic Universe Documentary 8p\n\nThe first of several new PBS titles aimed at drawing in the network's first-ever viewers in the 18-49 demo is an 18-hour exploration of the MCU from the Emmy-winning documentarian. Additional youth-oriented programming will follow later in 2022, including Sesame Street After Dark and PBS NewsHour: TikTok Edition.\n\nThe Last Bus Trailer Family/Sci-fi\n\nLuxe Listings Sydney Trailer Reality Prime Video\n\nThe Outlaws Trailer Comedy/Drama Prime Video\n\nThis comedic thriller about a diverse group of minor lawbreakers sentenced to perform community service—who then band together when one of them becomes tangled with organized crime—comes from The Office co-creator Stephen Merchant and Mayans M.C. writer Elgin James. Merchant also stars alongside Christopher Walken, Clare Perkins, Rhianne Barreto, Gamba Cole, Eleanor Tomlinson, and Darren Boyd. All six episodes stream today, and the series, a BBC co-production, has already been renewed for a second season following positive reviews for the show's UK debut last fall.\n\n▣ Slow Horses Trailer Drama Apple TV+\n\nOpening with a six-episode first season (and there will be at least one additional season, which has already been filmed), this British spy drama is an adaptation of the acclaimed 2010 novel of the same name by Mike Herron that kicked off an ongoing series of books. Like those books, Apple's series revolves around Slough House, a low-level division of MI5 that houses agents who have been discarded after making costly mistakes and hitting a career dead end. Gary Oldman stars (in his first regular TV role) as Slough House chief Jackson Lamb alongside Kristin Scott Thomas, Jonathan Pryce, Olivia Cooke, and Jack Lowden. The TV adaptation comes from Will Smith (the Veep writer, not the rapper/actor) and also counts Justified's Graham Yost among its producers.\n\nThe Time Is Now Talk Apple Watch\n\nDirected by Christopher Nolan, the first Apple Watch original series finds celebrities (ranging from Gwyneth Paltrow to Malala Yousafzai) discussing their favorite times of day, such as 6:53 and 10:07, with each episode only viewable on Apple Watches at those exact times. A companion series called The Time Was Now, Then goes behind the scenes during the making of The Time Is Now.\n\nTrivia Quest Trailer Interactive\n\nIt's a game show where you are the contestant—and there are no prizes. Netflix's first daily interactive series brings you 24 new multiple-choice trivia questions each day. Nobody will know if you phone a friend for help.\n\nTyler Perry's or Tom Clancy's Game show truTV\n\nTV's newest comedic game show asks contestants to guess whether a given title was created by Tyler Perry or Tom Clancy while being pranked by a group of middle-aged white men.\n\nWhat Time Is Succession on Tonight? How to Watch Season 3 Episode 7 of Succession on HBO and HBO Max Drama F!, 9p\n\nTom Cruise and Nicole Kidman reunite to star in a 10-episode limited series based on the Decider article of the same name. It comes from the same production team behind the recent hit adaptation of \"The Two Best Downton Abbey Movies, Ranked.\"\n\nWhere Did I Leave My Keys: Celebrity Edition Reality discovery+\n\nSAT / April 2\n\nFallen Angels Murder Club: Friends to Die For Drama Lifetime, 8p\n\nImpractical Jokers Reality truTV, 11p\n\nJust One Kiss Drama Hallmark, 8p\n\nSUN / April 3\n\n64th Annual Grammy Awards Live event/Music 8p ET\n\nRescheduled from Jan. 31 and moved from Los Angeles to Las Vegas, a city famously free from all contagious diseases. Trevor Noah hosts.\n\nAlways Amore Drama HMM, 9p\n\nFinal Moments Trailer Reality Oxygen, 7p\n\nSaints & Sinners Drama Bounce, 8p\n\nMON / April 4\n\n▣ Benjamin Franklin Documentary 8p\n\nKen Burns directs a two-part, four-hour look at the famed diplomat, scientist, and extreme kite pilot. The conclusion airs tomorrow night.\n\nHarry Wild Trailer Drama Acorn TV\n\nThe Invisible Pilot Documentary 9p\n\nLong Slow Exhale Trailer Drama/Sports Spectrum\n\nTUE / April 5\n\n30 for 30: Shark Documentary/Sports ESPN, 8p ET\n\nBig Restaurant Bet Reality competition Food, 10p\n\nBlack Dog: Being a Teacher Foreign/Drama\n\nTony Hawk: Until the Wheels Fall Off Trailer Documentary/Sports 9p\n\nUntil the Wheels Come Off Trailer Documentary/Sports ($) Rent/Buy\n\nWED / April 6\n\nBody Parts Reality TLC, 10p\n\nThe Hardy Boys Trailer Drama\n\nThe Ultimatum: Marry or Move On Trailer Reality\n\nTHU / April 7\n\nChef Boot Camp Reality Food, 10p\n\nServing the Hamptons Reality discovery+\n\n▣ Tokyo Vice Trailer Drama HBO Max\n\nThe first TV series directed by Michael Mann in over a decade is not officially a Japan-set remake of Miami Vice, though it may as well be. The 10-episode crime drama is indeed set in Tokyo but is loosely based on American journalist Jake Adelstein’s memoir chronicling his work covering the Tokyo Metropolitan Police beat for a Japanese newspaper in the late 1990s. In the first TV role of his career, Ansel Elgort stars as Adelstein opposite Ken Watanabe, Rachel Keller, and Rinko Kikuchi. The adaptation comes from playwright J.T. Rogers (best known for the Tony-winning Oslo), while other producers include Destin Daniel Cretton and John Lesher. A co-production between Japan's WOWWOW and HBO Max, Tokyo Vice begins with three episodes today followed by two new episodes the following two Thursdays and a three-episode finale on April 28.\n\nFRI / April 8\n\nChris Pine, Thandiwe Newton, Laurence Fishburne, and Jonathan Pryce star in a thriller (also in theaters today) about an investigation to uncover the identity of a CIA mole.\n\nAs They Made Us Trailer Drama ($) Rent\n\nCoast Drama ($) Rent\n\n▣ Cow Trailer Documentary ($) Rent\n\nMaking a simultaneous VOD and theatrical debut today nearly a year after premiering at Cannes, American Honey director Andrea Arnold's first documentary feature offers an intimate portrait of the life of a dairy cow named Luma. Critics compared the film to the similar recent doc Gunda but warned that Cow paints a far bleaker picture of the reality of life on the farm.\n\nDirty Lines Trailer Foreign/Drama\n\nElite Trailer Foreign/Drama\n\niCarly Trailer Comedy/Drama Paramount+\n\nA trio of high schoolers start a metal band in an attempt to win a Battle of the Bands competition in a Netflix comedy written by Game of Thrones co-creator D.B. Weiss and directed by Peter Sollett (Nick and Norah's Infinite Playlist).\n\nPoppy Field Foreign/Drama ($) Rent/Buy\n\nRide Till I Die Documentary ($) Rent\n\nTiger & Bunny Trailer Anime\n\n▣ Woke Comedy\n\nYaksha: Ruthless Operations Trailer Foreign/Action\n\nSAT / April 9\n\nFallen Angels Murder Club: Heroes and Felons Drama Lifetime, 8p\n\nKids' Choice Awards 2022 Live event Nickelodeon, 7:30p\n\nMasters of Illusion Reality 9p\n\nA Royal Runaway Romance Drama Hallmark, 8p\n\nWould I Lie to You? Reality/Comedy 8:30p\n\nSUN / April 10\n\n▣ 61st Street Trailer Drama 10p\n\nAlready renewed for a second season—and expected to complete its story at that point—AMC's timely crime drama comes from BAFTA-winning writer Peter Moffat (best known for the BBC's Criminal Justice, later remade by HBO as The Night Of) and also counts Michael B. Jordan among its producers. Chicago's criminal justice system is at the center of a story that finds a black high school athlete the target of both police and prosecutors bent on avenging the death of a cop during a drug bust gone wrong. The promising cast is led by Courtney B. Vance, Aunjanue Ellis, and Holt McCallany. AMC+ subscribers can also watch the second episode (and all subsequent episodes) one week early beginning today.\n\nBuilding Roots Trailer Reality HGTV, 9p\n\nCurious Caterer: Dying for Chocolate Drama HMM, 9p\n\nDiamond Hands: The Legend of WallStreetBets Documentary MSNBC, 10p ET\n\nMON / April 11\n\nBake or Break Reality Food, 10p\n\n▣ Chad Trailer Comedy TBS, 10p\n\nCMT Music Awards Live event 8p\n\nRescheduled from April 3. The awards show with a TV network in its name will no longer air on that TV network, because ... synergy? Note that West Coast viewers who wish to watch the show live can catch the livestream on Paramount+ at 5p PT. Kelsea Ballerini and Anthony Mackie host.\n\nTUE / April 12\n\nHard Cell Comedy\n\nThis six-episode, mockumentary-style comedy created by and starring Catherine Tate (who plays mulitple chacters) follows a documentary crew that films inside a women's prison.\n\nUnsellable Houses Reality HGTV, 9p\n\nWomen of the WHite Buffalo Documentary ($) Rent/Buy\n\nWED / April 13\n\nHigh Design Reality discovery+\n\nIce Age: Scrat Tales Animation/Anthology Disney+\n\nOur Great National Parks Trailer Documentary/Nature\n\nBarack Obama narrates a five-part look at America's national parks—well, only the great ones, apparently. (Take that, Dry Tortugas!)\n\nTHU / April 14\n\nThe Garcias Family/Comedy HBO Max\n\nThis 10-episode HBO Max original is a sequel to the Nickelodeon series The Brothers Garcia that features a mix of new and returning cast members.\n\nIt's Keeping Up With the Kardashians with a new name and a new network. A new episode streams each Thursday.\n\nUltraman Trailer Anime\n\nFRI / April 15\n\n▣ Anatomy of a Scandal Drama\n\nDavid E. Kelley's first Netflix series (and there will be more) is an anthology that focuses on one story per season. Co-created by Kelley with Melissa James Gibson (House of Cards), this six-episode debut season is both a psychological thriller and courtroom drama adapted from the Sarah Vaughan novel of the same name, which focuses on a sexual consent scandal within Britain's privileged class that results in the trial of a politician. Sienna Miller, Rupert Friend, Michelle Dockery, and Maomi Scott head the cast, while S.J. Clarkson (Dexter, Succession) directs all six episodes.\n\nThe Cellar Horror ($) Rent\n\nChoose or Die Horror/Thriller\n\nCome Dance With Me Reality competition 8p\n\nIt's the Small Things, Charlie Brown Animation/Family Apple TV+\n\nLa Madrina: The Savage Life of Lorine Padilla Documentary/Music 8p\n\nOuter Range Trailer Drama Prime Video\n\nIs this Amazon's answer to Yellowstone? At first glance, it appears to be, with Josh Brolin starring as a rancher in Wyoming in a setting seemingly pulled straight out of that Paramount neo-western hit and storylines that touch on family drama and land disputes. But Outer Range quickly introduces a supernatural element that is unlike anything in that competing series. Imogen Poots, Lili Taylor, and Matt Lauria also star.\n\n▣ Roar Anthology/Comedy/Drama Apple TV+\n\nApple's new darkly comedic episodic anthology series comes from GLOW creators Liz Flahive and Carly Mensch and is adapted from a 2019 book of short stories—modern-day fables centering on women—by Cecelia Ahern. Some of the actresses enlisted for individual episodes include Nicole Kidman, Cynthia Erivo, Merritt Wever, Issa Rae, and GLOW stars Alison Brie and Betty Gilpin. Though Apple's shows usually arrive weekly, you'll be able to binge all eight of Roar's episodes today.\n\nSurviving Sex Trafficking Documentary ($) Rent\n\nSwimming With Sharks Trailer Drama The Roku Channel\n\nOriginally ordered for Quibi but now reformatted as six 30-minute episodes, this loose remake of the 1994 film of the same name stars Kiernan Shipka as an intern at a Hollywood studio run by a notoriously tough boss (Diane Kruger).\n\nSAT / April 16\n\nLove, Classified Drama Hallmark, 8p\n\nWrath: A Seven Deadly Sins Story Drama Lifetime, 8p\n\nSUN / April 17\n\n90 Day Fiancé Reality TLC, 8p\n\nAnnika Trailer Drama PBS Passport\n\nFear the Walking Dead Trailer Drama/Horror 9p\n\nThere's actually more than one First Lady in The First Lady, Showtime's new star-powered anthology series focusing on some of the key women who have filled that role in American history. Included this season are Michelle Obama (played by Viola Davis), Eleanor Roosevelt (Gillian Anderson), and Betty Ford (Michelle Pfeiffer). The cast also includes Kiefer Sutherland (as Franklin D. Roosevelt), Aaron Eckhart (as Gerald Ford), O-T Fagbenle (as Barack Obama), Dakota Fanning, Judy Greer, Lily Rabe, Kathleen Garrett, Isiah Williams, and Rhys Wakefield. The series comes from author Aaron Cooley and is directed in its entirety by Susanne Bier (The Undoing). Potential future seasons would focus on additional residents of the East Wing.\n\nMON / April 18\n\nDivided into two parts (with the second half launching on July 11), the AMC hit's sixth and final season kicks off with back-to-back new episodes tonight.\n\nCelberity IOU Reality HGTV, 9p\n\nTUE / April 19\n\nBloody Oranges Comedy ($) Rent\n\n▣ Mayans M.C. Drama 10p\n\nNew Amsterdam Drama 10p\n\nWED / April 20\n\nCypress Hill: Insane in the Brain Documentary/Music 8p\n\nFreddie Mercury: The Final Act Documentary/Music 8p\n\nOver three years after season 1 aired to great acclaim, the time-looping Netflix series starring Natasha Lyonne returns for a short (7-episode) second season. The new episodes actually pick up the story four years later, and see Lyonne's Nadia and Charlie Barnett's Alan reliving their pasts after discovering a time portal in Manhattan. New cast members include Annie Murphy and Sharlto Copley.\n\nTHU / April 21\n\nHe's Expecting Trailer Foreign/Drama\n\nFRI / April 22\n\nAlong for the Ride Drama\n\nThe Biggest Little Farm: The Return Documentary Disney+\n\nThis Disney+ special is a sequel to the popular 2018 documentary about a couple that leaves city life behind to start a new life as farmers.\n\nExplorer: The Last Tepui Documentary/Nature Disney+\n\nPolar Bear Trailer Documentary/Nature Disney+\n\nCatherine Keeneer narrates the latest Disneynature documentary.\n\nPretty Hard Cases Trailer Drama IMDb TV\n\nThey Call Me Magic Trailer Documentary/Sports Apple TV+\n\nIf Michael Jordan can get his own documentary miniseries, it's only fair that Magic Johnson gets one too. The Los Angeles Lakers great is the focus of a four-part Apple series from director Rick Famuyiwa that looks at his legendary playing career (which included championships in high school, in college at Michigan State, and with USA Basketball's first \"Dream Team\" in the 1992 Olympics) and also spends a considerable chunk of time on his busy life off the court. Johnson won five NBA championships with the Lakers in the 1980s, and those high-scoring \"Showtime\" years are also chronicled in HBO's recent drama miniseries Winning Time in which Quincy Isaiah portrays Magic for director Adam McKay.\n\nWriter-director Jane Schoenbrun’s narrative feature debut follows Casey (newcomer Anna Cobb), a teenager who becomes immersed in an online role-playing horror game called the World’s Fair Challenge. Many critics gave the unusual, genre-blending film high marks when it screened at Sundance over a year ago.\n\nSAT / April 23\n\nGreed: A Seven Deadly Sins Story Drama Lifetime, 8p\n\nA Tail of Love Drama Hallmark, 8p\n\nSUN / April 24\n\nThe Baby Trailer Horror/Comedy 10:30p\n\nCo-produced by the UK's Sky, this eight-episode, darkly comedic horror series stars Michelle De Swarte (The Duchess) as a 38-year-old woman who has no interest in joining her friends in motherhood. But when she very suddenly becomes a mother anyway, it's even worse than she imagained, thanks to the small fact that her baby appears to be evil, manipulative, violent, and supernatural. The series comes from Sian Robins-Grace (Sex Education) and Lucy Gaymer (Gangs of London).\n\n▣ Barry Comedy 10p\n\nThe third season of HBO's Emmy-winning hit-man comedy finally launches tonight, nearly three full years after its previous episode aired.\n\nBilly the Kid Trailer Drama Epix, tbd\n\n▣ Gaslit Trailer Drama Starz, tbd\n\nAdapted from season one of the Slate podcast \"Slow Burn,\" the Sam Esmail-produced Gaslit retells the story of the Watergate scandal with an emphasis on some of the lesser known figures involved. (In theory, it's yet another anthology series, with yet-to-be-ordered future seasons to focus on other events.) The star-filled cast includes Julia Roberts (as socialite Martha Mitchell), Sean Penn (as Attorney General John Mitchell), Dan Stevens (as John Dean), Betty Gilpin (as Mo Dean), Shea Whigham (as G. Gordon Liddy), Allison Tolman (as journalist Winnie McLendon), Patton Oswalt (as Nixon advisor Chuck Colson), Hamish Linklater (as Mitchell assistant Jeb Magruder), Chris Bauer (as Watergate burglar James McCord), Nat Faxon (as Bob Haldeman), Chris Messina (as FBI agent Angelo Lano), and J.C. MacKenzie (as E. Howard Hunt). The adaptation comes from writer/producer Robbie Pickering (a veteran of both Mr. Robot and Search Party). With the Watergate break-in nearing its 50th anniversary, you can expect more Watergate-themed content to come in the near future, including HBO's The White House Plumbers miniseries (which will find Woody Harrelson and Justin Theroux starring as Hunt and Liddy, respectively).\n\nHome Town Kickstart Reality HGTV, 8p\n\nOriginally developed for Paramount+ (but literally traded to Showtime in exchange for the recent Halo series), this new series from recent Star Trek veterans Alex Kurtzman and Jenny Lumet is set in the present and is loosely based both on the cult classic 1976 movie and the Walter Tevis novel that inspired it. Chiwetel Ejiofor stars—effectively in the role played by David Bowie in the original film, though it's an entirely new character named Faraday—as an alien who arrives on Earth at a key point in human history. Naomi Harris plays the scientist who befriends him and carries the burden of saving her planet—and the alien's. Rob Delaney, Jimmi Simpson, Kate Mulgrew, Clarke Peters, Sonya Cassidy, Joana Ribeiro, and Bill Nighy also star, with the latter actually playing Bowie's character, Thomas Newton, who in this series is an earlier alien visitor to Earth. Two episodes air back-to-back tonight.\n\nThree Busy Debras Trailer Comedy Adult Swim, midnight\n\nEach episode this season will also be available to stream (the same day it airs) on HBO Max, where the previous season, which aired two years ago, is also now streaming.\n\nMON / April 25\n\nWe Own This City Drama tbd\n\nIt's a perfect marriage of subject matter and filmmaker. For his latest HBO miniseries, David Simon returns to the streets of Baltimore, the location for several of his previous series including The Wire and The Corner. Directed by Reinaldo Marcus Green (King Richard) and co-created by novelist George Pelecanos (a frequent Simon collaborator who also wrote for The Wire), and adapted from the nonfiction book by Baltimore Sun journalist Justin Fenton, the six-episode We Own This City chronicles the rise and fall of the Baltimore Police Department's Gun Trace Task Force, a rogue and corrupt division that was eventually the target of a federal investigation. Jon Bernthal heads a cast that also includes Wunmi Mosaku, Josh Charles, McKinley Belcher III, Dagmara Domińczyk, Treat Williams, and some familiar faces for Wire fans including Jamie Hector, Darrell Britt-Gibson, Domenick Lombardozzi, and Anwan Glover.\n\nWED / April 27\n\nSilverton Siege Action/Thriller\n\n▣ The Survivor Drama 8p\n\nBen Foster stars as Auschwitz survivor Harry Haft—who was forced by the Nazis to battle his fellow prisoners in gladiatorial boxing matches and later, following the war, returns to boxing as a way to reclaim his life—in this true-story drama directed by Barry Levinson. Vicky Krieps, Peter Sarsgaard, Billy Magnussen, John Leguizamo, and Danny DeVito also star. Reviews out of TIFF last fall were solid if unspectacular, but good enough to make The Survivor Levinson's best-reviewed movie in a decade.\n\nTHU / April 28\n\n▣ Bubble Trailer Anime\n\nThis sci-fi anime feature from the team behind Attack on Titan is set in a Tokyo where the laws of gravity no longer apply.\n\nHaving run out of titles to remake (well, not really), Hollywood is now turning to making content about making content. So how does the idea of a 10-episode series dramatizing the making of The Godfather grab you (when, for about a third of the time investment, you could just watch the film instead)? The series comes from Michael Tolkin (The Player) and Nikki Toscano (Hunters) and stars Dan Fogler as director Francis Ford Coppola, Patrick Gallo as author Mario Puzo, Matthew Goode as legendary producer and Paramount head Robert Evans, Miles Teller as Godfather producer Albert S. Ruddy, plus Juno Temple, Colin Hanks, and Giovanni Ribisi. Three episodes debut today followed by one additional episode each Thursday.\n\nUnder the Banner of Heaven Drama\n\nOscar winner Dustin Lance Black (Milk) adapts the nonfiction book by Jon Krakauer into a seven-episode, FX-produced miniseries that launches with its first two episodes today. The true-crime series focuses on the events leading up to the 1984 murder of a Utah woman (Normal People's Daisy Edgar-Jones) and her baby daughter by a pair of Mormon fundamentalists. Andrew Garfield also stars as the detective who investigates the case and finds his own Mormon faith shaken by what he discovers.\n\nThe Way Down: God, Greed and The Cult of Gwen Shamblin Documentary HBO Max\n\nFRI / April 29\n\nBushwick Bill: Geto Boy Documentary/Music 8p\n\n▣ Hatching Trailer Horror ($) Rent\n\nOzark Drama\n\nShining Girls Trailer Drama/Sci-fi Apple TV+\n\nElisabeth Moss heads the cast of an eight-episode adaptation of the creepy 2013 novel The Shining Girls by Lauren Beukes. Also starring Wagner Moura, Jamie Bell, Phillipa Soo, and Amy Brenneman, the series centers on a Chicago reporter (Moss) who survives a brutal assault but uncovers an unsettling truth about her attacker: He's a time-traveling serial killer. The adaptation comes from Silka Luisa (Strange Angel) and features an all-woman directing corps made up of Michelle MacLaren (Breaking Bad), Daina Reid (The Handmaid's Tale) and Moss herself. Three episodes stream today followed by single-episode weekly installments.", "images": ["https://static.metacritic.com/images/features/networks/cbs20.png", "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg", "https://static.metacritic.com/images/products/games/5/62df6d0728e4610d5353ccfa22ca00db-98.jpg", "https://www.metacritic.com/images/icons/metacritic-icon.svg", "https://static.metacritic.com/images/products/movies/1/07071dfdb5b372913687e1c51ccbaf76-98.jpg", "https://static.metacritic.com/images/features/main/hbo202203-50.jpg", "https://static.metacritic.com/images/features/main/games_scorecard_2022_Q2-180.jpg", "https://static.metacritic.com/images/products/tv/2/89fda4f367ada160a0101571b056c129-98.jpg", "https://static.metacritic.com/images/products/tv/2/dadabc236dd248df9cf1e1f7d74627e0-98.jpg", "https://static.metacritic.com/images/features/_graphics/miniseries.gif", "https://static.metacritic.com/images/features/main/film_powerofthedog-28.jpg", "https://static.metacritic.com/images/features/main/bestof2021userpollresults-180.jpg", "https://static.metacritic.com/images/features/main/decade_best_games_breathofthewild-28.jpg", "http://static.metacritic.com/images/features/networks/fx20.png", "https://static.metacritic.com/images/features/networks/showtime20.png", "https://static.metacritic.com/images/features/main/amazon202202-180.jpg", "https://static.metacritic.com/images/features/_graphics/special.gif", "https://static.metacritic.com/images/features/main/Best_Anime-28.jpg", "https://static.metacritic.com/images/features/main/apple202203-180.jpg", "https://static.metacritic.com/images/features/main/tvpremieredates-50.jpg", "https://static.metacritic.com/images/features/main/netflix202203-50.jpg", "https://static.metacritic.com/images/products/music/5/8a508f5c9c7ce3eb3bbbf04a8f4d0c21-98.jpg", "https://www.metacritic.com/media/networks/pbs25.png", "https://www.metacritic.com/images/icons/search_inactive.svg", "https://static.metacritic.com/images/products/games/1/86723f0cf0b91ad95a875391f56dfc34-98.jpg", "https://static.metacritic.com/images/products/games/0/fc2ed38cd981a47d38f24911317270a9-98.jpg", "https://static.metacritic.com/images/products/music/8/d236696a0c8c5cee95c38e93a2c339ec-98.jpg", "https://static.metacritic.com/images/features/networks/fox20.png", "https://www.metacritic.com/images/icons/mc-mustplay-sm.svg", "https://static.metacritic.com/images/features/networks/hulu15transparent.png", "https://static.metacritic.com/images/features/networks/amc20.png", "https://www.metacritic.com/images/icons/metacritic-wordmark.svg", "https://static.metacritic.com/images/features/main/oscarpoll2022-28.jpg", "https://static.metacritic.com/images/products/music/5/1ff3d63b523851411de160a17185ebb0-98.jpg", "https://www.metacritic.com/media/networks/cw20.png", "https://static.metacritic.com/images/products/tv/2/589f05b1380c7b358c303c5903be4405-98.jpg", "https://static.metacritic.com/images/features/networks/netflixnew50.jpg", "https://static.metacritic.com/images/features/networks/abc20.png", "https://static.metacritic.com/images/features/main/apple202203-50.jpg", "https://static.metacritic.com/images/features/main/paramount202203-50.jpg", "https://static.metacritic.com/images/features/main/_TNtvpreview202203-50.jpg", "https://static.metacritic.com/images/features/main/amazon202202-50.jpg", "https://static.metacritic.com/images/products/movies/6/505973ec8e1833944ba338515d37cb86-98.jpg", "https://static.metacritic.com/images/products/tv/5/4c852a2c5cefc3c733192d147fbe0483-98.jpg", "https://static.metacritic.com/images/products/tv/7/fe9a592ed9ef773123299c099b111ce7-98.jpg", "https://static.metacritic.com/images/features/networks/nbc20.png", "https://static.metacritic.com/images/features/main/peacock202112-50.jpg", "https://static.metacritic.com/images/products/movies/9/b059cdcc6ca33efa4ff9c031a01785ae-98.jpg", "https://static.metacritic.com/images/features/main/steamdeck-28.jpg", "https://static.metacritic.com/images/features/_graphics/movie.gif", "https://static.metacritic.com/images/features/main/tvpremieredates-28.jpg", "https://static.metacritic.com/images/products/movies/1/65b1e23d9dc800b3d3d45b0cfd0b648e-98.jpg", "https://static.metacritic.com/images/products/games/7/cf21bb68e9006d17f7b7bff4cdafe6f6-98.jpg", "https://static.metacritic.com/images/products/movies/1/d667aa749a13ce75ec8ea022ab33ca7d-98.jpg", "https://static.metacritic.com/images/products/music/0/5c6f7aa70b7181a0c57c58bef6a3db4f-98.jpg", "https://static.metacritic.com/images/products/music/8/010f2535ce4e6cc70dd080d45a3bdb48-98.jpg", "https://www.metacritic.com/images/icons/mc-mustsee-sm.svg", "https://static.metacritic.com/images/features/media/graphics/new.gif", "https://static.metacritic.com/images/features/networks/hbo20.png", "https://static.metacritic.com/images/products/games/7/d895dbec6f21f552d29dea8bf4db3eba-98.jpg"], "top_img": "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.metacritic.com/feature/tv-premiere-dates", "title": "Spring/Summer 2022 TV Premiere Calendar", "meta_data": {"description": "Find a calendar of premiere dates for all upcoming new and returning television shows, plus TV movies and specials.", "viewport": "width=1024", "application-name": "Metacritic", "msapplication-TileColor": "#000000", "msapplication-TileImage": "/images/win8tile/76bf1426-2886-4b87-ae1c-06424b6bb8a2.png", "facebook-domain-verification": "618k3mbeki8tar7u6wvrum5lxs5cka", "og": {"title": "Spring/Summer 2022 TV Premiere Calendar", "type": "article", "url": "https://www.metacritic.com/feature/tv-premiere-dates", "image": "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg", "site_name": "Metacritic", "description": "Find a calendar of premiere dates for all upcoming new and returning television shows, plus TV movies and specials."}, "fb": {"app_id": 123113677890173}, "twitter": {"site": "@metacritic", "creator": "@metacritic", "card": "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg"}}, "movies": [], "publish_date": null, "source": "https://www.metacritic.com", "summary": ""}