{"url": "https://en.wikipedia.org/wiki/Colin_Jost", "text": "American comedian, actor, and writer\n\nColin Kelly Jost (born June 29, 1982)[1][2] is an American comedian, actor, and writer. He has been a writer for Saturday Night Live (SNL) since 2005 and Weekend Update co-anchor since 2014. He also served as one of the show's co-head writers from 2012 to 2015 and later came back as one of the show's head writers in 2017 alongside Michael Che.[3][4][5][6]\n\nEarly life [ edit ]\n\nColin Jost was born and raised in New York City in the Grymes Hill[7] neighborhood of Staten Island, the elder of two sons (the other being Casey Jost of Impractical Jokers fame).[8][9][10] His mother, Kerry J. Kelly, was the chief medical officer for the New York City Fire Department,[11] and his father, Daniel A. Jost, is a former teacher at Staten Island Technical High School.[12][13] Raised Roman Catholic, he attended Regis High School in Manhattan, where he was the editor of the school newspaper The Owl.[14] He attended Harvard University,[8] majoring in history and literature, with a focus on Russian literature and British literature, and wrote his senior thesis on Vladimir Nabokov. Jost graduated cum laude from Harvard in 2004.\n\nWhile at Harvard, he was president of the Harvard Lampoon.[9][15] He also won $5,250 on a college edition of Weakest Link, but said he did not think he deserved to win.[16]\n\nCareer [ edit ]\n\nAfter graduation, Jost worked as a reporter and copy editor for the Staten Island Advance. He was then hired as a writer for a short-lived Nickelodeon animated show, Kappa Mikey. After he left that job, he sent in a writing packet to NBC's Saturday Night Live, which gave him a writing position in 2005.[8]\n\nFrom 2009 to 2012, Jost was SNL's writing supervisor. He was co-head writer from 2012 to 2015, and regained that status in late 2017.[17] He often collaborates with fellow SNL co-head writer Rob Klein.[18] During the summer hiatus following the 2012–13 season, executive producer Lorne Michaels asked Jost if he could do the Weekend Update feature[8] because co-anchor Seth Meyers would soon be leaving to host Late Night with Seth Meyers. Jost accepted and replaced Meyers on the March 1, 2014, episode.[19] Jost later broke Meyers' record for being the longest anchor in the history of the segment on the October 23, 2021, episode hosted by Jason Sudeikis.\n\nJost names Norm Macdonald as a primary influence for his Update anchor work, as Macdonald's tone was the one Jost grew up with in high school. He also names Tina Fey as an influence.[8] In addition to Weekend Update, Jost made a brief cameo appearance as Ohio Governor John Kasich in a Republican presidential debate sketch.[20] He later portrayed his friend Pete Buttigieg during the 2020 Democratic Party presidential primaries[21][22] and Roger Goodell during the 2021 NFL season.[23]\n\nJost has worked in multiple roles related to comedy. He has performed as a stand-up comedian, appearing on Late Night With Jimmy Fallon, TBS, and HBO.[24] He was selected as a \"New Face\" at the Montréal Just for Laughs festival in 2009,[25] and has since appeared at the Chicago Just for Laughs festival in 2011 and 2012 and the Montréal festival again in 2010 and 2012. Jost has published four \"Shouts and Murmurs\" pieces in The New Yorker magazine and has also contributed to The New York Times Magazine, The Huffington Post, The Staten Island Advance and Radar.[26] He wrote the screenplay of and played a minor role in the 2015 comedy film Staten Island Summer, and he also had a minor role as Paul in the 2016 romcom feature How to Be Single.[27] In January 2016, Jost opened for comedian Liam McEneaney's album recording at The Bell House in Brooklyn.[28] In late 2018, Jost and Green Bay Packers quarterback Aaron Rodgers appeared in an advertising campaign for Izod.[29]\n\nJost, along with Michael Che, appeared on the March 4, 2019, episode of WWE's Monday Night Raw, where both were announced as special correspondents for WrestleMania 35. In the March 4 episode, they got involved in a storyline with wrestler Braun Strowman, which resulted in both Jost and Che becoming participants in the André the Giant Memorial Battle Royal at WrestleMania.[30][31] At the event, Jost and Che went under the ring for the majority of the match and then tried to eliminate Strowman while he was trying to do the same to the Hardy Boyz. Jost attempted to calm the situation by using his therapist, but Strowman chokeslammed him and eliminated the two comedians in quick succession, winning the battle royal.[32]\n\nIn July 2020, Jost released a memoir entitled A Very Punchable Face: A Memoir.[33] The book was well received and appeared on the New York Times Bestseller List.[34]\n\nPersonal life [ edit ]\n\nJost was dorm-mates with 2020 Democratic presidential candidate Pete Buttigieg while the two lived in Leverett House at Harvard.[35] In 2015, Jost donated money to Buttigieg's mayoral reelection campaign.[36][37] Subsequently, during Buttigieg's presidential campaign, Jost portrayed Buttigieg in the 45th season of SNL.[35][38]\n\nJost began a relationship with actress Scarlett Johansson in May 2017.[39] In May 2019, the two were engaged.[40] They married in October 2020, at their New York home.[41] Johansson gave birth to their son Cosmo in August 2021.[42]\n\nColin's brother, Casey Jost, is a writer and a producer for the hidden camera show Impractical Jokers. He also had a role in Staten Island Summer.[14][43]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nBibliography [ edit ]\n\nAwards and honors [ edit ]\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Colin_Jost_at_Citi_Field%2C_2015.jpg/220px-Colin_Jost_at_Citi_Field%2C_2015.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1d/Information_icon4.svg/20px-Information_icon4.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Colin_Jost_at_Citi_Field%2C_2015.jpg/1200px-Colin_Jost_at_Citi_Field%2C_2015.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Colin_Jost_at_Citi_Field%2C_2015.jpg/1200px-Colin_Jost_at_Citi_Field%2C_2015.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Colin_Jost", "title": "Colin Jost", "meta_data": {"generator": "MediaWiki 1.38.0-wmf.25", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Colin_Jost_at_Citi_Field%2C_2015.jpg/640px-Colin_Jost_at_Citi_Field%2C_2015.jpg", "width": 640, "height": 885}, "title": "Colin Jost - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}