{"url": "https://people.com/tv/jersey-shore-ronnie-talks-cheating-sammi-breakup/", "text": "\"I ended up cheating, she found out — I blew it,\" the MTV star said on Thursday's two-hour Family Vacation premiere\n\nJersey Shore's Ronnie Opens Up About Cheating on Sammi — and Her Decision to Skip the Reboot\n\nFew reality show romances have captivated viewers like that of Ronnie Ortiz-Magro and Sammi “Sweetheart” Giancola.\n\nTheir tumultuous on-again, off-again relationship lasted eight years, three of which were captured on the original run of Jersey Shore from 2009-12. Now, the cast is back with a brand new season, Jersey Shore Family Vacation — except for Sammi, 31, who opted out of the reboot to avoid “potentially toxic situations.” (“I’m at a completely different place in my life right now focusing on my businesses and my relationship,” she explained on Instagram.)\n\nGet push notifications with news, features and more.\n\nWell, it’s no surprise that Sammi’s absence was a major focus of Thursday’s two-hour season premiere — with Ronnie, 32, finally opening up about what ultimately tore them apart for good.\n\n“Once we left the shore house, me and Sam decided we were going to take the next step — we moved in with each other,” he explained. “And we were getting towards that stage where it was like, I either have to s— or get off the pot.”\n\n“She gave me a timeline. She was like, I want to get married in six months — and I’m still trying to figure my life out,” he continued. “I got cold feet. I wanted to do the right thing, but there was a part of me that was like, ‘I’m not going to do the right thing.’ So I didn’t do it. I ended up cheating, she found out. I blew it. It’s over.”\n\nIntouch Weekly's \"ICONS & IDOLS Party\" - Inside Ronnie Ortiz-Magro and Sammi “Sweetheart” Giancola in 2013 | Credit: Chris Roque/Getty\n\nAnd Sammi’s not the only one who moved on: At the time the episode was filmed, Ronnie’s girlfriend Jen Harley was seven months pregnant. (The couple welcomed a baby girl Tuesday.)\n\n“It’s not the most ideal situation, but what is?” he said, confiding in his costar Pauly “DJ Pauly D” DelVecchio. “I’ll always be a s—ty husband, I’ll always be a s—ty boyfriend, but I’ll never be a s—ty father.”\n\nAs for how the rest of the cast dealt with Sammi’s decision to skip out on the reunion? Well, Pauly did his best to lighten the mood, bringing in a custom, life-size doll designed to look and talk just like Sammi. (“Rahhhhhnnnn! Staaaaahhhhp!“) But as jokes were inevitably made at Sammi’s expense, Deena Cortese intervened.\n\n“Sam’s my girl,” she said. “We talk all the time, and I told her I wasn’t going to let anybody talk badly about her.”\n\n“Listen, I’ll never say anything bad about her,” said Ronnie. “She’s a great woman, she’s going to make a great mother, a great wife. She is absolutely amazing. She just was not for me.”\n\nWant to keep up on the latest from PEOPLE? Sign up for our daily newsletter to get our best stories of the day delivered straight to your inbox.\n\nRELATED VIDEO: Jersey Shore’s Ronnie Ortiz-Magro Welcomes a Daughter\n\nBut as the episode wore on, tensions between Ronnie and Deena, 30, continued to simmer. Finally, he confronted her about it at the club. (Where else?)\n\n“She’s not here. She’s not our friend. She doesn’t have our backs,” he said. “Because if she did, she’d be here with us. I’m having a motherf—ing kid and I’m still here. What the f— does she got going on that’s more important than me?”\n\n“Why are we still talking about Sam?” said Deena. “He has a pregnant girlfriend at home, and I still clearly he’s still not over her. That’s not good for him.”\n\nEventually, Deena revealed the deeper reason she was harboring resentment towards Ron: After her dad died, he was the only cast member that didn’t reach out to her. She finally confronted him about it, and he apologized.\n\n“When Deena’s dad passed away, I was in a bad place,” he said. “Me and Sam had broken up. I was going through my own personal stuff at the time — depression, or whatever you want to call it. I was dealing with my own issues, and I made a mistake by not reaching out.”\n\njersey shore reunion promo shot 2018 The cast of Jersey Shore Family Vacation | Credit: MTV\n\nOpening up to PEOPLE in this week’s issue, Ronnie admits that not having his ex around did have its upside.\n\n“On the one hand, it sucked because we all started this together so we wanted to end it together,” he says. “But at the same time, it worked out better for me because it was just less drama for the house. Less fighting and bickering. Who really wants to live in a house with their ex? That’s just the most uncomfortable feeling in the world.”\n\nFor more on the Jersey Shore reboot, pick up this week’s issue of PEOPLE, on newsstands Friday\n\n“She’s chosen a path in her life and she closed the door on Jersey Shore,” he added. “That was one chapter in her life, and now she’s opened up another one, and she has a boyfriend and she’s really happy and that’s a decision that she made. And us as a family and as castmates and friends that have known her for so long, we’re just going to support whatever she does.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fron-sam.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2021%2F12%2F03%2Fjennifer-lopez-5.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2021%2F12%2F03%2Fbillie-eilish.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2021%2F11%2F22%2FMGK.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Ftammy-duckworth-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2067'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fjersey-shore.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2021%2F08%2F03%2Frobin-roberts-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fron-sam.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2021%2F12%2F02%2Frita-moreno-marlon-brando-elvis-presley.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2021%2F06%2F03%2Fdemi-lovato.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fron-sam.jpg", "keywords": [], "authors": ["Aurelie Corinthios", "April"], "canonical_link": "https://people.com/tv/jersey-shore-ronnie-talks-cheating-sammi-breakup/", "title": "Jersey Shore: Ronnie Opens Up About Cheating on Sammi", "meta_data": {"viewport": "width=device-width,initial-scale=1", "keywords": "Deena Cortese,Exclusive,Jenni 'JWoww' Farley,Jersey Shore,Mike 'The Situation' Sorrentino,News,Nicole 'Snooki' Polizzi,Pauly DelVecchio,Rollout,Ronnie Ortiz-Magro,Sammi Giancola,Vinny Guadagnino", "news_keywords": "Deena Cortese,Exclusive,Jenni 'JWoww' Farley,Jersey Shore,Mike 'The Situation' Sorrentino,News,Nicole 'Snooki' Polizzi,Pauly DelVecchio,Rollout,Ronnie Ortiz-Magro,Sammi Giancola,Vinny Guadagnino", "description": "\"I ended up cheating, she found out &mdash; I blew it,\" the MTV star said on Thursday's two-hour Family Vacation premiere", "robots": "max-image-preview:large", "og": {"title": "Jersey Shore's Ronnie Opens Up About Cheating on Sammi &mdash; and Her Decision to Skip the Reboot", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/jersey-shore-ronnie-talks-cheating-sammi-breakup/", "description": "\"I ended up cheating, she found out &mdash; I blew it,\" the MTV star said on Thursday's two-hour Family Vacation premiere", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fron-sam.jpg", "width": 2000, "height": 1000}}, "pinterest": {"url": "https://people.com/tv/jersey-shore-ronnie-talks-cheating-sammi-breakup/", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fron-sam.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/jersey-shore-ronnie-talks-cheating-sammi-breakup/", "title": "Jersey Shore's Ronnie Opens Up About Cheating on Sammi &mdash; and Her Decision to Skip the Reboot", "description": "\"I ended up cheating, she found out &mdash; I blew it,\" the MTV star said on Thursday's two-hour Family Vacation premiere", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fron-sam.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}, "url": "https://people.com/tv/jersey-shore-ronnie-talks-cheating-sammi-breakup/"}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}