{"url": "https://en.wikipedia.org/wiki/List_of_most_streamed_songs_on_Spotify#100_most_streamed_songs", "text": "A list of most-streamed songs on Spotify\n\nThe following list contains the top 100 songs with the most streams on the audio streaming platform Spotify. As of February 2022, all of the top 100 songs have exceeded 1.2 billion streams, of which 12 have reached 2 billion streams, with Ed Sheeran's \"Shape of You\" ranked in the top position, as the only song that exceeds 3 billion streams.[1][2][3] Justin Bieber and Post Malone have the most songs in the top 100 with 6 entries each.\n\nPrior to February 2014, Spotify's most-streamed song was \"Radioactive\" by Imagine Dragons;[4] it was overtaken by Avicii's \"Wake Me Up\", which became the first song to hit 200 million streams on 27 February 2014.[5] \"Wake Me Up\" held the streaming record for over a year before being surpassed on 22 May 2015 by Sheeran's \"Thinking Out Loud\", which became the first song to hit 500 million streams on 12 October 2015.[6] A month later, however, it was surpassed by Major Lazer and DJ Snake's \"Lean On\", featuring MØ,[7] which held the streaming record for 11 months until Drake's \"One Dance\", featuring Wizkid and Kyla, overtook it on 18 October 2016.[8] \"One Dance\" became the first song to hit 1 billion streams on 12 December 2016,[9] and held the streaming record for almost a year before being surpassed by Ed Sheeran's \"Shape of You\" on 21 September 2017.\n\n100 most-streamed songs [ edit ]\n\nThe following table lists the top 100 most-streamed songs on Spotify, with streams rounded to the nearest million, as well as the artist(s) and the date it was originally published.\n\n\n\n\n\nArtists with the most songs in the top 100 [ edit ]\n\nThis is a list of artists with the most songs in the top 100. It includes an artist's solo and featured songs (where the artist is officially credited). Post Malone and Justin Bieber lead the list with 6 tracks.\n\nHistorical most-streamed songs [ edit ]\n\nThe following table lists the last six songs to become Spotify's most-streamed song, from 2013 to the present.\n\nCurrent record\n\nMilestones and achievements for songs [ edit ]\n\nWeekly number-one songs [ edit ]\n\nThe following table lists the songs that reached the No. 1 position on Spotify's weekly most-played chart. The table records the No. 1 song starting from issue date 29 December 2016 as the data before that said date is not available on the Official Spotify Weekly Charts.[31] \"Heat Waves\" by Glass Animals is the current number-one song on the Spotify Global Top 200 for the week ending 10 March 2022.\n\nCurrent record\n\nMost-streamed songs in a single day [ edit ]\n\nThe following table lists the 20 songs to get the most streams in a single day, as registered on Spotify Global Daily chart.[84]\n\nMost-streamed songs in a single week [ edit ]\n\nThe following table lists the top 20 most-streamed in a single week, as registered on the Spotify Global Weekly chart.[97]\n\nLongest-running number-one songs by days [ edit ]\n\nThe following table lists the 20 songs with the most days at No. 1 on the Global Spotify Chart.[97]\n\nMilestones and achievements for albums [ edit ]\n\nHistorical most first-day album streams [ edit ]\n\nThe following table lists records to become Spotify's most streamed album in its opening day globally, from 2015 to the present.\n\nCurrent record\n\nIncludes song(s) with over 1 billion streams\n\nSee also [ edit ]\n\nNotes [ edit ]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Spotify_logo_with_text.svg/100px-Spotify_logo_with_text.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/12_-_Ed_Sheeran.jpg/190px-12_-_Ed_Sheeran.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Justin_Bieber_in_Rosemont%2C_Illinois_%282015%29.jpg/171px-Justin_Bieber_in_Rosemont%2C_Illinois_%282015%29.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/f/f8/12_-_Ed_Sheeran.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Post_Malone_%2828150750483%29.jpg/163px-Post_Malone_%2828150750483%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/f/f8/12_-_Ed_Sheeran.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_most-streamed_songs_on_Spotify", "title": "List of most-streamed songs on Spotify", "meta_data": {"generator": "MediaWiki 1.38.0-wmf.25", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/12_-_Ed_Sheeran.jpg/640px-12_-_Ed_Sheeran.jpg", "width": 640, "height": 960}, "title": "List of most-streamed songs on Spotify - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}