{"url": "https://www.independent.co.uk/news/people/tom-daley-father-dustin-lance-black-husband-baby-birth-lgbt-surrogate-robert-ray-a8424351.html", "text": "British diver Tom Daley and his husband Dustin Lance Black have become parents.\n\nThe celebrity couple revealed the birth of their son, Robert Ray, in a notice printed in The Times, the same newspaper in which they announced their 2015 engagement.\n\n\"On 27th June 2018 to Thomas Robert Daley and Dustin Lance Black, a son, Robert Ray,\" it read.\n\nThe couple had revealed they were expecting a child through a surrogate on Valentine's Day, and said they did not know who the biological father would be after fertilising \"half the eggs each\".\n\nThe three-time world champion diver has also said he wants to be as good a dad as his father, who was also called Robert and died in 2011.\n\nDaley spoke of how impending fatherhood changed his perspective as he competed at the Commonwealth Games on the Gold Coast in April.\n\nHe said: “It's been such a crazy experience. It changes your outlook on life.\n\n✕ Tom Daley and his husband have revealed that they’re expecting their first child together\n\n“Even on a plane. I'm never scared of flying - and as soon as there was any turbulence I was like 'oh my God', because there's more than my life I have to care about now.\n\n“It made me feel a bit more nervous. It changes your perspective on absolutely everything.\n\n“It's all filled with excitement, getting everything ready, feeling like you don't really know what's going to happen.\n\nUK news in pictures Show all 50 1 /50 UK news in pictures UK news in pictures 11 March 2022 Members of the Royal Navy march through Portsmouth during a Royal Navy Freedom of the City parade PA UK news in pictures 10 March 2022 A woman walks miniature poodles into the first day of the Crufts Dog Show at the Birmingham National Exhibition Centre PA UK news in pictures 9 March 2022 A visitor looks at the piece of art called \"Myth Explored, explained and exploded\" dated of 1993, during a press visit of the exhibition \"Natural History\" dedicated to British artist Damien Hirst and his formaldehyde sculptures at the Gagosian Kings Cross gallery, in London AFP via Getty Images UK news in pictures 8 March 2022 MPs giving a standing ovation to Ukraine's President Volodymyr Zelensky after he speaks to them by live video-link in the House of Commons, in London UK PARLIAMENT/AFP via Getty Images UK news in pictures 7 March 2022 A mural of Ringo Starr, commissioned by Liverpool artist John Culshaw, is unveiled on the gable end of the Empress Pub on Admiral Street in Toxteth, Liverpool PA UK news in pictures 6 March 2022 Cars make their way along the flooded A1101 in Welney in Norfolk PA UK news in pictures 5 March 2022 People hold placards as they take part in a protest against the Russian invasion of Ukraine, in Trafalgar Square, London AP UK news in pictures 4 March 2022 Volunteers help sort through fresh donations after more than 500 boxes of essential supplies were gathered by Parenting Network at Portsmouth Guildhall PA UK news in pictures 3 March 2022 Commuters wait to get on a bus near Liverpool Street Station as all London Underground lines are suspended after thousands of workers began strike action in London EPA UK news in pictures 2 March 2022 Rend Platings and her husband Michael outside their home in Cambridge, which they have painted in the colours of the Ukraine flag in a show of support for friends in the country PA UK news in pictures 1 March 2022 Players take part in the Royal Shrovetide Football Match in Ashbourne, Derbyshire, which has been played in the town since the 12th century PA UK news in pictures 28 February 2022 Donations at the Klub Orla Bialego (White Eagle Club) in Balham, south London, made by members of the public, prior to their aid convoy setting off to Ukraine in aid of refugees fleeing the Russian invasion PA UK news in pictures 27 February 2022 People protest in front of the National Gallery in London against Russia’s massive military operation in Ukraine Reuters UK news in pictures 26 February 2022 The Duke and Duchess of Cambridge and Prince George in the stands during the Guinness Six Nations match at Twickenham Stadium, London PA UK news in pictures 25 February 2022 People head to St Mary’s Cathedral to light candles after a demonstration outside the Russian Consulate General in Edinburgh, following the Russian invasion of Ukraine PA UK news in pictures 24 February 2022 People protest against the Russian invasion on Ukraine outside Downing Street in London EPA UK news in pictures 23 February 2022 Swimmers from Hampstead Ponds cross the road in their swimming costumes outside the Royal Courts of Justice, London, as they await the result of a judicial review brought by Christina Efthimiou over whether the charges for bathing at the ponds in Hampstead Heath unlawfully discriminate against disabled people PA UK news in pictures 22 February 2022 Runners line up for the start of The Anshin Security Conditional Jockeys’ Handicap Hurdle at Taunton Racecourse Getty UK news in pictures 21 February 2022 Shoes on display at the ROKER AW22 presentation at London Fashion Week, in London EPA UK news in pictures 20 February 2022 The waters of the River Severn in edge towards homes in Ironbridge, Shropshire, as more wet and windy weather is set to sweep the UK. Storm Franklin is set to strike the UK just days after Storm Eunice destroyed buildings and left 1.4 million homes without power PA UK news in pictures 19 February 2022 Damaged caused to home of Dominic Good, in Stondon Massey, near Brentwood, Essex, after a 400-year-old oak tree in his garden was uprooted by Storm Eunice. PA UK news in pictures 17 February 2021 Activists from the People for the Ethical Treatment of Animals (PETA) protest against the use of feathers in clothing, ahead of London Fashion Week Reuters UK news in pictures 16 February 2022 Waves crashing on the seafront at Blackpool before Storm Dudley hits the north of England PA UK news in pictures 15 February 2022 Hailey Duff, left, Vicky Wright, centre and Jennifer Dodds in action for Great Britsin during their women’s curling round robin match against Japan at the Beijing Winter Olympics. Team GB sealed a 10-4 victory Reuters UK news in pictures 14 February 2022 Members of the Household Cavalry walk past Wellington Arch and a large inflatable heart, on Valentine's Day in London Reuters UK news in pictures 13 February 2022 People in costume attend the Whitby Steampunk Weekend in Yorkshire PA UK news in pictures 12 February 2022 People in Parliament Square, London, take part in the People's Assembly nationwide protest about cost of living crisis PA UK news in pictures 11 February 2022 Romney sheep graze the grass around the dormant vines at Nyetimber's Manor Vineyard at West Chiltington in West Sussex. The herd from a local farm form part of Nyetimber's sustainability program and are utilised for vineyard maintenance, keeping the grass low, reducing the risk of frost, maintaining grass leys on the estate and saving the cost of fuel for mowing PA UK news in pictures 10 February 2022 Alice Wyllie looks at projections featuring details of some of the illustration plates during the press view for Audubon's Birds of America exhibition at the National Museum Of Scotland, Edinburgh PA UK news in pictures 9 February 2022 New arrival Upendi and mother Cheka in the bonobo enclosure at Twycross Zoo, Leicestershire PA UK news in pictures 8 February 2022 Workers move a crate containing Season's Greetings by street artist Banksy from a retail unit at Ty'r Orsaf, Port Talbot, prior to its journey to a temporary storage unit at an undisclosed location PA UK news in pictures 7 February 2022 Dog walkers enjoy the early morning sunrise at Tynemouth Beach in North Tyneside, on the north east coast of England PA UK news in pictures 6 February 2022 A Leicester City invades the pitch as Nottingham Forest celebrate scoring their side’s third goal of the game during the Emirates FA Cup fourth round match at the City Ground, Nottingham PA UK news in pictures 5 February 2022 Stadium staff remove a flare from the pitch during the Emirates FA Cup fourth round match at Selhurst Park PA UK news in pictures 4 February 2022 \"The Nuba Survival\" is a five-metre-tall statue of two skeletons locked in an embrace in Checkendon, Oxfordshire. The statue was created by local artist John Buckley PA UK news in pictures 3 February 2022 Kew horticulturists attending to the ‘Rising sun’ display at the Kew Orchid Festival: Costa Rica, at the Royal Botanic Gardens in Kew, west London PA UK news in pictures 2 February 2022 Protesters campaign against corruption in London EPA UK news in pictures 1 February 2022 Lorries queue for the Port of Dover in Kent, as the Dover TAP is enforced due to the high volume of lorries waiting to cross the Channel PA UK news in pictures 31 January 2022 Nelson Beaumont-Laurencia applies finishing touches to a sculpture of a tiger, commissioned by Manchester Business Improvement District to celebrate the Chinese New Year, is unveiled in St Ann’s Square PA UK news in pictures 30 January 2022 A house on Overhill terrace in Gateshead, lost its roof on 29 January after strong winds from Storm Malik battered northern parts of the UK PA UK news in pictures 29 January 2022 A newly painted bicycle sign is seen on the middle of the road at Westminster Bridge, as the new Highway Code rules start today together with giving pedestrians priority at junctions Reuters UK news in pictures 28 January 2022 School children take part in a rally in support of British Sign Language becoming a recognised language in the UK, outside the Houses of Parliament, Westminster, as the British Sign Language Private Members’ Bill, introduced by Rosie Cooper MP, reaches its second reading in the House PA UK news in pictures 27 January 2022 A rare six-week-old southern white rhino calf called Zawadi, explores her paddock for the first time at Africa Alive! in Lowestoft PA UK news in pictures 26 January 2022 British Prime Minister Boris Johnson jogs with his dog Dilyn, in London REUTERS UK news in pictures 25 January 2022 A member of staff looks at Francis Bacon’s work ‘Second Version of Triptych 1944’ on display in the Francis Bacon: Man and Beast exhibition at the the Royal Academy of Arts in London PA UK news in pictures 24 January 2022 Rowers (front to back) Charlotte Irving, Kat Cordiner and Abby Johnston, on their way to shatter the world record for rowing across the Atlantic PA UK news in pictures 23 January 2022 A grey seal pup on the beach at Horsey Gap in Norfolk, as the pupping season draws to a close at one of the UK’s most important sites for the mammals PA UK news in pictures 22 January 2022 Participants prepare to take part in the Crisis icebreaker cold water challenge at Tooting Bec Lido in London EPA UK news in pictures 21 January 2022 Willesborough Windmill, a white smock mill built in 1869 is bathed in the morning sunshine as the moon sets behind in Ashford, Kent PA UK news in pictures 20 January 2022 A jet skier jumps the waves off the coast at Blyth in Northumberland PA\n\n“The fear of what might happen and the excitement. There's so many emotions that come with being an expectant father.”\n\nDaley and Black also announced their engagement in a similarly understated way in 2015, with an announcement reading: “The engagement is announced between Tom, the son of Robert and Debra Daley of Plymouth, and Lance, son of Jeff Bisch of Philadelphia and Anne Bisch of Lake Providence.”\n\nBlack, 44, is an American film director and producer. He won an Oscar for best original screenplay for Milk, a film based on the life of gay rights activist and politician Harvey Milk.\n\nAdditional reporting by Press Association.", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/02/14/14/tom-daley-dustin-lance-black.jpg?quality=75&width=982&height=726&auto=webp", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/02/14/14/tom-daley-dustin-lance-black.jpg?quality=75&width=1200&auto=webp", "https://www.independent.co.uk/img/comments/spinner_on_white.gif"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/02/14/14/tom-daley-dustin-lance-black.jpg?quality=75&width=1200&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.independent.co.uk/news/people/tom-daley-father-dustin-lance-black-husband-baby-birth-lgbt-surrogate-robert-ray-a8424351.html", "title": "Tom Daley and husband Dustin Lance Black release first photos of their baby boy", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, user-scalable=no, minimum-scale=1.0, maximum-scale=1.0", "description": "Couple revealed they were expecting child through surrogate", "theme-color": "#EC1A2E", "amp-google-client-id-api": "googleanalytics", "robots": "max-image-preview:large", "fb": {"app_id": 235586169789578, "pages": "https://www.facebook.com/TheIndependentOnline"}, "category": "People", "sitename": "The Independent", "page path": "/news/people", "page type": "Article", "adPageType": "Article Page", "og": {"locale": "en_GB", "updated_time": "2018-06-30T14:05:00.000Z", "site_name": "The Independent", "title": "Tom Daley and husband Dustin Lance Black release first photos of their baby boy", "url": "https://www.independent.co.uk/news/people/tom-daley-father-dustin-lance-black-husband-baby-birth-lgbt-surrogate-robert-ray-a8424351.html", "type": "article", "description": "Couple revealed they were expecting child through surrogate", "image": {"identifier": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/02/14/14/tom-daley-dustin-lance-black.jpg?quality=75&width=1200&auto=webp", "secure_url": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/02/14/14/tom-daley-dustin-lance-black.jpg?quality=75&width=1200&auto=webp"}}, "article": {"published_time": "2018-06-30T14:05:00.000Z", "modified_time": "2018-06-30T14:05:00.000Z", "section": "News", "subsection": "People", "author_name": "Tom Embury-Dennis", "content_type": "story", "word_count": 473, "image_count": 1, "embed_count": 4, "video_count": 1, "internal_link_count": 4, "external_link_count": 0}, "date": "2018-06-30T14:05:00.000Z", "google-signin-client_id": "329250492844-uqochn2f1j5ljkshuap5gc7qphf1refj.apps.googleusercontent.com", "twitter": {"title": "Tom Daley and husband Dustin Lance Black release first photos of their baby boy", "site": "@Independent", "card": "summary_large_image", "description": "Couple revealed they were expecting child through surrogate", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/02/14/14/tom-daley-dustin-lance-black.jpg?quality=75&width=1200&auto=webp"}, "keywords": "Tom Daley,Dustin Lance Black,Internal"}, "movies": [], "publish_date": 1530367500.0, "source": "https://www.independent.co.uk", "summary": ""}