{"url": "https://www.elle.com/fashion/celebrity-style/g19738646/all-met-gala-2018-celebrity-dresses-red-carpet/", "text": "Should You Tell Your Doctor They Made A Mistake?\n\n24 Best Vitamin C Serums For Glowing Skin\n\n7 Shoe Trends That Have Us Excited for Spring\n\nSee All the Looks from the 2018 Met Gala\n\nEvery item on this page was chosen by an ELLE editor. We may earn commission on some of the items you choose to buy.\n\nGetty Images Celebrities attend fashion prom, aka the 2018 Met Gala, in their interpretation of this year's theme, Heavenly Bodies: Fashion and the Catholic Imagination. The exhibit focuses on religious iconography and influence in fashion. Here, what everyone is wearing, from Blake Lively to Amal Clooney. View Gallery 125 Photos Getty Images 1 of 125 Lily Aldridge In Ralph Lauren, Jimmy Choo sandals and Bvlgari jewels. Getty Images 2 of 125 Pharrell Williams and Helen Lasichanh Both in Chanel. Getty Images 3 of 125 Emilia Clarke In Dolce & Gabbana with Christian Louboutin shoes. Getty Images 4 of 125 Selena Gomez In Coach with Platinum by Tiffany & Co. jewelry. Getty Images 5 of 125 Issa Rae In Michael Kors with Stuart Weitzman sandals. Getty Images 6 of 125 Blake Lively In Versace with Christian Louboutin shoes. Getty Images 7 of 125 Wiz Khalifa In Dior Homme Getty Images 8 of 125 Letitia Wright In Coach with Forevermark Diamonds. Getty Images 9 of 125 Lewis Hamilton In Tommy Hilfiger. Getty Images 10 of 125 Zendaya In Versace, with Jimmy Choo sandals and Platinum by Tiffany & Co. jewelry. Getty Images 11 of 125 Ruth Negga In Louis Vuitton. Getty Images 12 of 125 Migos In Versace Getty Images 13 of 125 Darren Criss In Dolce & Gabbana. Getty Images 14 of 125 Emily Ratajkowski In Marc Jacobs with Jimmy Choo sandals. Getty Images 15 of 125 Solange In Iris van Herpen, with heels and bag by Brother Vellies. Getty Images 16 of 125 Kim Kardashian In Versace Getty Images 17 of 125 Tessa Thompson In Thom Browne with Platinum by Tiffany & Co. jewelry. Getty Images 18 of 125 Cardi B In Moschino. Getty Images 19 of 125 Jeremy Scott In Moschino. Getty Images 20 of 125 Evelyn McGee-Colbert and Stephen Colbert Evelyn McGee-Colbert in Christian Siriano. Getty Images 21 of 125 Cara Delevingne In Dior Haute Couture with Noudar jewels. Getty Images 22 of 125 Idris Elba and Sabrina Dhowre Idris Elba in Givenchy Haute Couture. Getty Images 23 of 125 Georgina Bloomberg Getty Images 24 of 125 Nicki Minaj In Oscar de la Renta with Le Silla shoes and Platinum by Tiffany & Co. jewelry. Getty Images 25 of 125 Liu Wen In Michael Kors with Chanel Fine Jewelry. Getty Images 26 of 125 Mary J. Blige In Versace with L’Dezen by Payal Shah earrings. Getty Images 27 of 125 Mary-Kate and Ashley Olsen Both in vintage Paco Rabane Getty Images 28 of 125 Yara Shahidi In Chanel Couture with Christian Louboutin shoes. Getty Images 29 of 125 Madonna In Jean Paul Gaultier with Narcisa Pheres jewels. Getty Images 30 of 125 Travis Scott and Kylie Jenner Both in custom Alexander Wang. Kylie Jenner in Platinum by Chopard earrings. Travis Scott in Christian Louboutin shoes. Next The Sexiest Met Gala Looks of All Time Advertisement - Continue Reading Below\n\nThis content is created and maintained by a third party, and imported onto this page to help users provide their email addresses. You may be able to find more information about this and similar content at piano.io", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/elle-met-gala-2018-all-the-looks-1525743289.jpg?crop=1.00xw:1.00xh;0,0&resize=480:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-955754820-1525742461.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-955769648-1525742404.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/elle-met-gala-2018-all-the-looks-1525743289.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-955835828-1525881232.jpg?crop=1xw:1xh;center,top&resize=480:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/elle-met-gala-2018-all-the-looks-1525743289.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.elle.com/fashion/celebrity-style/g19738646/all-met-gala-2018-celebrity-dresses-red-carpet/", "title": "See All the Looks from the 2018 Met Gala", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=6", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "ELLE", "title": "See All the Looks from the 2018 Met Gala", "description": "What everyone is wearing for fashion's biggest night of the year.", "url": "https://www.elle.com/fashion/celebrity-style/g19738646/all-met-gala-2018-celebrity-dresses-red-carpet/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/elle-met-gala-2018-all-the-looks-1525743289.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "modified_time": "2018-05-11 08:59:35", "published_time": "2018-05-07 10:03:00", "section": "Celebrity Style 2022", "opinion": "false"}, "twitter": {"site": "@ELLEmagazine", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/elle-met-gala-2018-all-the-looks-1525743289.jpg?crop=1.00xw:1.00xh;0,0&resize=640:*"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "title": "All Met Gala 2018 Dresses - Met Gala Red Carpet Celebrity Looks", "description": "Met Gala 2018 is starting now, and celebrities are making their appearance on the red carpet. Here, what everyone is wearing, from Blake Lively to Amal Clooney.", "keywords": "met gala, met gala 2018 dresses, met gala red carpet, met gala red carpet dresses 2018, who attended met gala, met gala 2018, met gala 2018 red carpet", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/elle-met-gala-2018-all-the-looks-1525743289.jpg?crop=0.502xw:1.00xh;0.250xw,0&resize=320:*", "sailthru.contenttype": "gallery", "sailthru.tags": "Fashion,fashion,celebrity-style,met gala 2018 dresses,met gala red carpet,met gala red carpet dresses 2018,met gala", "sailthru.date": "2018-05-07T22:03:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/elle-met-gala-2018-all-the-looks-1525743289.jpg?crop=1.00xw:1.00xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/elle-met-gala-2018-all-the-looks-1525743289.jpg?crop=0.502xw:1.00xh;0.250xw,0", "sailthru.socialtitle": "See All the Looks from the 2018 Met Gala", "sailthru.excerpt": "Celebrities attend fashion prom, aka the 2018 Met Gala, in their interpretation of this year's theme, Heavenly Bodies: Fashion and the Catholic Imagination. The exhibit focuses on religious iconography and influence in fashion. Here, what everyone is wearing, from Blake Lively to Amal Clooney."}, "movies": [], "publish_date": 1525680180.0, "source": "https://www.elle.com", "summary": ""}