{"url": "https://www.teenvogue.com/story/dynasty-cw-fashion-interview-cast-wardrobe-stylist", "text": "Another thing that’s important for Markworth-Pollack and the cast is to celebrate designers of color and emerging brands. “I started out in New York and my BFF and roommate for years was a fashion designer,” the costume designer revealed. “I saw the struggle of it all firsthand and how much it takes, so I love supporting up-and-coming designers. I love the Marc Jacobs and Tom Fords, but I also love newer names. Nathalie also wanted to support Latino designers, as she’s Peruvian and her character Cristal is Venezuelan. Johanna Ortiz and Juan Carlos Obando are in our lineup constantly, as are a couple of Mexican designers whose pieces we’ll be using soon. Nathalie believes that Cristal would be the kind of person who would do that and I agree. She has money now and wants to give back and show that support.”\n\nInstagram content This content can also be viewed on the site it originates from.\n\nFallon on the other hand is a reflection of the modern-day woman in Markworth-Pollack’s eyes. “She’s more outrageous,” she stated of the revamped character, played by Elizabeth Gillies. “Her colors have a little bit more of a punch and she’s definitely more structured. But one thing I’ve wanted to do with her is to not define her style to just one thing. She’s really versatile and that’s a total reflection of the modern woman. We can be one thing one day and someone else the next.” Balmain, Saint Laurent, Alexandre Vauthier, and Marc Jacobs are on her style agenda for the season.\n\nFor Gillies, working on Dynasty has been a fashion education in the truest sense. “I’m learning about brands and the history of fashion and things that are coming back,” she stated. “When I go home now, I don’t want anything in my closet! I’m currently rebuilding it. And I used to go into stores that were mid-level and affordable and I’d buy a lot. Now, I’ll take that money and wait until high-end things go on sale. I’m working on building a timeless closet now.” But she acknowledges the fact that her character, Fallon wants to make a bold statement and turn heads wherever she goes. “No one who walks down the street in clothes like this will go unnoticed,” Gillies confessed. “You’ll get at least one ‘slay’ a day and it makes sense because she’s killing it. It has made me want to take more risks for sure. I have a better eye and can pinpoint designers now: I was never able to do that before.”\n\nInstagram content This content can also be viewed on the site it originates from.\n\nAnd the guys have just as much fun with style as the ladies do. Though Sam Adegoke (who plays Jeff Colby) wasn’t working on the day he visited the set, he showed up clad in a bold Paul Smith shirt. “My wardrobe is the most amazing on the show and I don’t think that’s even up for debate,\" he boasted. \"I recently went to Gucci for a custom look. A few different suits to the tune of like $50K. Jeff has some bright suits on.\" It was all about trusting Markworth-Pollack and her vision. \"Meredith said, 'Just trust me. I got you,'\" he divulged. \"It made me want to experiment more with color in my personal life. I do because I’m from Nigeria, where our traditional West African clothing is very bright.”\n\nInstagram content This content can also be viewed on the site it originates from.\n\nAdegoke isn’t the only guy in the cast who has fun with the wardrobe, as Rafael de la Fuente (formerly of Empire fame) has some of the boldest looks on the show with his character, Sammy Jo. “When I read the character and was in the process of creating the character after I got the role, I for some reason thought of George Michael’s aesthetic for the character,” he revealed about the background behind his character’s vibrant ensembles. “I had been going through a '90s phase and [gravitated toward] that look: denim, leather jackets, and stuff. I’m a huge George Michael fan, of course, but that link sort of just happened. I thought of his aesthetic for the character and I discussed it with Meredith.”", "images": ["https://assets.teenvogue.com/photos/59fc85e152e9dc2ff73f6eca/16:9/w_2560%2Cc_limit/TCDDYNA_EC025.jpg", "https://assets.teenvogue.com/photos/59fc8c9070ae4e37c2ec6434/master/w_1600%2Cc_limit/TCDDYNA_EC022.jpg", "https://www.teenvogue.com/verso/static/teen-vogue/assets/logo-header.a32c5f649a1140996fd12f4a5ee1d0638ce23dc6.svg", "https://assets.teenvogue.com/photos/59fc8d1e545af946d5bbde0d/16:9/w_1280,c_limit/dynasty-fb.jpg", "https://www.teenvogue.com/verso/static/teen-vogue/assets/logo-reverse.c9fd2ea81f6f84a7d604882e3d5f7ab119aeee5a.svg"], "top_img": "https://assets.teenvogue.com/photos/59fc8d1e545af946d5bbde0d/16:9/w_1280,c_limit/dynasty-fb.jpg", "keywords": [], "authors": ["Condé Nast", "Faith Cummings"], "canonical_link": "https://www.teenvogue.com/story/dynasty-cw-fashion-interview-cast-wardrobe-stylist", "title": "Dynasty Fashion: An Interview With the Cast and Wardrobe Stylist", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "width=device-width, initial-scale=1", "referrer": "no-referrer-when-downgrade", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2022", "description": "In an exclusive interview with the cast and wardrobe stylists, Teen Vogue explores how the new CW show Dynasty is promoting diversity through fashion.", "id": "59f4ab4b2713a8783ea56707", "keywords": "dynasty,meredith markworth-pollack,the cw,elizabeth gillies,rafael de la fuente,nathalie kelly,sam adegoke", "news_keywords": "dynasty,meredith markworth-pollack,the cw,elizabeth gillies,rafael de la fuente,nathalie kelly,sam adegoke", "robots": "index, follow, max-image-preview:large", "content-type": "article", "parsely-post-id": "59f4ab4b2713a8783ea56707", "parsely-metadata": "{\"description\":\"In an exclusive interview with the cast and wardrobe stylists, Teen Vogue explores how the new CW show Dynasty is promoting diversity through fashion.\",\"image-16-9\":\"https://assets.teenvogue.com/photos/59f4ac662713a8783ea56709/16:9/w_1000,c_limit/DYN101b_0175b.jpg\",\"image-1-1\":\"https://assets.teenvogue.com/photos/59f4ac662713a8783ea56709/1:1/w_1000,c_limit/DYN101b_0175b.jpg\"}", "og": {"description": "'Dynasty' is celebrating diversity through fashion.", "image": "https://assets.teenvogue.com/photos/59fc8d1e545af946d5bbde0d/16:9/w_1280,c_limit/dynasty-fb.jpg", "site_name": "Teen Vogue", "title": "The '80s Version of 'Gossip Girl' Is Back, and Making an Effort to Promote Designers of Color", "type": "article", "url": "https://www.teenvogue.com/story/dynasty-cw-fashion-interview-cast-wardrobe-stylist"}, "article": {"content_tier": "free", "opinion": "false", "section": "tags", "published_time": "2017-11-03T15:40:34.663Z"}, "twitter": {"card": "summary_large_image", "creator": "@TeenVogue", "domain": "https://www.teenvogue.com", "image": "https://assets.teenvogue.com/photos/59fc8d1e545af946d5bbde0d/16:9/w_1280,c_limit/dynasty-fb.jpg?mbid=social_retweet", "site": "@TeenVogue"}, "fb": {"app_id": 1013284322017473, "pages": 6636341311}}, "movies": [], "publish_date": 1509723634.663, "source": "https://www.teenvogue.com", "summary": ""}