{"url": "https://en.wikipedia.org/wiki/Comme_des_Gar%C3%A7ons", "text": "Japanese fashion brand\n\nComme des Garçons (also known as CDG) is a Japanese fashion label founded and headed by Rei Kawakubo in Paris. [1] The label began in 1969 and the company was founded in 1973. Its French flagship store is in Paris. It also establishes country-wide and world-wide store chain for various lines of products, including Dover Street Market, in major cities such as London, Melbourne, Hong Kong, New York City and Ginza.[2] Other than fashion, it has expanded its business to jewelry and perfume.[3]\n\nThe company shows their main collections during Paris Fashion Week and Paris Men's Fashion Week.[4] In 2017 it was reported that the company and its affiliates generates a revenue \"of over $280 million a year\".[5]\n\nHistory [ edit ]\n\nThe label was started in Tokyo by Rei Kawakubo in 1969 and established as a company in 1973. It is written in Japanese as コム・デ・ギャルソン (Komu de Gyaruson), and translates as \"like boys\" in French.[6] The brand's name was inspired by Françoise Hardy's 1962 song \"Tous les garçons et les filles\", particularly from the line Comme les garçons et les filles de mon âge.[7] The brand became successful in Japan in the 1970s and a menswear line was added in 1978. In 1981 the company had a debut show in Paris. Kawakubo's heavy use of black, as well as distressed fabrics and unfinished seams, were viewed negatively by French critics.[8]\n\nThroughout the 1980s, its clothes often were associated with a distressed and punk-oriented style. In 1982, Kawakubo's collection which she named \"Destroy\" was heavily criticized. \"Women's Wear Daily called it the 'Hiroshima bag lady look,' and the Associated Press proclaimed Kawakubo the 'high priestess of the Jap wrap.'\" Unusual styles continued through the 1990s, many of which were disliked by experts.[9] But the company carried on, and in 2004, the company split business into handmade garments in France and non-handmade garments in Japan, Spain and Turkey. Product lines like Deux, Shirt, Tricot, Homme Plus Evergreen, Junya Watanabe, and Ganryu are handmade in France.[10] The product line Play, which is the most recognizable and mainstream CDG casual luxury line, is largely produced in Japan, Spain and Turkey, but some of its product are handmade in France.[10] Filip Pagowski designed the heart logo and stitched onto Play pieces.[11][12]\n\nComme des Garçons lines [ edit ]\n\nDesigned by Rei Kawakubo\n\nComme des Garçons – main womenswear line (since 1969)\n\nComme des Garçons Noir – black-dominated womenswear collection (since 1987)\n\nComme des Garçons Comme Des Garçons – (a.k.a. 'Comme Comme') womenswear (since 1993)\n\nComme des Garçons Homme Plus – main menswear line (since 1984)\n\nComme des Garçons Homme Plus Sport – sporty subline of Homme Plus\n\nComme des Garçons Homme Plus Evergreen – subline of Homme Plus, re-invented items from past collections (since 2005)\n\nComme des Garçons Homme Deux – formal tailored menswear (since 1987)\n\nComme des Garçons Shirt – shirt-dominated collection (since 1988)\n\nComme des Garçons Shirt Girl\n\nComme des Garçons Shirt Boy (since 2014, discontinued 2019)\n\nComme des Garçons Girl (since 2015)\n\nPlay Comme des Garçons – casual streetwear for younger men and women with bug-eyed heart logo (collaboration with New York City graphic artist Filip Pagowski )\n\nBLACK Comme des Garçons – unisex , lower-priced line, initially started due to the recession in 2008, and also sold in signature BLACK pop-up shops.\n\nDesigned by Junya Watanabe\n\nComme des Garçons Homme – menswear Japanese line (since 1978)\n\nComme des Garçons Robe de Chambre – womenswear Japanese line (discontinued)\n\nJunya Watanabe Comme des Garçons – womenswear (since 1992)\n\nJunya Watanabe Comme des Garçons Man – menswear (since 2001)\n\nJunya Watanabe Comme des Garçons Man Pink – menswear items for women (discontinued)\n\nDesigned by Tao Kurihara\n\nTao Comme des Garçons – womenswear (launched 2005, discontinued after spring 2011)\n\nTricot Comme des Garçons – womenwear knits\n\nDesigned by Fumito Ganryu\n\nGanryu Comme des Garçons – asexual street style label, Ganryu was a former pattern-maker at Junya\n\nDesigned by Kei Ninomiya\n\nNoir Kei Ninomiya – womenswear (launched in 2013), Ninomiya was a former pattern-maker at CdG\n\nAccessories\n\nComme des Garçons Edited – special items for Edited shops in Japan\n\nComme des Garçons Pearl – jewelry (since 2006)\n\nComme des Garçons Parfum – (since 1994)\n\nComme des Garçons Parfum Parfum\n\nComme des Garçons Wallet\n\nSpeedo Comme des Garçons – swimwear collaboration (since 2005)\n\nHammerthor Comme des Garçons Shirt – underwear collaboration (since 2007)\n\nOthers\n\nComme des Garçons Peggy Moffitt\n\nComme des Garçons Six – bi-annual magazine (from 1988 to 1991)\n\nPerfume [ edit ]\n\nThe company also produces a line of agendered fragrances, most of which are unconventional in the world of perfume aligned with the styles of its garments.[13]\n\nThe company released its first fragrance, Comme des Garçons, in 1994 [14] and its first anti-perfume Odeur 53 in 1998.[15] The anti-perfume is a blend of 53 non-traditional notes to create a modern and striking scent.[16] Some of these notes are oxygen, flash of metal, wash drying in the wind, mineral carbon, sand dunes, nail polish, cellulose, pure air of the high mountains, burnt rubber and flaming rock.[citation needed] Director John Waters and architect Stephen Alesch both wear the fragrance.[17][18]\n\nThe company also released the Luxe series Champaca, for which artist Katerina Jebb produced the visuals.[citation needed]\n\nAdrian Joffe, the founder's husband and the CEO of the company, set up two companies. Comme des Garçons Parfums is for licensing some of the perfumes to Puig from 2002[19][20] and Comme des Garçons Parfums for selling the rest by its own.[21]\n\nThe company developed a unisex fragrance, G I R L and released it on 28 August 2014.[22] Artist KAWS designed the bottle.[23]\n\nFashion [ edit ]\n\nIts collections are designed in the studio in Aoyama, Tokyo and manufactured in Japan, France, Spain, and Turkey. Over the years, the company has recurrently associated itself with the arts and cultural projects internationally. The 1997 spring-summer collection, often referred to the lumps and bumps collection, which contained fabric in bulk and balls on the garments, led to a collaboration, also in 1997, between Rei Kawakubo and New York-based choreographer Merce Cunningham called Scenario. The 2006 autumn/winter collection dealt with the concept of the persona,[24] the different ways to present self to the world. Fusing tailored menswear with more feminine elements such as corsets and flower printed dress fabrics, Persona was another collection that combined the feminine with the masculine.\n\nJunya Watanabe[25][26] and, as of recently, Tao Kurihara[27][28] have started their own sub-labels under the label. Both also were involved in designing for the casual women's knitwear line Tricot.\n\nComme des Garçons dress\n\nThe company have collaborated with various other labels over the years such as Hammerthor,[29] H&M.[30][31] and Stüssy.[32]\n\nBjörk wore the label in the music video for Isobel.[citation needed] Frank Ocean named a song after the company.[33] John Waters devoted a chapter of his 2010 book Role Models to the label and founder.[34][35] Swedish musician Jonna Lee collaborated with the company in the creation of her audiovisual album Everyone Afraid to Be Forgotten, where the fashion house designed the costumes for the film.[36][37][38]\n\nControversies [ edit ]\n\n1995: 'Auschwitz' fashions [ edit ]\n\nThe 1995 \"Sleep\" collection consisted of striped pajamas \"bearing prints of identification numbers and marks of military boot prints\".[39] Contemporaneous media coverage juxtaposed images of the collection with images taken at Auschwitz concentration camp, and the controversy received international coverage.[40][41] The World Jewish Congress condemned the collection,[39] and fashion critic Suzy Menkes called the collection \"'Auschwitz' fashions\".[39][40] Kawakubo responded that the collection had been \"completely misunderstood\" and the controversy made her \"very sad\".[39]\n\n2015: Guarachero boots [ edit ]\n\nThe spring/summer 2015 menswear collection included \"guarachero\" boots based on the Mexican pointy boots of Matehuala, Mexico, raising concerns of cultural appropriation.[42][43]\n\n2020: Black hairstyles [ edit ]\n\nIn January 2020, a predominantly white group of models wore cornrowed lace front wigs in the fall 2020 menswear show.[44] This was seen as the appropriation of Black culture, particularly with the use of traditionally Black hairstyles on non-Black models. Stylist Julien d'Ys responded on Instagram, \"Dear all, My inspiration for the comme des garçons show was Egyptian prince A Look i found truly beautiful and inspirational. A look that was an hommage. Never was it my intention to hurt or offend anyone, ever. If I did I deeply apologize.\"[45]\n\nExhibitions [ edit ]\n\nAfter the Paris début, the company exhibited photographs by Peter Lindbergh at the Centre Georges Pompidou in Paris in 1986.[46] In 1990, it held an exhibition of sculpture. And again in 2005 it held an exhibition in Shinjuku, Tokyo of advertising and graphic designs.\n\nIn August 2010, the company opened a 19,000 square feet (1,800 m2) six-level flagship store in Seoul, South Korea featuring a branded art-exhibition space, its first outside Japan.[47]\n\nIn May 2017, Metropolitan Museum of Art of New York held a fashion exhibition with theme Rei Kawakubo/Comme des Garçons Art of the In-Between.[48][49]\n\nStores [ edit ]\n\nAoyama Store\n\nSignature boutiques are located in London (as Dover Street Market), Paris, New York City,[50] Beijing,[51] Hong Kong,[52] Seoul, St. Petersburg, Tokyo, Kyoto, Osaka, Fukuoka. The company also maintains concessions at select department stores, such as Isetan.\n\nThe company opened the first Guerrilla stores in 2004 in Berlin.[53] The aim of the Guerrilla stores is to be open for only one year[54] and to spend a minimal amount of money on the interiors.[55] The stores locates away from fashionable hubs and districts of a city. Guerrilla stores have been opened, and subsequently closed, in Reykjavik, Warsaw, Helsinki, Singapore, Stockholm, Athens and others. In July 2007, a Guerrilla Store opened in Beirut, Lebanon, and in February 2008, a Guerrilla Store opened in downtown Los Angeles, the first in the United States.[56] In November 2008, it opened another Guerilla store in the west end of Glasgow. In 2004 its opened another in London of Dover Street Market.[57][58]\n\nIn December 2009, the company opened a 4,400 square feet (410 m2) store in Hong Kong called Under The Ground. Hong Kong also has had a Guerrilla store opened and closed in previous years, run by Silly Thing Hong Kong.[59] In March 2012, it opened a store in Manila. Also, the first Dover Street Market in Japan opened in Ginza.[60] In December 2013, Dover Street Market in New York City opened.[61] In 2021, the company reintroduced its \"Guerilla\" stores, pioneering temporary boutiques that predated the pop-up shop movement by a good decade or so.", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/CdG.JPG/220px-CdG.JPG", "https://upload.wikimedia.org/wikipedia/commons/4/47/CommeDesGarcons.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Comme_des_Garcons_men_for_H%26M_09.jpg/220px-Comme_des_Garcons_men_for_H%26M_09.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Comme_des_Garcons_at_the_Met_%2862473%29.jpg/1200px-Comme_des_Garcons_at_the_Met_%2862473%29.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Comme_des_Garcons_at_the_Met_%2862473%29.jpg/220px-Comme_des_Garcons_at_the_Met_%2862473%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/78/Comme_des_Gar%C3%A7ons_dress_in_red%2C_white_and_blue.jpg/200px-Comme_des_Gar%C3%A7ons_dress_in_red%2C_white_and_blue.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Comme_des_Garcons_at_the_Met_%2862473%29.jpg/1200px-Comme_des_Garcons_at_the_Met_%2862473%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Comme_des_Gar%C3%A7ons", "title": "Comme des Garçons", "meta_data": {"generator": "MediaWiki 1.38.0-wmf.25", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Comme_des_Garcons_at_the_Met_%2862473%29.jpg/640px-Comme_des_Garcons_at_the_Met_%2862473%29.jpg", "width": 640, "height": 465}, "title": "Comme des Garçons - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}