{"url": "https://www.metacritic.com/feature/tv-premiere-dates?page=1", "text": "Past dates are listed below in reverse chronological order.\n\n< Current/Future Premieres\n\nFRI / December 31\n\nA Deadly Grudge Drama LMN, 8p\n\nDick Clark's New Year's Rockin' Eve With Ryan Seacrest 2022 Live event 8p\n\nThe Established Home Reality discovery+ (Magnolia)\n\nGary Owen: Black Famous Trailer Comedy speical 9p\n\nA Haunting Reality Travel, 10p\n\niGilbert Drama ($) Rent\n\nAlso opening in theaters on December 17 following a debut on the fall festival circuit, Maggie Gyllenhaal's directorial debut—which was recently named best picture of 2021 at the Gotham Awards—is an adaptation of the 2006 novel of the same name by Elena Ferrante (the Italian author best known for My Brilliant Friend). Olivia Colman stars as a woman whose solo summer seaside vacation turns sour when she becomes obsessed with another family whose activities trigger unhappy memories of her own past as a young mother. Gyllenhaal also wrote the script and enlisted a strong cast that also includes Dakota Johnson, Paul Mescal, Jessie Buckley, Ed Harris, and Peter Sarsgaard.\n\nMiley’s New Year’s Eve Party Hosted by Miley Cyrus and Pete Davidson Live event 10:30p\n\nNew Year's Eve Live: Nashville's Big Bash Live event/Music 8p\n\nRestoration Road With Clint Harp Reality discovery+ (Magnolia)\n\n▣ Sensation Trailer Sci-fi/Thriller ($) Rent\n\nNetflix's latest Harlan Coben adaptation stars Cush Humbo, Richard Armitage, James Nesbitt, Eddie Izzard, and Sarah Parish. All eight episodes stream today.\n\nTHU / December 30\n\nHilda and the Mountain King Trailer Animation\n\nKitz Foreign/Drama\n\nLight the Night Trailer Foreign/Drama\n\nRestaurant Impossible Reality Food, 8p\n\nWED / December 29\n\nAnxious People Trailer Foreign/Drama/Comedy\n\nBeyond Hubble: Launching the Telescope of Tomorrow Documentary Science, 10p\n\nTemuera Morrison (playing Boba Fett) and Ming-Na Wen (as fellow bounty hunter Fennec Shand) star in a spinoff from the hit Star Wars streaming series The Mandalorian that is set (at least in part) on Tatooine. Robert Rodriguez, who directed the Mandalorian episode that saw the return of Fett (a character that was first seen in The Empire Strikes Back—or, if you prefer, the Star Wars Holiday Special), will direct multiple episodes of the new series and serve as a producer alongside Jon Favreau and Dave Filoni (both of whom will also direct episodes, as will fellow Mandalorian director Bryce Dallas Howard).\n\nCalls From the Inside Reality ID, 9p\n\nCrime Scene: The Times Square Killer Trailer Reality\n\nFood Paradise Reality Cooking, 10p\n\nThe Standups Trailer Comedy\n\nWhere Chefs Eat Reality Cooking, 9p ET\n\nTUE / December 28\n\n2021 and Done With Snoop Dogg & Kevin Hart Trailer Special Peacock\n\nThe Hillside Strangler: Mind of a Monster Reality discovery+\n\nMan v. Food Reality Cooking, 9p\n\n▣ Mass Trailer Drama ($) Rent\n\nDebuting on VOD today after a theatrical run, Fran Kranz's directorial (and screenwriting) debut could be an Oscar contender in multiple categories after receiving terrific reviews for its taut, actor-driven story about the aftermath of a school shooting in which the parents of one of the victims sit down for a conversation with the parents of the shooter. Ann Dowd, Jason Isaacs, Martha Plimpton, and Reed Birney star.\n\nMurder in the Heartland Reality ID, 9p\n\nPopstar's Best of 2021 Special 8p\n\nRaid the Fridge Reality competition Food, 10p\n\nIf you only know the late Bob Einstein from his role as Marty Funkhouser on Curb Your Enthusiasm, you are missing out on quite a bit of his storied career. Danny Gold's documentary will use archival clips and new interviews (with Einstein's brother Albert Brooks plus Larry David, Steve Martin, David Letterman, and more) to fill you in on the details, including a look at his Emmy-winning work on The Smothers Brothers Comedy Hour and performances as his long-lived stuntman alter-ego Super Dave Osborne.\n\nWord Party Presents: Math! Family\n\nMON / December 27\n\nCrimes Gone Viral Reality ID, 10p\n\nInsecure: The End Trailer Documentary 10p\n\nKids Baking Championship Reality competition Food, 8p\n\nMessyness Comedy MTV, 9p\n\nThe Year: 2021 News 9p\n\nSUN / December 26\n\nHoliday Wars: Champion Cake Off Reality competition Food, 9p\n\nHome Town Reality HGTV, 8p\n\n▣ Letterkenny Trailer Comedy\n\nLulli Foreign/Comedy\n\nTMZ's Merry Elfin' Christmas: Bye Bye 2021 Special 7p\n\nSAT / December 25\n\nJimmy Carr: His Dark Material Comedy special\n\nStories of a Generation - With Pope Francis Trailer Reality\n\nWriting Around the Christmas Tree Drama Lifeitme, 8p\n\nFRI / December 24\n\n1000 Miles From Christmas Foreign/Family/Comedy\n\nDaughter From Another Mother Foreign/Comedy\n\nAdam McKay's first feature film since 2018's Vice is a comedy about two minor astronomers (Leonardo DiCaprio and Jennifer Lawrence) who believe they've made a startling discovery: A comet is about to collide with Earth. But now comes the hard part: convincing the world that they are right. Does Meryl Streep play the President of the United States? Why yes, she does. The huge ensemble also features Jonah Hill, Timothée Chalamet, Cate Blanchett, Ariana Grande, Tyler Perry, Gina Gershon, Chris Evans, Matthew Perry, Melanie Lynskey, Mark Rylance, Ron Perlman, and Kid Cudi. Don't Look Up will open in theaters on December 10 prior to today's streaming debut, just in case anyone is considering nominating Streep for an Oscar. (It never hurts to try.)\n\nFeaturing original music by Lin-Manuel Miranda, Disney's 60th animated feature makes a quick jump to Disney+ after just one month in theaters.\n\nHot Chocolate Holiday Drama Lifeitme, 8p\n\nMinnal Murali Foreign/Action-adventure\n\nThe Silent Sea Trailer Foreign/Drama/Sci-fi\n\nSlugfest Trailer Reality The Roku Channel\n\nOriginally commissioned for Quibi, this 10-episode docuseries from the Russo Brothers examines the rivalry between Marvel and DC.\n\nStand by Me Doraemon 2 Trailer Anime\n\nVicky and Her Mystery Foreign/Family\n\nTHU / December 23\n\nBabble Bop! Animation/Family Peacock\n\nBeanie Mania Trailer Documentary HBO Max\n\nChristmas 4 Sale Trailer Drama BET+\n\nA Closer Look With Anthony Hamilton Trailer Reality/Music ALLBLK\n\nThe third straight critically acclaimed film from writer-director Mike Mills (Beginners, 20th Century Women) heads to VOD today after a month in theaters. It's a biitersweet, black-and-white drama about a journalist (Joaquin Phoenix) who takes his young nephew on a cross-country trip while the boy's mother (Gaby Hoffman) cares for her ailing partner (Scoot McNairy), who is suffering from mental health issues.\n\nDead Man's Switch: A Crypto Mystery Documentary discovery+\n\nDragons: The Nine Realms Trailer Animation/Family Hulu/Peacock\n\nFantasy Island Drama 8p\n\nSpecial two-hour holiday episode.\n\nRebuilding a Dream Christmas Drama Lifeitme, 8p\n\nReno 911: The Hunt for QAnon Trailer Comedy Paramount+\n\n▣ Vigil Trailer Drama Peacock\n\n▣ Yearly Departed Trailer Comedy Prime Video\n\nWED / December 22\n\n44th Annual Kennedy Center Honors Special 9p\n\nIt Takes a Christmas Village Drama Lifeitme, 8p\n\nThe LCD Soundsystem Holiday Special Clip Trailer Music/Comedy Prime Video, 9p ET\n\nSure, half of this holiday special will consist of a new concert performance by the band. But what makes it unique is the other half of the show: a '90s sitcom spoof called \"All My Friends\" that finds actors (and, in one case, a puppet) playing members of LCD Soundsystem. That cast includes Macaulay Culkin, Aparna Nancherla, and Jon Daly, while Eric Wareheim plays bandleader James Murphy (and also directs the special).\n\nThe Masked Singer Christmas Singalong Reality/Music 8p\n\nKeanu Reeves, Carrie-Anne Moss, and Jada Pinkett Smith return for the first Matrix film since 2003. The fourth entry in the franchise finds Lana Wachowski directing solo for the first time and also stars Yahya Abdul-Mateen II (as Morpheus, the role originated by Laurence Fishburne), Jonathan Groff, Neil Patrick Harris, Christina Ricci, Priyanka Chopra Jonas, and Jessica Henwick. It will stream for one month on HBO Max beginning today, when it is also released in theaters.\n\nWWII in Color: Road to Victory Trailer Documentary\n\nTUE / December 21\n\n▣ Being the Ricardos Trailer Drama Prime Video\n\nStreaming on Amazon following a brief theatrical run (which begins December 10), the latest feature from writer-director Aaron Sorkin unfolds over the course of one week during the filming of the famed sitcom I Love Lucy. Nicole Kidman (rather improbably) plays Lucille Ball, while Javier Bardem portrays Desi Arnaz. As for Fred and Ethel? That would be J.K. Simmons and Nina Arianda.\n\nBeyond Hubble: The Telescope of Tomorrow Documentary Science, 10p\n\nBy the Grace of ... Trailer Drama ($) Rent/Buy\n\nThe Christmas Ball Drama Lifeitme, 8p\n\nGrumpy Christmas Foreign/Comedy\n\nJim Gaffigan: Comedy Monster Comedy special\n\nRepossession Trailer Horror/Thriller ($) Rent/Buy\n\nSong & Story: Amazing Grace Drama OWN, 9p\n\nMON / December 20\n\n100 Day Dream Home Reality HGTV, 8p\n\nCandy Cane Candidate Drama Lifeitme, 8p\n\nDynasty Drama 8p\n\nMiracles Across 125th Street Trailer Drama VH1, 9p\n\nReopening Night Trailer Documentary 10p\n\nTough Love With Hilary Farr Reality HGTV, 9p\n\nSUN / December 19\n\n▣ 1883 Trailer Drama Paramount+\n\nThis streaming-only Yellowstone prequel series follows the Dutton family on a journey through the Great Plains in the late 19th century and stars Sam Elliott, Tim McGraw, and Faith Hill, while Billy Bob Thornton guests.\n\nAlaskan Bush People: North Pole to North Star Reality Discovery, 8p\n\nChristmas Takes Flight Drama Paramount+\n\nClaws Trailer Drama/Comedy TNT, 9p\n\nThe Girl From Oslo Foreign/Drama\n\nHome Town: Ben's Holiday Workshop Reality HGTV, 8p\n\nJoy for Christmas Drama GAC Family, 8p\n\nPatti LaBelle's Holiday Party Special TV One, 7p\n\n'Tis the Season to be Merry Drama Hallmark, 8p\n\nTough Love With Hilary Farr Reality HGTV, 9p\n\nUnder the Christmas Tree Drama Lifeitme, 8p\n\nSAT / December 18\n\nBulgasal: Immortal Souls Trailer Foreign/Drama/Fantasy\n\nChristmas for Keeps Drama HMM, 10p\n\nThe Christmas House 2: Deck Those Halls Drama Hallmark, 8p\n\nDeadly Girls' Night Out Drama LMN, 8p\n\nDrew's Dream Car Reality discovery+\n\nHolmes for the Holidays Reality HGTV, 8p\n\nKindred Spirits Reality Travel, 10p\n\nMy Dream Kitchen: Carla Hall Reality discovery+\n\nMy Dream Kitchen: Giada De Laurentiis Reality discovery+\n\nOut of Stock: Supply Chain Crisis Reality Discovery, 8p\n\nSingle's Inferno Trailer Foreign/Reality\n\nSurprising Santa Claus Reality HGTV, 9p\n\nToying With the Holidays Drama Lifeitme, 8p\n\nWhen Hope Calls Drama GAC Family, 8p\n\nThe series formerly airing on Hallmark Movies Now moves to the channel formerly known as Great American Country.\n\nWomen of Worth Special 8p\n\nFRI / December 17\n\n89th Annual Hollywood Christmas Parade Special 8p\n\nChillin Island Trailer Reality 10:30p\n\nA trio of New York rappers (Alec \"Despot\" Reinstein, Ashok \"Dap\" Kondabolu, and Aleksey \"Lakutis\" Weintraub) invite celebrity guests from the music world (including Killer Mike, Rosalía, Lil Yachty, Young Thug, and Ezra Koenig) to hang out with them at the \"edge of nature\" (think deserts and swamps) in this six-episode unscripted series (based on the radio show of the same name) produced by Josh Safdie.\n\nDecoupled Trailer Foreign/Comedy\n\nFast & Furious Spy Racers Trailer Animation/Family\n\nA Forbidden Orange Foreign/Documentary HBO Max\n\n▣ Fortress Trailer Action ($) Rent/Buy\n\nJoe Bob Ruins Christmas Special Shudder, 9p ET\n\nMistletoe in Montana Drama Lifeitme, 8p\n\nA couple (Chloë Grace Moretz, Algee Smith) journey to evade an android uprising in a thriller set in the near future (at least for those of us living life sequentially).\n\nThe Murder of Gabby Petito: Truth, Lies and Social Media Trailer Reality Peacock\n\nWriter-director Lauren Hadaway based her feature debut on her own experiences as a competitive college rower. Tracking freshman Alex Dall (Orphan's Isabell Fuhrman) as she obsesses over making the top varsity boat, The Novice won multiple awards at this year's Tribeca Festival, including the top prize for best narrative feature (U.S.). It also plays in theaters beginning today.\n\nRolling Like Thunder Documentary 8p\n\nMaking a simultaneous streaming and theatrical debut (and not to be confused with another 2021 movie also called Swan Song), this near-future drama from first-time feature director Benjamin Cleary stars Mahershala Ali as a husband and father who is diagnosed with a terminal illness and is given an unusual option by his doctor (Glenn Close) that will shield his family from the grief of losing him—at a price. Naomie Harris and Awkwafina also star.\n\nTwisted Little Lies Drama LMN, 8p\n\nUninterrupted's Top Class: The Life and Times of the Sierra Canyon Trailblazers Trailer Reality/Sports IMDb TV\n\nA Walk in Her Shoes Trailer Documentary ($) Virtual theaters\n\n▣ With Love Trailer Rom-com Prime Video\n\nAmazon's new holiday rom-com series spends a year with a pair of siblings (Emeraude Toubia and Mark Indelicato) as they search for love. The first season will feature five one-hour episodes, each set during a different holiday throughout the year.\n\nTHU / December 16\n\n2nd Annual HA Festival: The Art of Comedy Trailer Comedy HBO Max\n\nAggretsuko Anime\n\nCalifornia Dreaming Musical/Family Nickelodeon, 7p\n\nChristmas by Chance Drama Lifeitme, 8p\n\nA Christmas Wish Trailer Drama BET+\n\nDays of Our Lives: A Very Salem Christmas Trailer Drama Peacock\n\nDead Asleep Trailer Documentary\n\nDiego, The Last Goodbye Documentary HBO Max\n\nDogs of the Year 2021 Reality 8p\n\nFinding Magic Mike Trailer Reality competition HBO Max\n\nStreaming weekly, the eight-episode Australian vampire series stars Yael Stone and Rob Collins.\n\nThe Fungies Trailer Animation/Family HBO Max\n\nThe late rapper is the subject of a documentary by Tommy Oliver. Fans can look forward to previously unreleased music and footage from the Chicago artist.\n\nWill Forte's MacGyver spoof, which originated first as a sketch on Saturday Night Live and made the jump to the big screen in a 2010 cult classic movie, returns now as a Peacock original series that picks up in the present day. Forte's title character has been in jail for the past decade serving a life sentence but is suddenly released as the series begins in order to participate in a secret government mission to take down an enemy from MacGruber's past, played by Billy Zane. Kristen Wiig, Ryan Phillippe, and Timothy V. Murphy also reprise their roles from the film, while new faces include Sam Elliott (as MacGruber's father) and Laurence Fishburne. Like the movie, the series is written by Forte along with John Solomon and Jorma Taccone, while the latter returns as director.\n\nA Naija Christmas Foreign/Rom-com\n\nPrince Philip: The Royal Family Remembers Documentary discovery+\n\nPuff: Wonders of the Reef Trailer Documentary\n\nThe series moves from Bravo to Peacock for its fourth season. New episodes stream weekly following today's three-episode premiere.\n\nSouth Park: Post COVID: The Return of COVID Trailer Animation/Comedy Paramount+\n\n▣ Station Eleven Trailer Drama HBO Max\n\nToo soon? That is the big question facing this HBO Max adaptation of the award-winning 2014 novel by Emily St. John Mandel that depicts a world ravaged by a pandemic—in this case, an extremely deadly flu. The 10-episode limited series was commissioned nearly six months before the all-too-real COVID pandemic began to make headlines, and whether or not audiences are ready to treat a viral contagion as entertainment remains to be seen (though Station Eleven's far more apocalyptic scenario may make COVID seem tame and manageable by comparison). Spanning multiple timelines (but mostly focusing on the aftermath), the series comes from Patrick Somerville (Made for Love) and counts Hiro Murai (Atlanta), Helen Shaver (Vikings), and Jeremy Podeswa (Game of Thrones) among its directors. The ensemble cast includes Mackenzie Davis, Himesh Patel, David Wilmot, Matilda Lawler, Philippine Velge, Daniel Zovatto, Lori Petty, Nabhaan Rizwan, and Gael Garcìa Bernal.\n\nTarek & Heather: The Big I Do Reality HGTV, 8p\n\nWED / December 15\n\nElite: Short Stories Trailer Foreign/Drama\n\nThe Enchanted Christmas Cake Drama Lifeitme, 8p\n\nFoodtastic Trailer Reality competition Disney+\n\nAlso playing in theaters (beginning December 3rd), the latest Italian drama from Paolo Sorrentino (The Great Beauty, Il Divo, HBO's The Young Pope) is a coming of age tale set in 1980s Naples—where Sorrentino himself grew up—as an awkward teenage boy with an eccentric family finds his life upended after an incident involving soccer great Diego Maradona.\n\niHeartRadio Jingle Ball 2021 Music 8p\n\nKenan Comedy 8:30p\n\nSeason 2 won't air until next year, but today brings an all-new holiday episode.\n\nMean Boys Animation/Comedy Paramount+\n\nMr. Mayor Comedy 9p\n\nSeason 2 won't air until next year, but today brings an all-new holiday episode.\n\nOriginally set to open in theaters in February 2022, this animated monster wrestling movie is now a Paramount+ exclusive. Voices come from Will Arnett, Terry Crews, and more.\n\nSelling Tampa Trailer Reality\n\nShatner in Space Reality Prime Video\n\nA Very Chrisley Christmas Reality 9:30p\n\nYoung Rock Comedy 8p\n\nSeason 2 won't air until next year, but today brings an all-new holiday episode.\n\nTUE / December 14\n\nBonus Family Foreign/Drama\n\nA Christmas Stray Trailer Drama OWN, 9p\n\nFixer to Fabulous Holiday Surprise Reality HGTV, 9p\n\n▣ The French Dispatch Drama/Comedy ($) Buy\n\nWes Anderson's latest film heads to VOD and digital outlets today ahead of its Blu-ray/DVD release on December 28.\n\nThe Future Diary [2021 reboot] Trailer Foreign/Reality\n\nGhosts of Christmas Past Drama Lifeitme, 8p\n\nGordon Ramsay's Road Trip: Christmas Vacation Reality 9p\n\n▣ Grand Crew Comedy 8p\n\nPhil Augusta Jackson, a writer on critically acclaimed comedies Brooklyn Nine-Nine and Insecure, is the creator of this Los Angeles-set comedy about a group of friends who bond at a wine bar. (Yes, there are six of them—that TV rule cannot be broken.) Nicole Byer, Carl Tart, Echo Kellum, Justin Cunningham, Aaron Jennings, and Grasie Mercedes star. Tonight brings a two-episode sneak peak, though the series won't have its official premiere (and additional episodes) until January 4.\n\nThe Murders at Starved Rock Trailer Documentary 8p\n\nOne Stage to the Next Reality TV One, 10p\n\nRange Roads Trailer Drama ($) Rent/Buy\n\nRussell Howard: Lubricant Comedy special\n\nStarBeam: Beaming in the New Year Trailer Animation/Family\n\nThrowdown With Michael Symon Reality Food, 9:30p\n\nThe World We Knew Trailer Thriller ($) Rent/Buy\n\nMON / December 13\n\n▣ American Auto Comedy 10p\n\nThe latest workplace sitcom from Superstore creator Justin Spitzer is set in Detroit at the headquarters of a major automotive company struggling to adapt to a changing industry. The single-camera comedy stars Ana Gasteyer, jon Barinholtz, Harriet Dyer, Humphrey Ker, Michael B. Washington, Tye White and X Mayo. Two episodes air back-to-back tonight as a special sneak preview, with the series then returning for its regular run on January 4.\n\nGordon Ramsay's Road Trip: European Vacation Reality 8p\n\nHouse Hunters Ho Ho Home Reality HGTV, 10p\n\nThe only House Hunters spinoff (so far) to feature a real estate agent who doubles as a \"world-famous strongman and well-known Santa impersonator\" airs each weeknight this week.\n\n▣ The Larkins Trailer Drama Acorn TV\n\nLet's Get Merried Drama VH1, 9p\n\nMaps and Mistletoe Drama Lifeitme, 8p\n\nThe Rise and Fall of LuLaRoe Documentary discovery+\n\nWhat's not to like about a documentary chronicling the early history of America's (if not the world's) most enduring, influential, and popular children's television program, Sesame Street? Don't worry: A few minor quibbles aside, critics at the film's Sundance debut early this year had much praise for Street Gang, adapted by Mad Hot Ballroom director Marilyn Agrelo from Michael Davis' book.\n\nVH1 Family Reunion: Love & Hip Hop Edition Reality VH1, 8p\n\nSUN / December 12\n\n70th Miss Universe Competition Live event 7p\n\n90 Day Fiancé: Before the 90 Days Reality TLC, 8p\n\nAlex Murdaugh: Death. Deception. Power. Trailer Reality Oxygen, 8p\n\nA Christmas Proposal Drama Paramount+\n\nA Christmas Star Drama GAC Family, 8p\n\nDavid Lee Roth: Van Halen Frontman Reality/Music Reelz, 8p ET\n\nFixing Up Christmas Drama UP, 7p\n\nGreatest Holiday Commercials Countdown 2021 Special 9p\n\nKen and Barbie Killers: The Lost Murder Tapes Reality ID, 9p\n\nPeople Presents: Blending Christmas Trailer Drama Lifeitme, 8p\n\nSecrets of the Celtic Grave Reality Science, 8p\n\nSister Swap: Christmas in the City Drama Hallmark, 8p\n\nWhite House Christmas 2021 Reality HGTV, 6p\n\nSAT / December 11\n\nChristmas in the Rockies Drama UP, 7p\n\nA Christmas Miracle for Daisy Drama GAC Family, 8p\n\nDangerous Snow Day Drama LMN, 8p\n\nA Godwink Christmas: Miracle of Love Drama HMM, 10p\n\nThe Holiday Fix Up Trailer Drama Lifeitme, 8p\n\nHot Mess Holiday Trailer Comedy 7p\n\nThe second of two Comedy Central original holiday movies this month deals not with Christmas but Diwali. Surina Jindal, Melanie Chandra, Kal Penn, Tituss Burgess, Chris Geere, and Chris Parnell head the cast.\n\nThe Hungry and the Hairy Trailer Foreign/Reality\n\nThe Pioneer Woman's Hometown: Holiday Themes Reality discovery+ (Magnolia)\n\nRadford Returns Reality discovery+\n\nA Royal Queens Christmas Drama Hallmark, 8p\n\nSteven Tyler: Aerosmith Frontman Reality/Music Reelz, 8p ET\n\nFRI / December 10\n\n▣ Agnes Horror/Thriller ($) Rent\n\nAmerican Refugee Horror/Thriller ($) Rent\n\nAmerican Sicario Trailer Action/Drama ($) Rent\n\nAnonymously Yours Foreign/Drama\n\nAranyak Trailer Foreign/Drama\n\nA group of reptiles plan an escape from the zoo where they are held captive in an animated family comedy featuring the voices of Isla Fisher, Tim Minchin, Jacki Weaver, Eric Bana, Keith Urban, and Guy Pearce.\n\nDafne and the Rest (Todo lo otro) Foreign/Comedy/Drama HBO Max\n\nA Daughter's Deceit Drama LMN, 8p\n\nA Dickens of a Holiday Drama Hallmark, 8p\n\n▣ Encounter Trailer Sci-fi/Thriller Prime Video\n\nA father (Riz Ahmed) embarks on a dangerous mission to save his two sons from an alien threat in an Amazon sci-fi thriller that will also play in theaters beginning December 3rd.\n\n▣ The Expanse Trailer Drama/Sci-fi Prime Video\n\nThe show's final season will stream weekly on Fridays through January 14th.\n\nFamily Dinner Reality discovery+ (Magnolia)\n\nFor Auld Lang Syne Trailer Animation/Family Apple TV+\n\nApple's first original Peanuts holiday special finds the gang planning a New Year's Eve celebration.\n\nThe Hating Game Trailer Rom-com/Drama ($) Rent/Buy\n\nHoliday in Santa Fe Trailer Drama Lifeitme, 8p\n\nHow to Ruin Christmas Drama/Comedy\n\nJoy Womack: The White Swan Trailer Documentary ($) Rent\n\nThis black-and-white film is technically an adaptation of Olaf Stapledon's 1930 sci-fi novel, but it's much more of a meditative multimedia experiment than a conventional narrative film. It's also the first and final film directed by Oscar-nominated composer Jóhann Jóhannsson, who died at the age of 48 two years before his film would make its world premiere (to excellent reviews) at the 2020 Berlinale. Men now makes its American theatrical debut today at New York's Metrograph, which will also make the film available to rent online at its website. Tilda Swinton narrates.\n\nThe Last Son Trailer Western ($) Rent/Buy\n\nLOL: Last One Laughing Mexico Comedy Prime Video\n\n▣ Mosley Animation/Family ($) Rent\n\nThe Now Trailer Comedy The Roku Channel\n\nDave Franco heads the cast of a dark comedy from the Farrelly brothers that also stars Daryl Hannah, O'Shea Jackson, and Jimmy Tatro and features appearances from Bill Murray, Alyssa Milano, and Pete Davidson. All 14 episodes stream today.\n\nPlay-Doh Squished Reality competition IMDb TV\n\nRicky Powell: The Individualist Documentary/Music 8p\n\nCo-created by SNL's Kyle Mooney along with Ben Jones (head of Bob's Burgers animation studio Bento Box), this quirky eight-episode adult comedy series inspired by '80s and '90s children's television blends live-action and animated segments, with Mooney starring as the show's twin hosts, Skip and Treybor (among other characters).\n\nStill Out of My League Foreign/Rom-com\n\nTwentysomethings: Austin Trailer Reality\n\nNeflix's new Real World clone (which was titled Roaring Twenties up until a few weeks ago) spends its first season following eight 20-something strangers enlisted to live together in Austin. Episodes will arrive in two parts (six today, six on 12/17), and will likely be followed by future seasons to take place in other cities.\n\nSandra Bullock stars as a woman who encounters difficulty rejoining society after serving a prison sentence for committing a violent crime. Jon Bernthal and Vincent D'Onofrio also star for director Nora Fingscheidt (a German director making her English-language debut), and the Netflix film will also play in theaters beginning November 24.\n\nTHU / December 9\n\nHBO Max's revival of the long-running HBO hit Sex and the City begins today with the first two of its 10 episodes. Formerly the show's fifth character, the city of New York has been bumped up to #4 thanks to the departure of Kim Cattrall's Samantha. But Sarah Jessica Parker, Kristin Davis, and Cynthia Nixon all reprise their co-leading roles (tempted by a $1 million per episode payday), joined by other returning faces from the original series like John Corbett's Aidan, Chris Noth's Mr. Big, Mario Cantone's Anthony, David Eigenberg's Steve, Evan Handler's Harry, and Willie Garson's Stanford. (It's the final on-screen role for the latter, who died during filming.) Newcomers include Sara Ramirez and Nicole Ari Parker.\n\nJodie Turner-Smith, Paapa Essiedu, Mark Stanley, and Lola Petticrew head the diverse cast for this three-part historical thriller set at the end of the titular Queen's life. Reviews were mixed-to-decent when the series premiered in the UK earlier this year.\n\nAsakusa Kid Foreign/Drama\n\n▣ Bloods Comedy\n\nThe British paramedic comedy starring Samson Kayo, Jane Horrocks, and Lucy Punch makes its American debut, with a second season to follow next year.\n\nCreamerie Comedy/Sci-fi\n\nHulu's other import debuting today is a darkly comedic New Zealand series set in a near-future world where a plague has wiped out 99% of the male population.\n\nDeath Valley Trailer Horror Shudder\n\nThe Family That Sings Together: The Camargos [É o Amor] Trailer Foreign/Reality/Music\n\nThe Ferragnez Trailer Reality Prime Video\n\nA Fiancé for Christmas Drama Lifeitme, 8p\n\nFlip or Flop Reality HGTV, 9p\n\nThe Housewives of the North Pole Trailer Drama Peacock\n\nKanye With Special Guest Drake: Live in Concert Live event/Music Prime Video, 8p PT\n\nMerry Switchmas Trailer Drama BET+\n\nThe focus of HBO's latest \"Music Box\" documentary is an Australian businessman, artist manager, and producer named Robert Stigwood. He may not be a household name, but as John Maggio's film demonstrates, he is a key figure in the melding of Hollywood and the music industry. Among other achievements, he purchased the film rights to a 1976 magazine article about New York's nightclub scene and turned it into a movie called Saturday Night Fever, which spawned perhaps the most successful soundtrack album in history.\n\nShaman King Trailer Anime\n\nSummer Camp Island Animation/Family HBO Max\n\nA Thousand Fangs (Mil Colmillos) Foreign/Drama HBO Max\n\nTrollstopia Animation/Family Hulu/Peacock\n\nWED / December 8\n\nCarolin Kebekus: The Last Christmas Special Comedy special\n\nChristmas Around the World Reality/Variety 8p\n\nChristmas With a Crown Drama Lifeitme, 8p\n\nCMT Crossroads Christmas: Brett Young & Friends Music CMT, 8p\n\nCMT's A Tennessee Kind of Christmas Music CMT, 9p\n\nDr. Pimple Popper: A Pimple Carol Reality TLC, 10p\n\nFC Bayern – Behind the Legend Reality/Sports Prime Video\n\nNickelodeon's Treasure Truck Reality competition Nickelodeon, 7:30p\n\nWill Smith hosts a six-part nature/adventure series produced by Darren Aronofsky.\n\nTUE / December 7\n\n2021 People's Choice Awards Live event 9p\n\nSpecial sneak preview tonight; regular series premiere is January 4 at 9p. Quinta Brunson (A Black Lady Sketch Show) is the creator and star of this workplace comedy set in a Philadelphia public school.\n\nAlaskan Killer Bigfoot Reality discovery+\n\nCalled to the Wild Trailer Reality competition Nat Geo, 10p\n\nCentaurworld Trailer Animation/Family\n\nChristmas Movie Magic Drama Lifeitme, 8p\n\nFatal Distraction Trailer Documentary ($) Rent/Buy\n\nGo Dog Go Animation/Family\n\nABC's latest live production of two classic sitcom episodes stars John Lithgow (as Mr. Drummond), Kevin Hart (as Arnold), Damon Wayans (as Willis), and Ann Dowd (as Mrs. Garrett) in a reenactment of Diff'rent Strokes. The latter will reprise her role in the Facts of Life episode, joined by Jennifer Aniston (as Blair), Kathryn Hahn (as Jo), Gabrielle Union (as Tootie), and Allison Tolman (as Natalie).\n\nNicole Byer: BBW (Big Beautiful Weirdo) Trailer Comedy special\n\nThe Reenactment Trailer Horror ($) Rent/Buy\n\nA Sisterly Christmas Trailer Drama OWN, 9p\n\nThe Slow Hustle Trailer Documentary 8p\n\nThe Wishing Tree Trailer Drama ($) Rent/Buy\n\nMON / December 6\n\nDavid and the Elves Foreign/Family\n\nAlex Gibney's latest documentary focuses on the case of alleged al-Qaeda operative Abu Zubaydah, who has been imprisoned at Guantanamo Bay (and likely tortured) for nearly two decades despite never being charged with a crime and cooperating with American officials.\n\nHip Hop Family Christmas Drama VH1, 9p\n\nHomicide for the Holidays Reality Oxygen, 8p\n\n▣ Joe Pickett Trailer Drama Spectrum\n\n▣ Landscapers Trailer Drama 9p\n\nDelayed both by COVID and a change in directors (from Alexander Payne to Will Sharpe) after first being announced in 2019, this four-episode crime drama is based on the true story of a seemingly ordinary British married couple, Susan Edwards (played by Olivia Colman) and Christopher Edwards (David Thewlis) who become the focus of a murder investigation when two bodies are discovered in their backyard. And they aren't the bodies of two strangers, but the decade-old corpses of Susan's parents. Series writer Ed Sinclair spent hours interviewing the real-life couple, who maintain their innocence, and other participants to create the darkly comedic, perspective-shifting series, while Sharpe (who previously collaborated with Colman in the Channel 4 series Flowers) takes a highly stylized approach to the visuals. Episodes will air weekly (and stream on HBO Max) on Mondays.\n\nMichael Bublé's Christmas in the City Variety 10p\n\nOur Beloved Summer Foreign/Drama\n\nSecretly Santa Drama Lifeitme, 8p\n\nUnder the Vines Trailer Drama/Comedy Acorn TV\n\nA Very Boy Band Holiday Music 8p\n\n▣ VOIR Trailer Documentary\n\nDavid Fincher is among the producers of this six-episode collection of \"visual essays\" about cinema.\n\nSUN / December 5\n\n23rd Annual A Home for the Holidays Special 9:30p ET / 9p PT\n\nA Furry Little Christmas Drama UP, 7p\n\nBeforeigners Trailer Foreign/Drama/Sci-fi HBO Max\n\nBruce Dickinson: Iron Maiden Frontman Reality/Music Reelz, 8p ET\n\nA Lot Like Christmas Drama GAC Family, 8p\n\nMr. A & Mr. M: The Story of A&M Records Trailer Documentary/Music Epix, 10p\n\nMy Favorite Christmas Melody Drama Lifeitme, 8p\n\nThe National Christmas Tree Lighting Special 8:30p ET / 8p PT\n\nReal Murders of Orange County Reality Oxygen, 7p\n\nSister Swap: A Hometown Holiday Drama Hallmark, 8p\n\nSmall Town Christmas Reality UP, 9p\n\nSomething's Coming: West Side Story Special 7p\n\nValley of the Queens Reality Science, 8p\n\nSAT / December 4\n\nChristmas Beneath the Stars Drama UP, 7p\n\nA Clüsterfünke Christmas Trailer Comedy 7p\n\nAna Gasteyer and Rachel Dratch write and star in a Comedy Central original holiday movie spoof about a city dweller who moves to an almost obscenely named but quaint small town to run an inn. If you are suddenly thinking about Schitt's Creek, we're certain that's purely a coincidence.\n\nDrew Michael: Red Blue Green Trailer Comedy special 10p\n\nHolmes Family Rescue Reality HGTV, 8p\n\nJingle Bell Christmas Drama GAC Family, 8p\n\nKirk Franklin's A Gospel Christmas Drama Lifetime, 8p\n\nOur Christmas Journey Drama HMM, 10p\n\nOzzy Osbourne: Black Sabbath Frontman Reality/Music Reelz, 8p ET\n\nSecrets in the Wilderness Drama LMN, 8p\n\nA Very Merry Bridesmaid Drama Hallmark, 8p\n\nWhen Buildings Collapse: Disaster in Surfside Reality Discovery, 8p\n\nFRI / December 3\n\nAlex Rider Trailer Drama IMDb TV\n\n▣ Benedetta Trailer Foreign/Drama ($) Rent\n\nAlso opening in a few theaters in LA and NY today, the latest from director Paul Verhoeven (Basic Instinct, Elle) was one of the most talked-about films at this year's Cannes, partially due to its quality (critics liked it but didn't love it) but mostly due to the fact that it's an often graphic film about a 17th century nun plagued by erotic visions who begins a steamy (and sacrilegious) affair with another nun. The adaptation of Judith C. Brown's nonfiction book Immodest Acts stars Virginie Efira, Charlotte Rampling, and Daphne Patakia.\n\nChasing Ghislaine Reality ID, 8p\n\nChristmas…Again?! Family/Comedy Disney, 8p\n\nA Christmas Dance Reunion Drama Lifeitme, 8p\n\n▣ Citizen Ashe Trailer Documentary ($) Rent\n\nAvailable both on VOD and in theaters today, this documentary from MLK/FBI director Sam Pollard, co-directing with Rex Miller (Althea), focuses on trailblazing tennis Hall of Famer and HIV/AIDS activist Arthur Ashe, who won major tournaments like Wimbledon and the U.S. and Australian Opens and was the first Black member of America's Davis Cup team. If you can wait, the film is also expected to come to CNN and HBO Max in the near future.\n\nCobalt Blue Foreign/Drama\n\n▣ Deadlock Trailer Action ($) Rent/Buy\n\nDisney's Holiday Magic Quest Trailer Reality Disney/Disney+, 7p\n\nIf you missed it on HBO Max (or in theaters), Denis Villeneuve's new take on Frank Herbert's sci-fi epic heads to premium VOD (and is also available for digital purchase) today prior to its DVD/Blu-ray release next month.\n\nEight Gifts of Hanukkah Drama Hallmark, 8p\n\nFamily Massacre Trailer Reality Oxygen, 9p\n\nFunny Thing About Love Rom-com ($) Rent\n\nThe Great British Baking Show: Holidays Trailer Reality competition\n\n▣ Harlem Trailer Comedy Prime Video\n\nMegan Good, Grace Byers, Shoniqua Shandai, Jerrie Johnson, and Tyler LePley star (alongside guests like Whoopi Goldberg and Andrea Martin) in this 10-episode comedy series about four female friends in Harlem—think of it as a variation on Girlfriends and Sex and the City—created by Tracy Oliver (Girls Trip).\n\nHome Drama ($) Rent\n\nThe Hunt for the Chicago Strangler Reality discovery+\n\nInside Edge Foreign/Drama Prime Video\n\nThe Johnnyswim Show Reality discovery+ (Magnolia)\n\nJurassic World: Camp Cretaceous Trailer Animation/Family\n\nKiller Siblings Reality Oxygen, 8p\n\n▣ Love and Fury Documentary\n\nMariah’s Christmas: The Magic Continues Variety Apple TV+\n\nMissing and Alone Drama LMN, 8p\n\nMoney Heist Trailer Foreign/Drama\n\nMoney Heist: From Tokyo to Berlin Talk/Documentar\n\nThe New York Times Presents: To Live and Die in Alabama Documentary FX/Hulu, 10p\n\n▣ PEN15 Trailer Comedy\n\nRed Stone Action/Thriller ($) Rent\n\nShaun the Sheep: The Flight Before Christmas Animation/Family\n\nAlso opening in theaters today, writer-director Camille Griffin’s debut feature finds a toxic gas cloud consuming the world, while Nell (Keira Knightley), Simon (Matthew Goode), and their son Art (Jojo Rabbit's Roman Griffin Davis) are welcoming friends and family (Annabelle Wallis, Kirby Howell-Baptiste, Lily-Rose Depp, Lucy Punch, and Sope Dirisu) for one last Christmas dinner. The holiday horror comedy earned middling reviews on the festival circuit.\n\n▣ Stath Lets Flats Comedy HBO Max\n\nThis Game's Called Murder Trailer Thriller ($) Rent\n\nVideo Music Box Documentary/Music 8p\n\nTHU / December 2\n\n▣ The Advent Calendar Horror Shudder\n\n▣ Annie Live! Musical/Live event 8p\n\nNBC's latest live musical event will star Taraji P. Henson, Harry Connick Jr., Tituss Burgess, Megan Hilty, Nicole Scherzinger, and 12-year-old newcomer Celina Smith, who was cast in the lead role after a talent search.\n\n▣ Baking It Trailer Reality competition Peacock\n\nCross The Great British Baking Show with NBC's Making It and you get this new feel-good, holiday-themed baking competition hosted by Maya Rudolph and Andy Samberg. Baking It comes from the same team behind Making It (including producer Amy Poehler) and will feature amateur contestants in teams of two (who will be siblings, friends, spouses, and other combinations). And the judges? A panel of four grandmothers. All six episodes stream today.\n\nThe Bitch Who Stole Christmas Trailer Comedy VH1, 9p\n\nA Christmas Village Romance Drama Lifeitme, 8p\n\nThe Coyotes [aka Coyotes] Foreign/Drama\n\nGreat Balloon Bomb Invasion Documentary discovery+\n\nOut of all of HBO's \"Music Box\" documentaries, you may think this is the one you'll want to skip. But you are wrong. The recipient of excellent reviews out of TIFF in September, Penny Lane's highly entertaining documentary knows that that the smooth jazz saxophonist (who participates in the film) is hated by as many (or more) music fans than those who adore him and buy his records by the millions. And her painstakingly researched, often humorous film doesn't just trace his life story but focuses a good chunk of time on the backlash while exploring the meaning of \"good\" and \"bad\" music through interviews with music critics, DJs, and scholars.\n\n▣ The Pact Drama Sundance Now\n\nPerfect Life (Vida Perfecta) Trailer Foreign/Drama/Comedy HBO Max\n\nQueen of the Universe Reality competition Paramount+\n\n▣ Santa Inc Trailer Animation/Comedy HBO Max\n\nIt may be a stop-motion animated holiday series in the style of your favorite Rankin/Bass classics, but Santa Inc is definitely for adults, not kids. The foul-mouthed workplace comedy (from Shrill's Alexandra Rushfield) finds Sarah Silverman voicing an elf who currently serves as a vice president at the North Pole but hopes someday to become the first female Santa. The current Santa is voiced by Seth Rogen while other voices come from Maria Bamford, Nicholas Braun, Craig Robinson, Gabourey Sidibe, and Leslie Grossman. All eight episodes stream today.\n\nShaq Life Reality TBS, 9p\n\nThe Whole Truth Foreign/Horror", "images": ["https://static.metacritic.com/images/products/games/1/86723f0cf0b91ad95a875391f56dfc34-98.jpg", "https://static.metacritic.com/images/products/movies/9/b059cdcc6ca33efa4ff9c031a01785ae-98.jpg", "https://static.metacritic.com/images/products/tv/2/89fda4f367ada160a0101571b056c129-98.jpg", "https://static.metacritic.com/images/features/networks/fxx25.png", "https://static.metacritic.com/images/features/networks/comedycentralnew20.png", "https://static.metacritic.com/images/products/movies/1/07071dfdb5b372913687e1c51ccbaf76-98.jpg", "https://static.metacritic.com/images/products/tv/2/589f05b1380c7b358c303c5903be4405-98.jpg", "https://static.metacritic.com/images/features/main/apple202203-50.jpg", "https://static.metacritic.com/images/features/networks/showtime20.png", "https://www.metacritic.com/images/icons/search_inactive.svg", "https://static.metacritic.com/images/features/main/hbo202203-50.jpg", "https://static.metacritic.com/images/features/main/paramount202203-50.jpg", "https://static.metacritic.com/images/features/main/tvpremieredates-28.jpg", "https://static.metacritic.com/images/features/networks/hulu15transparent.png", "https://static.metacritic.com/images/features/main/peacock202112-50.jpg", "https://static.metacritic.com/images/features/main/Best_Anime-28.jpg", "https://static.metacritic.com/images/products/music/8/d236696a0c8c5cee95c38e93a2c339ec-98.jpg", "https://static.metacritic.com/images/products/tv/5/4c852a2c5cefc3c733192d147fbe0483-98.jpg", "https://static.metacritic.com/images/features/main/amazon202202-180.jpg", "https://static.metacritic.com/images/products/games/7/cf21bb68e9006d17f7b7bff4cdafe6f6-98.jpg", "https://static.metacritic.com/images/features/main/decade_best_games_breathofthewild-28.jpg", "https://static.metacritic.com/images/products/music/0/5c6f7aa70b7181a0c57c58bef6a3db4f-98.jpg", "https://static.metacritic.com/images/products/movies/1/d667aa749a13ce75ec8ea022ab33ca7d-98.jpg", "https://static.metacritic.com/images/features/networks/nbc20.png", "https://static.metacritic.com/images/features/media/graphics/new.gif", "https://static.metacritic.com/images/products/games/7/d895dbec6f21f552d29dea8bf4db3eba-98.jpg", "https://static.metacritic.com/images/features/main/netflix202203-50.jpg", "https://static.metacritic.com/images/products/tv/7/fe9a592ed9ef773123299c099b111ce7-98.jpg", "https://www.metacritic.com/images/icons/mc-mustsee-sm.svg", "https://static.metacritic.com/images/features/main/games_scorecard_2022_Q2-180.jpg", "https://static.metacritic.com/images/products/movies/1/65b1e23d9dc800b3d3d45b0cfd0b648e-98.jpg", "https://static.metacritic.com/images/features/_graphics/special.gif", "https://static.metacritic.com/images/features/main/amazon202202-50.jpg", "https://static.metacritic.com/images/features/_graphics/miniseries.gif", "https://static.metacritic.com/images/products/games/0/fc2ed38cd981a47d38f24911317270a9-98.jpg", "https://www.metacritic.com/media/networks/pbs25.png", "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg", "https://static.metacritic.com/images/products/games/5/62df6d0728e4610d5353ccfa22ca00db-98.jpg", "https://www.metacritic.com/images/icons/metacritic-icon.svg", "https://static.metacritic.com/images/features/main/apple202203-180.jpg", "https://static.metacritic.com/images/products/movies/6/505973ec8e1833944ba338515d37cb86-98.jpg", "https://www.metacritic.com/images/icons/mc-mustplay-sm.svg", "https://static.metacritic.com/images/products/music/5/8a508f5c9c7ce3eb3bbbf04a8f4d0c21-98.jpg", "https://static.metacritic.com/images/features/main/tvpremieredates-50.jpg", "https://static.metacritic.com/images/products/music/8/010f2535ce4e6cc70dd080d45a3bdb48-98.jpg", "http://static.metacritic.com/images/features/networks/fx20.png", "https://static.metacritic.com/images/features/networks/netflixnew50.jpg", "https://static.metacritic.com/images/products/music/5/1ff3d63b523851411de160a17185ebb0-98.jpg", "https://static.metacritic.com/images/features/_graphics/movie.gif", "https://static.metacritic.com/images/features/networks/cbs20.png", "https://static.metacritic.com/images/features/main/_TNtvpreview202203-50.jpg", "https://www.metacritic.com/images/icons/metacritic-wordmark.svg", "https://www.metacritic.com/media/networks/cw20.png", "https://static.metacritic.com/images/features/networks/fox20.png", "https://static.metacritic.com/images/products/tv/2/dadabc236dd248df9cf1e1f7d74627e0-98.jpg", "https://static.metacritic.com/images/features/networks/amc20.png", "https://static.metacritic.com/images/features/main/bestof2021userpollresults-180.jpg", "https://static.metacritic.com/images/features/main/steamdeck-28.jpg", "https://static.metacritic.com/images/features/main/film_powerofthedog-28.jpg", "https://static.metacritic.com/images/features/networks/hbo20.png", "https://static.metacritic.com/images/features/main/oscarpoll2022-28.jpg", "https://static.metacritic.com/images/features/networks/abc20.png"], "top_img": "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.metacritic.com/feature/tv-premiere-dates", "title": "Spring/Summer 2022 TV Premiere Calendar", "meta_data": {"description": "Find a calendar of premiere dates for all upcoming new and returning television shows, plus TV movies and specials. - Page 2", "viewport": "width=1024", "application-name": "Metacritic", "msapplication-TileColor": "#000000", "msapplication-TileImage": "/images/win8tile/76bf1426-2886-4b87-ae1c-06424b6bb8a2.png", "facebook-domain-verification": "618k3mbeki8tar7u6wvrum5lxs5cka", "og": {"title": "Spring/Summer 2022 TV Premiere Calendar", "type": "article", "url": "https://www.metacritic.com/feature/tv-premiere-dates", "image": "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg", "site_name": "Metacritic", "description": "Find a calendar of premiere dates for all upcoming new and returning television shows, plus TV movies and specials."}, "fb": {"app_id": 123113677890173}, "twitter": {"site": "@metacritic", "creator": "@metacritic", "card": "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg"}}, "movies": [], "publish_date": null, "source": "https://www.metacritic.com", "summary": ""}