{"url": "https://www.wrestlinginc.com/news/2017/10/total-divas-s7-e1-recap-633631/", "text": "For the benefit of the H8RZ who believe that no one watches wrestling shows that take place out of the ring, Total Divas is here to school you for its seventh season (seventh!).\n\nThere are a few things that make Total Divas (and Total Bellas) different from other wrestling shows, but the biggest difference, of course, is that the stars of the show use their real names, not their ring names. It’s the reason that, for example, Daniel Bryan was referred to as “Bryan” throughout the episodes of Total Bellas this past season, and why Carmella (for example) will be referred to as “Leah.”\n\nOur girl Nikki Bella, fresh off her ignoble exit from Dancing with the Stars (she was robbed, ROBBED we tell you!), will now serve as the executive producer of the hit E! show, because GET MONEY, NIKKI.\n\nSo, let’s get right to the meat and potatoes of the season premiere (THE SEVENTH ONE, H8RZ!)\n\nWe kick off with Carmella, Naomi, and Nattie (Natalya) backstage at SmackDown Live, and a funny incident with Nattie’s bra reminds us — again — that these women are human and hilarious.\n\nNatalya pointed out that this is the first time in the company’s history that the “women’s revolution” has taken over — for those of us who are old enough to remember, we’ve come a long way from the days of Miss Elizabeth (RIP) and women wrestlers being little more than arm candy for the, uh, macho men of the ring. (See the success of the Netflix series GLOW for further evidence.)\n\nThe women find out that Money in the Bank will feature the first-ever women’s ladder match, and Shane McMahon — the SmackDown commissioner — confirmed it.\n\nThen, Total Divas takes off to Pensacola, FL, where we see Naomi (Trinity) come home to her husband, Jimmy Uso (Jon). (Really, who better than other wrestlers to marry each other…)\n\nYou can tell, though, that the two of them aren’t used to being alphas — even though they’ve been married for three years — because they spat about who’s going to be the one to start dinner, and, per Trinity, the “romance department” is very lacking. (With the way they carry their belts around all the time, you have to wonder if they even wear their belts in bed…)\n\nSo, Jon decides that they’re going to go to dinner to a drive-through, because apparently, they’re 15 years old. He even went so far as to suggest that Trinity get “drive-through spaghetti,” which sounds as nasty as it looks. We’re with Trinity on this one — adults need to go out to dinner to a place that doesn’t have pictures on the menu.\n\nIn the next Total Divas segment, Brie is playing with baby Birdie — who is the spitting image of her father, Daniel Bryan. We see a preview of Winston’s butt — whom, you will recall from this past season of Total Bellas, was the subject of a much-contested Puppy Custody battle between Brie and her twin sister, Nikki — and Bryan, who comes in and volunteers that he’ll be able to change baby Birdie if needed. Brie tells us that Bryan has received paternity leave, which she finds to be remarkable (even though many larger companies, today, offer fathers paternity leave in the same way they offer mothers maternity leave).\n\nUltimately, it’s Nikki who ends up feeding her niece, which is the perfect segue into her Total Divas segment, where she talks about her neck, her back, and…her engagement. (Was your mind in the gutter again?)\n\nNikki thinks that she would be a good substitute as GM on SmackDown, especially since Bryan is out on paternity leave, and especially since she can’t participate in the Money in the Bank ladder match.\n\nWe then switch over to the Monday Night Raw camp, where we see Maryse, Alexa Bliss — who, impressively, is the first woman to be both the Raw and the SmackDown woman’s champion — and Nia Jax, who is a cousin of The Rock (as is, apparently, half of the WWE roster). Maryse is still trying to get to know her new teammates on the Raw roster, but she seems to be holding her own and making friends with everyone. Nia Jax, too, is doing her part to make Maryse feel comfortable.\n\nMaryse, for her part, feels “different” as a result of her shift from active Diva wrestler to Miz manager (the poor dear), but she still sees herself as a “success” with the company.\n\nBack in Pensacola, Trinity and Jon are on a romantic date to a historic lighthouse in the area, adding a bit of romance to an otherwise terrible date (seriously, DRIVE THROUGH SPAGHETTI? That doesn’t even sound good!).\n\nWe then move on to Rusev and Lana’s Total Divas segment, and the first thing we notice is that Lana’s “Russian” accent has disappeared, in place of a Valley Girl California accent. (Rusev’s accent is still intact, however, though not as exaggerated as when he’s in the ring.) Lana’s moving from being Rusev’s manager to being a Diva all on her own, and needless to say, she’s struggling. (What, the “pink wedding cake” incident with Roman “Bae” Reigns wasn’t enough for you?)\n\nThe next part of the show features a special guest appearance by Nattie’s dad, Jim “The Anvil” Neihardt (#CALLBACK to the WWF!). She needed some advice on her first-ever ladder match, especially since she would be part of a historic ladder match (being that it’s the first ever, all-women’s Money in the Bank ladder match), but “The Anvil” assures her that it’s “easy peasy,” though he may be biased, since he’s been in ladder matches from a time before the WWE was even in existence. Watching Nattie train with “The Anvil,” while funny, is also another nice #CALLBACK to WWF fans.\n\nBack in Pensacola, Jon takes Trinity to “La Restaurante Uso,” which is basically little more than an excuse for Jon to stay home and cook for his dearly beloved. However, as Trinity rightly points out, it’s the fact that Jon keeps “trying” that matters to her, and Jon points out that it’s the “thought” that counts when it comes to a gift for his wife.\n\nOf course, it’s later revealed that Jon had it all catered out, rather than cook the meal itself, but it doesn’t matter, because it’s a cute moment for the couple.\n\nBack in the Bella house, the Danielson family is having a nice family moment when Bryan springs on Brie that he has to go to Toronto for work. Needless to say, Brie takes it as well as you think she would, but eventually accepts that “she’s got it” because Bryan gave her the confidence as a mother to feel as such.\n\nA week before Money in the Bank, Nikki has a pre-event pool party (which is really hilarious to watch, considering how, outside of Total Divas, these women tear each other’s hair out — usually, reality shows are the other way around, in that real life is very fun, while the show is exaggeratingly dramatic, but that’s what makes this show fun).\n\nNikki and Nattie give Lana the best advice they have — with Nikki recalling her WrestleMania win — while also reminding Rusev that she’s not going to do anything that makes her hurt herself.\n\nThe season premiere of Total Divas closes out with the girls walking to the Money in the Bank ring (dun dun duuuuun!), where surely, in the next episode, we will see who goes home with MONEY. IN. THE. BAAAAANNNNK!\n\nHave a news tip or correction? Send it to [email protected]\n\nSign up for Wrestling Inc. Breaking News Alerts", "images": ["https://149566639.v2.pressablecdn.com/wp-content/uploads/2020/12/ios-app.png", "https://149566639.v2.pressablecdn.com/wp-content/uploads/2020/12/winc-logo.png", "https://i0.wp.com/www.wrestlinginc.com/wp-content/uploads/2022/02/Cody-Rhodes-2-scaled.jpg?resize=107%2C60&ssl=1", "https://149566639.v2.pressablecdn.com/wp-content/themes/wrestlinginc/assets/img/breaking-news-alert-v2-1024x1024.jpg", "https://pixel.quantserve.com/pixel/p-31iz6hfFutd16.gif?labels=Domain.wrestlinginc_com,DomainId.272745", "https://149566639.v2.pressablecdn.com/wp-content/uploads/2021/04/rhea-ripley-3-300x169.jpg", "https://149566639.v2.pressablecdn.com/wp-content/uploads/2021/12/facebook.png", "https://149566639.v2.pressablecdn.com/wp-content/uploads/2022/03/austin-kevin-owens-300x169.jpg", "https://149566639.v2.pressablecdn.com/wp-content/uploads/2020/12/google-play.png", "https://149566639.v2.pressablecdn.com/wp-content/uploads/2022/01/the-rock-teremana-300x184.jpg", "https://i0.wp.com/www.wrestlinginc.com/wp-content/uploads/2021/10/cody-rhodes-ring-10-25-21.jpg?resize=107%2C60&ssl=1", "https://i0.wp.com/www.wrestlinginc.com/wp-content/uploads/2021/12/elias.jpg?resize=107%2C60&ssl=1", "https://www2.wrestlinginc.com/assets/lib/counters/wpNews.asp?newsId=99776", "https://i0.wp.com/www.wrestlinginc.com/wp-content/uploads/2022/03/scott-hall-6.jpg?resize=107%2C60&ssl=1", "http://i1.ytimg.com/vi/5uMegKe7CSM/mqdefault.jpg", "https://149566639.v2.pressablecdn.com/wp-content/uploads/2022/03/wwe-nxt-stand-deliver-300x169.jpg", "https://149566639.v2.pressablecdn.com/wp-content/uploads/2022/03/SmackDown-3-11-2022-Brock-Lesnar-300x169.jpg", "https://149566639.v2.pressablecdn.com/wp-content/uploads/2022/01/njpw-strong-300x169.jpg", "https://149566639.v2.pressablecdn.com/wp-content/uploads/2022/03/scott-hall-7-300x173.jpg", "https://149566639.v2.pressablecdn.com/wp-content/uploads/2022/03/chris-jericho-jake-hager-2point0-daniel-garcia-@kimberlasskick-300x176.jpg", "https://149566639.v2.pressablecdn.com/wp-content/uploads/2020/12/f-logo-s.png", "https://i0.wp.com/www.wrestlinginc.com/wp-content/uploads/2021/09/candice-lerae-johnny-gargano-1.jpg?resize=107%2C60&ssl=1", "https://i0.wp.com/www.wrestlinginc.com/wp-content/uploads/2022/03/wwe-scott-hall.jpg?resize=107%2C60&ssl=1", "https://i0.wp.com/www.wrestlinginc.com/wp-content/uploads/2021/05/batista-1.jpg?resize=107%2C60&ssl=1"], "top_img": "http://i1.ytimg.com/vi/5uMegKe7CSM/mqdefault.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.wrestlinginc.com/news/2017/10/total-divas-s7-e1-recap-633631/", "title": "'Total Divas&apos; S7 E1 Recap: Love, Marriage, Babies, And Three New Divas", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "'Total Divas&apos; S7 E1 Recap: Love, Marriage, Babies, And Three New Divas - Wrestling Inc.", "description": "For the benefit of the H8RZ who believe that no one watches wrestling shows that take place out of the ring, Total Divas is here to school you for its seventh season (seventh!). There are a few things that make Total Divas (and Total Bellas) different from other wrestling shows, but the biggest difference, of […]", "url": "https://www.wrestlinginc.com/news/2017/10/total-divas-s7-e1-recap-633631/", "site_name": "Wrestling Inc.", "image": {"identifier": "http://i1.ytimg.com/vi/5uMegKe7CSM/mqdefault.jpg", "width": 1300, "height": 724}}, "article": {"publisher": "https://www.facebook.com/WrestlingINC"}, "twitter": {"card": "summary_large_image", "site": "@WrestlingINC"}, "msapplication-TileImage": "https://149566639.v2.pressablecdn.com/wp-content/uploads/2020/12/cropped-icon-512x512-2-270x270.png", "yandex-verification": "ae84ac393a55231e"}, "movies": [], "publish_date": null, "source": "https://www.wrestlinginc.com", "summary": ""}