{"url": "https://www.latimes.com/entertainment/la-et-entertainment-news-updates-nick-carter-accused-of-rape-by-dream-1511368853-htmlstory.html", "text": "Here are the 2018 SAG Awards nominees’ reactions to their nods\n\nThe on-camera talent recognized during the 24th Screen Actors Guild Award nominations on Wednesday shared their excitement and gratitude for the special honor bestowed upon them by the acting community.\n\nThe SAG Awards serve up laurels for actors and ensemble casts working in television and film as voted by their peers. The awards show, hosted by “The Good Place” star Kristen Bell, will take place on Jan. 21.\n\nLIST: The 2018 SAG Award nominees\n\nIn statements to the Los Angeles Times, several nominees repeatedly thanked their drama families, particularly the casts and crews of their respective projects. Here’s what some of them had to say about the recognition:\n\nAlison Brie. (Carolyn Cole / Los Angeles Times)\n\nAlison Brie, “GLOW”\n\n“It is such a great honor to be recognized by my fellow actors with this nomination. I am so proud to be part of a show that celebrates the craft of acting, with all its pitfalls and glories, and to be able to work with such a diverse group of insanely talented women. ‘GLOW’ has meant the world to me and I’m deeply thankful for this recognition for me and the cast. Thank you SAG-AFTRA!!”\n\nMillie Bobby Brown. (Mark Boster / Los Angeles Times)\n\nMillie Bobby Brown, “Stranger Things”\n\n“Screen Actors Guild! Thank you SO much for recognizing me and our cast for the second year in a row! This means the world coming from you, our peers. I am so lucky and honored to have the privilege of playing Eleven — a strong, powerful, badass, strange, wonderful character! Can’t wait to celebrate with my ‘Stranger Things’ family!”\n\nTimothée Chalamet. (Kirk McKoy / Los Angeles Times)\n\nTimothée Chalamet, “Call Me By Your Name”\n\n“What an incredible morning! This nomination is very close to my heart because it’s from the actor. When we made ‘Call Me By Your Name,’ we had no idea what it would turn into. The experience in making the film with Armie [Hammer] was so special, and yet, we just didn’t know. Simply put, I’ve been blown away by the response this film has received. And, to be included in ensemble along with my ‘Lady Bird’ family (congrats, Saoirse [Ronan]!) makes this recognition that much more special.”\n\nDavid Harbour. (Kirk McKoy / Los Angeles Times)\n\nDavid Harbour, “Stranger Things”\n\n”If it isn’t wildly apparent by now, I’ll say it directly — I love actors! To be recognized by my peers in such distinguished company gives me a special joy. And Millie [Bobby Brown] and the show! Beyond.\n\n“When I act, when I create, I feel alive, full to bursting, and I feel of service to the mysterious goodness that firmly exists in this world. I have been rewarded with a life that indulges in the primacy of self, but at its core and at its purest and its best, it is a life of service. A service to audiences. To prod and poke when necessary, to comfort and entertain when times seem dark, to ever expand the human experience, to offer a reason to live, to celebrate to the gods the great gift and scourge that is consciousness. Sometimes it means expressing iron intellect and rigorous truth that bonds us all in the achingly profound wisdom of no escape. Sometimes it means revealing the intimate moments of endurance, of unexpected kindness, unasked for love. And sometimes it simply means making a fierce and joyful noise, to spin, to twirl, to throw your hands up with the relentless dips and climb aboard this roller coaster of life. Ya know, to dance. *insert Hopper dancing gif*\n\n“Thank you for recognizing me, as it might mean it’ll be easier to get more jobs doing it.”\n\nSally Hawkins, “The Shape of Water”\n\n“I am beyond thrilled to have received the honor of this nomination. And to receive it from fellow colleagues is huge to me. Guillermo [del Toro], this film and the entire cast and crew hold a very special place in my heart and always will. Each and every one of them made me better. I am truly delighted more than I can really express in words but my heart is fit to burst with pride for us all. Thank you dearest SAG members. Thank you for your embrace.”\n\nSean Hayes. (Al Seib / Los Angeles Times)\n\nSean Hayes, “Will & Grace”\n\n“I am so honored to be recognized in this category with these extraordinary actors. I love acting because I love actors. I also like to bake sometimes.”\n\nRichard Jenkins. (Jay L. Clendenin / Los Angeles Times)\n\nRichard Jenkins, “The Shape of Water“\n\n“I am thrilled and humbled to be nominated by my peers for a SAG Award. This union is very close to my heart. Well, the SAG card is in my wallet, so it’s a little further south.”\n\nZoe Kazan. (Allen J. Schaben / Los Angeles Times)\n\nZoe Kazan, “The Big Sick”\n\n“Thank you to SAG for honoring ‘The Big Sick’ ensemble with a nomination. It means so much to us, especially from our acting peers. I am deeply proud to be a part of this film and to have brought Kumail [Nanjiani] and Emily [V. Gordon]’s story into the world, especially at this time. We are particularly moved to have been recognized as an ensemble, as this was such an extraordinary collaborative experience I’m excited to be reunited once more with my movie family, and to share this with Kumail, Holly [Hunter], Ray [Romano], Zenobia [Shroff], Anupam [Kher], and Adeel [Akhtar]— and everyone else who helped bring ‘The Big Sick’ to life.”\n\nNicole Kidman. (Jay L. Clendenin / Los Angeles Times)\n\nNicole Kidman, “Big Little Lies”\n\n“What an amazing morning! Thank you to SAG-AFTRA for recognizing ‘Big Little Lies’ in such a significant way. I’ve been acting since I was 14 and have dedicated an enormous amount of my life to my craft so to be acknowledged by my acting family is the most incredible honor.”\n\nJason Bateman and Laura Linney. (Jay L. Clendenin / Los Angeles Times)\n\nLaura Linney, “Ozark”\n\n“I am so proud to be included in a list of such wonderful actresses who have raised the bar so high. What an amazing year for women in television. And I am especially proud to be representing ‘Ozark’ with my TV spouse, the ever deserving Jason Bateman! Thank you SAG-AFTRA!”\n\nMarc Maron. (Lawrence K. Ho / Los Angeles Times)\n\nMarc Maron, “GLOW”\n\n“I am stunned and excited to be recognized by other actors in this way. I really never thought this was possible in my life. It helps to be surrounded by amazing actors and to have such a defined and well written character as Sam Sylvia and to be on a show as unique as ‘GLOW.’ I am just a small part. So, thanks SAG for recognizing me and the mind-blowing ensemble that is ‘GLOW.’”\n\nKumail Nanjiani and Emily V. Gordon. (Kirk McKoy / Los Angeles Times)\n\nKumail Nanjiani and Emily V. Gordon, “The Big Sick”\n\n“We are so lucky to have been graced with the enormous talents of every single member of our cast. They each put a piece of themselves into our story and we are thrilled at being recognized. Thank you. And a special shout out to Holly Hunter’s individual nomination!\n\n“Now we have to go tell our real parents that they aren’t actually nominated.”\n\nBob Odenkirk. (Carolyn Cole / Los Angeles Times)\n\nBob Odenkirk, “Better Call Saul”\n\n“I am thrilled to get this nomination from my fellow actors! At ‘Better Call Saul’ I am surrounded by an ensemble of excellence — Michael McKean, Rhea Seehorn, Jonathan Banks, everybody raises my game. Thank you to SAG-AFTRA.”\n\nGary Oldman. (Carolyn Cole / Los Angeles Times)\n\nGary Oldman, “The Darkest Hour”\n\n“No actor could ever deny the special satisfaction that comes from being recognized by your fellow artists … we all share the same challenges, insecurities, and uncertainties, chief among them, the question ‘am I any good?’… this nomination, and in the wonderful company of the other nominees, is so very satisfying.”\n\nMargot Robbie. (Jay L. Clendenin / Los Angeles Times)\n\nMargot Robbie, “I, Tonya”\n\n“I’m so incredibly moved and excited to be nominated by my fellow actors. I feel very fortunate to be able to have had the opportunity to bring Tonya’s story to the big screen. Thank you to Steven [Rogers] for his brilliant and unique script, to Allison [Janney] and Sebastian [Stan] for being such incredible screen partners and to Craig [Gillespie] for his amazing direction and perfectly capturing the tone and essence of the film. I’m so honored to be recognized among the truly powerful and wonderful women in the category. I can’t wait to celebrate with everyone.”\n\nSam Rockwell. (Jay L. Clendenin / Los Angeles Times)\n\nSam Rockwell, “Three Billboards Outside Ebbing, Missouri”\n\n“It is such an honor to be nominated by your fellow actors, I have been a proud member of the Screen Actors Guild for as long as I can remember. To share it with this wonderful ensemble whom I have had the pleasure to work with over the years and others I got to collaborate with for the first time is truly special. I want to thank Martin McDonagh, our director and writer, for crafting these characters, as well as Woody [Harrelson], Fran [McDormand] and the rest of the cast who brought the town of Ebbing to life on screen. I am thrilled.”\n\nRay Romano. (Kirk McKoy / Los Angeles Times)\n\nRay Romano, “The Big Sick”\n\n“This is awesome but I won’t believe it till the recount.”", "images": ["https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.latimes.com/entertainment/la-et-entertainment-news-updates-november-2017-htmlstory.html", "title": "Today in Entertainment: America Ferrera is pregnant with first child; New Justin Timberlake album coming Feb. 2", "meta_data": {"og": {"title": "Today in Entertainment: America Ferrera is pregnant with first child; New Justin Timberlake album coming Feb. 2", "url": "https://www.latimes.com/entertainment/la-et-entertainment-news-updates-november-2017-htmlstory.html", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "url": "https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "width": 1200, "height": 630, "type": "image/jpeg", "alt": "LA Times logo"}, "description": "Here's what's new and interesting in entertainment and the arts:‘Superstore’ star America Ferrera is pregnant with her first childE! orders 'Citizen Rose,' documentary series about Rose McGowanNew Justin Timberlake album coming Feb. 2 ahead of Super Bowl performanceJessica Alba, Cash Warren welcome…", "site_name": "Los Angeles Times", "type": "website"}, "twitter": {"card": "summary_large_image", "description": "Here's what's new and interesting in entertainment and the arts:‘Superstore’ star America Ferrera is pregnant with her first childE! orders 'Citizen Rose,' documentary series about Rose McGowanNew Justin Timberlake album coming Feb. 2 ahead of Super Bowl performanceJessica Alba, Cash Warren welcome a third child — their first baby boyAs Gretchen Carlson gets Miss America job, Mallory Hagan says, ‘We did it’", "site": "@latimes", "title": "Today in Entertainment: America Ferrera is pregnant with first child; New Justin Timberlake album coming Feb. 2"}, "fb": {"app_id": 134435029966155, "pages": 5863113009}, "viewport": "width=device-width,initial-scale=1", "description": "Here's what's new and interesting in entertainment and the arts:‘Superstore’ star America Ferrera is pregnant with her first childE! orders 'Citizen Rose,' documentary series about Rose McGowanNew Justin Timberlake album coming Feb. 2 ahead of Super Bowl performanceJessica Alba, Cash Warren welcome a third child — their first baby boyAs Gretchen Carlson gets Miss America job, Mallory Hagan says, ‘We did it’", "brightspot.contentId": "0000016c-68c4-d4d6-a16e-eaef188a0000", "brightspot.cached": "false"}, "movies": [], "publish_date": null, "source": "https://www.latimes.com", "summary": ""}