{"url": "https://www.playboy.com/read/introducing-your-2018-playmate-of-the-year-nina-daniele", "text": "It’s connected, as you said, to how confident you are. Sexiness is how you feel, and of course how people feel about you. Everybody says it, but even Helen Mirren at her age is sexy. Has your definition changed at all over the past year? What does it mean to be a Playmate today?\n\nWe talked about that in my first interview in the magazine, and it reaffirmed my position in this movement that we’re going through as women: We can’t all speak for ourselves individually. When we speak, we have to speak for all women, and I think Playboy gives us the foundation to do that.\n\nSo what now? Do you want to be an actress, a brain surgeon? Where’s it going?\n\nI used to be the type of person who would start a million projects. I played the violin for seven years, I took karate for four or five, I played for my college tennis team, I did swimming, I did every type of dance, I played multiple instruments—then I decided I wanted to be a stockbroker, then a vet, then a crime-scene investigator, then an EMT. Modeling is, to this day, the only thing I’ve stuck with. It’s a waiting game, and no one tells you that. The longer you’re in the industry, the better your chances of success, whether that’s in front of the camera or behind it. When I was finishing college, I wanted to be a writing teacher. Back then I didn’t realize that when you used a credit card you had to pay it back, so all my credit cards were maxed out, and I had a job that barely made me enough money. I was still living at home, and the idea that I could make more than $60 a day really blew my mind. I would still love to teach young people, but not from within a school environment.\n\nYou can still teach some things. Down the road, you might be doing tours as a motivational speaker.\n\nIt’s possible. Anything is possible when you follow your dreams.\n\nDon’t forget that.\n\nKey Holders Can Now Unlock Nina’s NSFW Pictorial", "images": ["https://images.ctfassets.net/jca811l64s20/4TlUqgZMdMNPxWBKq2Y10b/023f1cef0a9fd3b37961cc74926a5f5e/PMOY_NinaDaniele_article_16x9_SFW.jpg?w=1200&q=55&fm=jpg&fl=progressive", "https://cdnjs.cloudflare.com/ajax/libs/flag-icon-css/3.5.0/flags/1x1/pl.svg"], "top_img": "https://images.ctfassets.net/jca811l64s20/4TlUqgZMdMNPxWBKq2Y10b/023f1cef0a9fd3b37961cc74926a5f5e/PMOY_NinaDaniele_article_16x9_SFW.jpg?w=1200&q=55&fm=jpg&fl=progressive", "keywords": [], "authors": [], "canonical_link": "https://www.playboy.com/read/introducing-your-2018-playmate-of-the-year-nina-daniele", "title": "Introducing Playboy's 2018 Playmate of the Year Nina Daniele", "meta_data": {"google-site-verification": "RUMZ-FCFG4yv5sz8h5S9XB3GFaLUmqxl60MNOBFU9KM", "viewport": "initial-scale=1.0, width=device-width, maximum-scale=1", "title": "Introducing Playboy's 2018 Playmate of the Year Nina Daniele", "description": "Introducing Playboy's 2018 Playmate of the Year Nina Daniele", "twitter": {"card": "summary_large_image", "description": "Introducing Playboy's 2018 Playmate of the Year Nina Daniele", "title": "Introducing Your 2018 Playmate of the Year, Nina Daniele", "image": "https://images.ctfassets.net/jca811l64s20/4TlUqgZMdMNPxWBKq2Y10b/023f1cef0a9fd3b37961cc74926a5f5e/PMOY_NinaDaniele_article_16x9_SFW.jpg?w=1200&q=55&fm=jpg&fl=progressive"}, "og": {"type": "article", "description": "Introducing Playboy's 2018 Playmate of the Year Nina Daniele", "title": "Introducing Your 2018 Playmate of the Year, Nina Daniele", "url": "https://www.playboy.com/read/introducing-your-2018-playmate-of-the-year-nina-daniele", "image": "https://images.ctfassets.net/jca811l64s20/4TlUqgZMdMNPxWBKq2Y10b/023f1cef0a9fd3b37961cc74926a5f5e/PMOY_NinaDaniele_article_16x9_SFW.jpg?w=1200&q=55&fm=jpg&fl=progressive"}, "next-head-count": 16}, "movies": [], "publish_date": null, "source": "https://www.playboy.com", "summary": ""}