{"url": "https://en.wikipedia.org/wiki/Head_of_the_Commonwealth", "text": "Symbolic head of association of independent states\n\nHead of the Commonwealth is a title used by the ceremonial leader who symbolises \"the free association of independent member nations\" of the Commonwealth of Nations, an intergovernmental organisation that currently comprises fifty-four sovereign states. There is no set term of office or term limit and the role itself involves no part in the day-to-day governance of any of the member states within the Commonwealth. The title has been held by the reigning British monarch since its establishment.\n\nBy 1949, the British Commonwealth was a group of eight countries, each having King George VI as monarch. India, however, desired to become a republic, but not to leave the Commonwealth by doing so. This was accommodated by the creation of the title Head of the Commonwealth for the King, and India became a republic in 1950. Subsequently, many other nations including Pakistan, Sri Lanka, Ghana and Singapore ceased to recognise the monarch of the United Kingdom as their respective head of state, but recognised the British monarch as Head of the Commonwealth as members of the Commonwealth of Nations.[1]\n\nThe title is currently held by Queen Elizabeth II, George VI's elder daughter. Charles, Prince of Wales, was appointed her designated successor at the Commonwealth Heads of Government Meeting 2018.\n\nHistory [ edit ]\n\nThe Commonwealth Prime Ministers with the King at Buckingham Palace for the Commonwealth Prime Ministers' Conference, 1949\n\nIn 1949, King George VI was king of each of the countries that then comprised the British Commonwealth (later the Commonwealth of Nations): the United Kingdom, Canada, Australia, New Zealand, South Africa, India, Pakistan, and Ceylon. However, the Indian Cabinet desired the country to become a republic, but not to leave the Commonwealth as a consequence of no longer having George VI as king, as happened to Ireland. To accommodate this, the London Declaration issued in late April 1949,[2][3][4][5] and devised by Canadian prime minister Louis St. Laurent, stated that the King, as the symbol of the free association of the countries of the Commonwealth, was the head of the Commonwealth. When India adopted a republican constitution on 26 January 1950, George VI ceased to be its monarch (the president of India, Rajendra Prasad, became head of state), but it did regard him as Head of the Commonwealth.\n\nElizabeth II became Head of the Commonwealth on her accession in 1952, stating at the time, \"The Commonwealth bears no resemblance to the empires of the past. It is an entirely new conception built on the highest qualities of the spirit of man: friendship, loyalty, and the desire for freedom and peace.\"[6] The following year, a Royal Style and Titles Act was passed in each of the Commonwealth realms, adding for the first time the term Head of the Commonwealth to the monarch's titles.\n\nIn December 1960, the Queen had a personal flag created to symbolise her as Head of the Commonwealth and not associated with her role as queen of any particular country. Over time, the flag has replaced the British Royal Standard when the Queen visits Commonwealth countries of which she is not head of state (and thus does not possess a unique royal standard for that state) and on Commonwealth occasions in the United Kingdom. When the Queen visits the headquarters of the Commonwealth Secretariat in London, this personal standard—not any of her royal standards—is raised.[7]\n\nFormer Canadian Prime Minister Brian Mulroney said Elizabeth was a \"behind the scenes force\" in ending apartheid in South Africa.[8][9][non sequitur]\n\nTitle [ edit ]\n\nThe title was devised in the London Declaration as a result of discussions at the 1949 Commonwealth Prime Ministers' Conference. It is rendered in Latin as Consortionis Populorum Princeps,[10][11][12] and in French as Chef du Commonwealth.[13]\n\nRoles and duties [ edit ]\n\nThe Head of the Commonwealth, currently Queen Elizabeth II, is recognised by the members of the Commonwealth of Nations as the \"symbol of their free association\" and serves as a leader, alongside the Commonwealth Secretary-General and Commonwealth Chair-in-Office. Although Queen Elizabeth II is head of state in 15 members of the Commonwealth, she does not have any role in the governance of any Commonwealth state as Head of the Commonwealth itself. The Queen keeps in touch with Commonwealth developments through regular contact with the Commonwealth Secretary General and the Secretariat, the Commonwealth's central organisation.[14]\n\nThe head of the Commonwealth or a representative (such as Charles, Prince of Wales) attends the biennial Commonwealth Heads of Government Meeting (CHOGM), held at locations throughout the Commonwealth. This is a tradition begun by the monarch on the advice of Canadian Prime Minister Pierre Trudeau in 1973,[15] when the CHOGM was first held in Canada. During the summit, the head of the Commonwealth has a series of private meetings with Commonwealth countries' leaders, attends a CHOGM reception and dinner, and makes a general speech.\n\nThe Queen or her representative is also present at the quadrennial Commonwealth Games. The Queen's Baton Relay, held prior to the beginning of the Commonwealth Games, carries a message from the Head of the Commonwealth to all Commonwealth Nations and territories.[16][17]\n\nEvery year on Commonwealth Day, the second Monday in March, the Queen broadcasts a special message to all the peoples of the Commonwealth, about 2.5 billion people.[18] That same day, she attends the inter-denominational Commonwealth Day Service held at Westminster Abbey.[19]\n\nThe Queen and Commonwealth Prime Ministers at Windsor Castle, 1960\n\nThe Queen at the Closing Ceremony of the Brisbane Commonwealth Games, 1982\n\nThe Queen passing the Baton to President Patil of India for the Baton relay for the Delhi Commonwealth Games, 2009\n\nThe Queen arriving at the Commonwealth Games Opening Ceremony at Glasgow, 2014\n\nSuccession [ edit ]\n\nThe Head of the Commonwealth delivering the inaugural address at the CHOGM 2011 in Perth, Australia\n\nBy 2018, with the Queen in her 90s, and the position of \"Head of the Commonwealth\" not technically hereditary, talks as to whether or not Prince Charles or someone else should become the third person to hold it had been going on for some time.[20] The London Declaration states that \"The King [acts] as the symbol of the free association of its independent member nations and as such the Head of the Commonwealth\", whereby both republics and kingdoms that are not Commonwealth realms can recognise the monarch as Head of the Commonwealth without accepting the person as the country's head of state. However, though each Commonwealth realm's laws on royal titles and styles make Head of the Commonwealth part of the reigning monarch's full title, and Queen Elizabeth II declared in 1958, through the Letters Patent creating her son, Prince Charles, as Prince of Wales, that Charles and his heirs and successors shall be future heads of the Commonwealth,[21] there have been conflicting statements on how successors to the position of Head of the Commonwealth are chosen. The Commonwealth Secretariat asserts any successor will be chosen collectively by the Commonwealth heads of government.[22] Commonwealth heads of government, such as the then Canadian Prime Minister Stephen Harper, had already referred to Prince Charles as \"the future head of the Commonwealth\",[23] and in 2015 the then Prime Minister of New Zealand John Key said, \"The title [of Head of the Commonwealth] should just go with the Crown\".[24]\n\nCommentators in British newspapers discussed whether it should be a one-off decision to elect Prince Charles to the headship, whether the British monarch should automatically become head of the Commonwealth, or whether the post should be elected or chosen by consensus.[25][26][27] There was also speculation that a rotating ceremonial \"republican\" headship might be instituted.[28][29] The Daily Telegraph reported that \"the post is not hereditary and many leaders want an elected head to make the organisation more democratic.\"[30]\n\nIn 2018, following the 2018 Commonwealth Heads of Government Meeting, Commonwealth leaders declared that Charles would be the next head of the Commonwealth.[31] The role remains non-hereditary.[32][33]\n\nList of heads [ edit ]\n\nNo. Portrait Name Birth Term Death Start End Duration 1 George VI 14 December 1895 26/28 April 1949[n 1] 6 February 1952 2 years, 284 days 6 February 1952 2 Elizabeth II 21 April 1926 6 February 1952 Incumbent 70 years, 35 days Living\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/The_President%2C_Smt._Pratibha_Devisingh_Patil_receiving_the_Baton_from_the_Queen_Elizabeth_II%2C_for_Baton_relay_of_XIX_Commonwealth_Games_2010%2C_at_Buckingham_Palace%2C_in_London_on_October_29%2C_2009.jpg/86px-thumbnail.jpg", "https://upload.wikimedia.org/wikipedia/commons/6/68/Elizabeth_II_in_Berlin_2015_%28cropped%29.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Queen_Elizabeth_II_and_the_Prime_Ministers_of_the_Commonwealth_Nations%2C_at_Windsor_Castle_%281960_Commonwealth_Prime_Minister%27s_Conference%29.jpg/165px-Queen_Elizabeth_II_and_the_Prime_Ministers_of_the_Commonwealth_Nations%2C_at_Windsor_Castle_%281960_Commonwealth_Prime_Minister%27s_Conference%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/DSCF6026_Queen_arrives_at_Commonwealth_Games_Opening_Ceremony.jpg/160px-DSCF6026_Queen_arrives_at_Commonwealth_Games_Opening_Ceremony.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Queen_Elizabeth_II_1959.jpg/100px-Queen_Elizabeth_II_1959.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/Her_Majesty_Queen_Elizabeth_II_delivering_the_inaugural_address_at_the_CHOGM_2011_at_Perth_Convention_and_Exhibition_Centre%2C_in_Australia._The_Vice_President%2C_Shri_Mohd._Hamid_Ansari_and_other_Heads_of_States_are_also_seen.jpg/220px-thumbnail.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/Her_Majesty_Queen_Elizabeth_II_at_the_Closing_Ceremony_of_the_XII_Commonwealth_Games%2C_Brisbane.jpg/177px-Her_Majesty_Queen_Elizabeth_II_at_the_Closing_Ceremony_of_the_XII_Commonwealth_Games%2C_Brisbane.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Georg_VI_England.jpg/100px-Georg_VI_England.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Elizabeth_II_in_Berlin_2015_%28cropped%29.JPG/180px-Elizabeth_II_in_Berlin_2015_%28cropped%29.JPG", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Personal_flag_of_Queen_Elizabeth_II.svg/100px-Personal_flag_of_Queen_Elizabeth_II.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/5/54/Commonwealth_Prime_Ministers_in_London_1949.jpg/220px-Commonwealth_Prime_Ministers_in_London_1949.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/6/68/Elizabeth_II_in_Berlin_2015_%28cropped%29.JPG", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Head_of_the_Commonwealth", "title": "Head of the Commonwealth", "meta_data": {"generator": "MediaWiki 1.38.0-wmf.25", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Elizabeth_II_in_Berlin_2015_%28cropped%29.JPG/640px-Elizabeth_II_in_Berlin_2015_%28cropped%29.JPG", "width": 640, "height": 847}, "title": "Head of the Commonwealth - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}