{"url": "https://www.health.com/beauty/behold-kylie-jenners-secret-to-perfectly-shaped-brows", "text": "\"You should not see the white above my iris,\" Whitney Buha shared on Instagram.\n\nChicago lifestyle blogger Whitney Buha has been getting Botox on her face for three years and has always been happy with the results—until now. On her Instagram Story earlier in March, she revealed that after her most recent Botox injections, her left eyebrow was lower than her right (this drooping is medically known as ptosis). She went back to her injector for another four units of Botox to \"lift it and even it out\"—but the end result wasn't what she'd hoped for.\n\n\"Whatever she did relaxed this muscle and now my entire eyelid is drooping,\" Buha said, pointing to her upper eyelid, adding that she thought the injector either gave her too much Botox, or she injected it into the wrong spot.\n\nBotox Real Woman Says It Went Wrong Credit: Getty Images - Design: Alex Sandoval\n\nOver the last couple of weeks, Buha has been desperately searching for a solution, noting that Botox can't be dissolved the way other fillers can. She's also shared regular photo images to monitor the drooping day by day, showing a good sense of humor about the ordeal. And it's not just her left eye that's been affected. \"My right eye is way too big,\" she said on her Story. \"You should not see the white above my iris.\"\n\nBuha consulted with doctors and explained that the change in her right eye was due to it overcompensating for the left eye. \"Because the left eye is closed, it's impairing my vision,\" she said, adding that she hoped when her left eyelid started to open more, her right eye would \"even out.\"\n\nIt's definitely a cautionary tale, but what's an expert's take on it? And first of all, what is Botox, exactly?\n\n\"Botulinum toxin is a neurotoxin that weakens the muscle, preventing it from contracting,\" New York City dermatologist Debra Jaliman, MD, who has taught dermatology at Mount Sinai School of Medicine for over 25 years, tells Health. \"It smooths out the skin overlying the muscle, minimizing facial lines.\"\n\nThe popularity of Botox has skyrocketed in the US over the last decade. According to the latest figures from the American Society for Aesthetic Plastic Surgery (ASAPS), it's been the most sought-after aesthetic treatment for 20 years. In 2019, more than 7.6 million Botox injections were administered—a 4% rise from the previous year and a staggering 878% rise from 2000.\n\nThe most common side effect of Botox is bruising, and some people experience a headache or a sensation of heaviness in the injection site, Dr. Jaliman adds. \"You can get a droopy eye or eyebrows, but this is very rare if it's injected properly,\" she says.\n\nThe most important consideration before getting Botox—whether it's for the first time or the fifth—is how qualified the injector is. \"You should go to a board-certified dermatologist or a plastic surgeon,\" Dr. Jaliman advises. And do your research. \"Go to someone who does a lot of Botox, not someone who just injects occasionally,\" she adds.\n\nIf someone gets drooping eye after Botox, it means it was injected in the wrong muscle, Dr. Jaliman explains. \"People who inject Botox really need to know facial anatomy,\" she says. \"Some take a quick course and think they can do Botox. Many patients look for the cheapest Botox they can find and I think that's a big mistake—cheap Botox is often very diluted [with saline], meaning it moves through the muscle differently.\"\n\nBuha has been told that her drooping eyelid is only temporary, and she hopes to see an improvement within a couple of weeks. \"The worst case scenario is waiting 3-4 months for the Botox to wear off,\" Dr. Jaliman says.\n\nMeanwhile, Buha continues to share her bad Botox experience on Instagram. After taking expert advice, she got another injection of Botox to lift her left eyelid, and she's waiting to get special eye drops designed to help with ptosis.\n\nBuha also revealed that she won't be returning to her previous injector (a registered nurse). \"The plastic surgeon said he's never seen an eye droop as bad as mine,\" she revealed. \"So I will not be going back to the same person for injections.\" She also shared that she'll be nervous to get Botox again, but she will get it. \"When Botox is good, it's really good,\" she told her followers.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=%5B960%2C653%5D&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2021%2F03%2F26%2Fbotox-GettyImages-131908327.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2019%2F10%2Fgettyimages-597061819_0_0.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2019%2F09%2Flie-detector-gettyimages-200027158-001_copy-2000.jpg", "https://www.health.com/img/misc/300x250_magazines_and_more.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2021%2F03%2F26%2Fbotox-GettyImages-131908327.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2020%2F01%2Fflu-gettyimages-854418304-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2022%2F01%2F04%2Fplates-food-GettyImages-1284733154.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2017%2F11%2Fgettyimages-474951090_0-2000.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2067'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2018%2F09%2Fgettyimages-487998567_0-2000.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=%5B960%2C653%5D&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2021%2F03%2F26%2Fbotox-GettyImages-131908327.jpg", "keywords": [], "authors": ["Claire Gillespie", "March"], "canonical_link": "https://www.health.com/beauty/botched-botox-injection-whitney-buha", "title": "This Influencer Has Been Documenting the Bad Botox That Left Her With Misshapen Eyes", "meta_data": {"viewport": "width=device-width,initial-scale=1", "description": "A botched Botox injection left Whitney Buha with one droopy eye and one eye too big, and she's been documenting it on Instagram. See it here.", "robots": "max-image-preview:large", "og": {"title": "This Influencer Is Sharing Photos of Her Misshapen Eyes After a Botox Injection Went Way Wrong: 'You Should Not See the White Above My Iris'", "type": "article", "site_name": "Health.com", "url": "https://www.health.com/beauty/botched-botox-injection-whitney-buha", "description": "A botched Botox injection left Whitney Buha with one droopy eye and one eye too big, and she's been documenting it on Instagram. See it here.", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=%5B960%2C653%5D&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2021%2F03%2F26%2Fbotox-GettyImages-131908327.jpg", "width": 2000, "height": 1000}}, "pinterest": {"url": "https://www.health.com/beauty/botched-botox-injection-whitney-buha", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2021%2F03%2F26%2Fbotox-GettyImages-131908327.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://www.health.com/beauty/botched-botox-injection-whitney-buha", "title": "This Influencer Is Sharing Photos of Her Misshapen Eyes After a Botox Injection Went Way Wrong: 'You Should Not See the White Above My Iris'", "description": "A botched Botox injection left Whitney Buha with one droopy eye and one eye too big, and she's been documenting it on Instagram. See it here.", "site": "@goodhealth", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=%5B960%2C653%5D&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2021%2F03%2F26%2Fbotox-GettyImages-131908327.jpg"}, "fb": {"app_id": 165082593548215, "pages": 10053803772}, "article": {"opinion": "false"}, "url": "https://www.health.com/beauty/botched-botox-injection-whitney-buha"}, "movies": [], "publish_date": null, "source": "https://www.health.com", "summary": ""}