{"url": "https://www.instyle.com/news/3-ways-remove-your-gel-manicure-without-going-salon", "text": "Each product we feature has been independently selected and reviewed by our editorial team. If you make a purchase using the links included, we may earn commission.\n\nIt's easy to wax poetic over the benefits of a gel manicure — two weeks of chip-free wear and glossy shine? Yes, please! Removing the LED-cured lacquer, however, is another story. Once the free edge around the cuticle starts to lift, it takes all of our self-control trying (and sometimes failing...) not to rip all ten shells from our digits — which can cause major damage to the natural nail bed underneath.\n\nWhether you're wearing a gel manicure from the salon or your own handiwork, we've broken down the best and easiest DIY method to effectively remove gel polish — without totally destroying the health of your nails in the process.\n\nWant a daily dose of beauty? Sign up for our FREE daily newsletter, Glow for celebrity hairstyle inspo, skincare tips, major makeup looks, and more direct to your inbox.\n\nYour Gel Manicure Removal Tool Kit\n\n1. Protect your skin.\n\nSince you'll be soaking your nails in acetone, it's important to shield the skin around the nail before getting started. You can use a cuticle oil or cream, or even Vaseline to provide a protective layer.\n\n2. Buff your nails.\n\nThe next step is to buff off the top layer of your gel mani with a coarse nail file, says Sally Hansen global ambassador and nail pro Madeline Poole. The point here is to break open the top layer of gel to help acetone penetrate, she explains. Go slowly and stop once you’ve removed the shine.\n\n3. Soak cotton balls in acetone.\n\nNext, soak a small piece of cotton, or a cotton ball, in acetone and place it on the nail, Poole says. Just be sure this is 100 percent pure acetone, not the standard \"nail polish remover\" sold at your local drugstore. \"Regular nail polish remover contains acetone but is diluted,\" explains Poole. \"You probably could remove gel nails with regular polish remover, but you would have to allow the nails to soak for a very long time. You need pure acetone to effectively and quickly break down the gel polish.\" A bottle of acetone like Pronto's 100% Pure Acetone ($10; amazon.com) will do the trick.\n\n4. Secure the cotton with aluminum foil.\n\nTo hold the cotton or cotton ball in place, grab a roll of tin foil straight from the kitchen or pre-cut squares like these ones from ForPro ($5; amazon.com). Cut into small squares and wrap each finger to secure the cotton ball in place. If you don’t feel coordinated to use the foil method (it can be tricky by the end) Poole also suggests gel removal clip caps ($10; amazon.com)\n\n5. Or, skip the cotton and foil and soak instead.\n\nThis takes a bit longer, but works wonders if you don't have any foil or cotton balls on hand. Grab two bowls from the kitchen, one slightly larger than the other. Fill the larger bowl with warm water, place the smaller one inside as you would with a double-boiler, and pour in some acetone. (Because acetone is highly-flammable, you should not heat it in the microwave or stove.) Allow to heat for a minute or two, then place your hand inside the acetone and allow the gels to gradually soak off.\n\nYou can also grab a gel removal kit — like Red Carpet Manicure's ($10; amazon.com) and Nails Inc.'s Gel-Less Gel Nail Polish Remover Kit ($19; sephora.com) — that comes equipped with everything you need to remove a salon or DIY gel mani. Red Carpet Manicure's kit includes ten foils with a cotton pad attached, while Ciate's comes with conditioning acetone and a gel remover pot in which you pour the solution and dip your hand in.\n\n6. Wait 10 to 15 minutes.\n\nCue up some Netflix and let the acetone to do its job. If you used the soaking method, wait until you notice the corners coming loose, then as your nails are still steeping in the acetone, take an orangewood stick ($4; amazon.com) and gently begin to loosen the gel on each nail until it is removed completely. If you used foils and cotton, the gel manicure should slide off with the cotton ball when you remove the foil. (Just apply a bit of pressure.) If some residue remains stuck to your nail, again, use an orangewood stick to work it off. \"When removing my own gels I use my thumbnail to scrape the softened gel off. I find it gets very close to the nail, but doesn’t hurt it,” Poole says.\n\nIf the gel polish is being stubborn give it another five minutes to soak and then try again — patience is key here. The nails should soak until the gel appears to be bubbling, Poole says. This could take 10 minutes — but Poole says it’s often longer. A good rule of thumb: Don't scrape off the polish until it's fully softened, she says.\n\n7. Give your nails some TLC.\n\nAcetone is drying, so it's important to restore moisture to your nails and hands after a DIY removal.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F14%2F2022%2F02%2F01%2F020122-Pisces-Compatibility-Lead-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F14%2F2021%2F02%2F26%2Fnaked-dresses-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=%5B800%2C1000%5D&w=1600&h=800&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F14%2F2015%2F02%2F28%2F101818-manicure-lead-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F14%2F2019%2F09%2F06%2F090519-shapewear-spanx-lead.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F14%2F2022%2F02%2F11%2FTUNDE-HEADSHOT57-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F14%2F2022%2F02%2F04%2FInStyle-March-Sam-Visser-Lead-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F14%2F2022%2F02%2F08%2F020822-Oscars-Snubs-Lead-2000.jpg", "https://www.instyle.com/img/misc/300x250_magazines_and_more.jpg", "https://www.instyle.com/img/icons/generic-image.svg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F14%2F2021%2F04%2F27%2F042721_choosing_color_lead-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F14%2F2020%2F12%2F01%2F111120-laura-brown-instyle-podcast-hero-2000.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=%5B800%2C1000%5D&w=1600&h=800&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F14%2F2015%2F02%2F28%2F101818-manicure-lead-2000.jpg", "keywords": [], "authors": ["Marianne Mychaskiw", "Victoria Moorhouse", "Updated Jul"], "canonical_link": "https://www.instyle.com/news/3-ways-remove-your-gel-manicure-without-going-salon", "title": "How to Remove Gel Nail Polish: How to Remove Your Gel Manicure At Home", "meta_data": {"viewport": "width=device-width,initial-scale=1", "keywords": "Beauty", "news_keywords": "Beauty", "description": "Here's exactly how to do a DIY gel manicure removal at home - without destroying your nails in the process.", "robots": "max-image-preview:large", "og": {"title": "How to Remove Your Gel Manicure At Home", "type": "article", "site_name": "InStyle", "url": "https://www.instyle.com/news/3-ways-remove-your-gel-manicure-without-going-salon", "description": "Here's exactly how to do a DIY gel manicure removal at home - without destroying your nails in the process.", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=%5B800%2C1000%5D&w=1600&h=800&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F14%2F2015%2F02%2F28%2F101818-manicure-lead-2000.jpg", "width": 1600, "height": 800}}, "pinterest": {"url": "https://www.instyle.com/news/3-ways-remove-your-gel-manicure-without-going-salon", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F14%2F2015%2F02%2F28%2F050417-gel-manicure-pinterest.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://www.instyle.com/news/3-ways-remove-your-gel-manicure-without-going-salon", "title": "How to Remove Your Gel Manicure At Home", "description": "Here's exactly how to do a DIY gel manicure removal at home - without destroying your nails in the process.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=%5B800%2C1000%5D&w=1600&h=800&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F14%2F2015%2F02%2F28%2F101818-manicure-lead-2000.jpg"}, "fb": {"app_id": 1846286175658788, "pages": 18938064984}, "url": "https://www.instyle.com/news/3-ways-remove-your-gel-manicure-without-going-salon"}, "movies": [], "publish_date": null, "source": "https://www.instyle.com", "summary": ""}