{"url": "https://www.latimes.com/entertainment/la-et-entertainment-news-updates-april-ben-affleck-jennifer-garner-divorce-1492125401-htmlstory.html", "text": "Caitlyn Jenner memoir’s version of life with Kris Jenner creates a new rift in the family\n\n(Dimitrios Kambouris / Getty Images)\n\nAs Caitlyn Jenner’s just-published memoir “The Secrets of My Life” pulls back the curtain on her gender transition and her life among the Kardashians, not everybody is taking it well.\n\nEspecially not Kris Jenner.\n\nDetails about the Olympian-turned-reality-star’s decision to transition in 2015 from Bruce Jenner to Caitlyn Jenner and confirmation that she had her final gender reassignment surgery are all in the book, but some dishy material about the Kardashian matriarch is reverberating with fans and upsetting the reigning first family of reality TV.\n\nThe memoir, co-written by Buzz Bissinger, who penned the Vanity Fair article that introduced Caitlyn Jenner to the masses, has some kind words for the momager, including admiration for Kris’ connections, her business acumen and her ability to perfectly apply lip liner without a mirror.\n\nHowever, Caitlyn also said in the book that she told Kris about her gender issues before they got married and said Kris knew that for 4½ years before they met, Caitlyn had been on hormones. Additionally, Caitlyn wrote that she told Kris about her gender problems before they would make love.\n\n“I told her there had been a woman inside me all my life,” she wrote.\n\nThe couple announced their split in 2013 and finalized their divorce in 2014. During their decades-long union, Caitlyn cross-dressed in front of her ex but was asked by Kris to do it only while traveling, so that their children wouldn’t get wind of it. It was something Caitlyn grew to resent, she said, and she would steal her wife’s gowns and purses to wear while traveling. (Their differing takes on their marital woes have been a topic of discussion for years.)\n\nIn a recent episode of “Keeping Up With the Kardashians,” Kris fumed with anger about passages in “The Secrets of My Life” that claimed she knew Caitlyn was transgender before they wed.\n\n“None of it makes sense,”Kris said to daughters Khloe and Kim Kardashian. “I read it and basically the only nice thing she had to say was that I was great socially at a party one time. ... Everything she says is all made up. Why does everything have to be that Kris is such a bitch?”\n\nShe added: “I’ve never been so angry and disappointed in somebody in my whole life.”\n\nIn response, the Olympic gold medalist said on “Good Morning America” that the book is “extraordinarily honest.”\n\n“It is my perspective, and obviously when you do a book like that, there are different opinions. I have a lot of friends that know the truth and know what I’ve been through and know the whole situation,” Caitlyn said.\n\nShe told Andy Cohen that in the wake of publishing, Kris said she didn’t want to talk to Caitlyn ever again. (Caitlyn also elaborated on her claims that she was a “punching bag” on the show and a revelation that Kris had been in charge of her finances.)\n\n“Honestly, I never had a low point [while doing the show], actually, until the other day when Kris said some of that stuff. It was the first time I was really upset,” she said. “I had some of the best conversations with my children on that show. ... It forces you to deal with issues. ... It forces you to sit down with your kids and deal with a lot of things.”\n\nMeanwhile, Kim Kardashian, Kris Jenner’s second-born child with the late Robert Kardashian, shared her thoughts on the feud on “The Ellen DeGeneres Show” in an episode that aired Thursday.\n\n“My heart breaks for my mom, you know, because I feel like she’s been through so much and [Caitlyn is] promoting this book and she’s saying all these things,” Kardashian said. “I just don’t think it’s necessary and I just feel like it’s unfair. Things aren’t truthful.”\n\nKardashian said Caitlyn was dishonest “with certain things” about Kris in the book.\n\n“I feel like it’s taken [Caitlyn] a really long time to be honest with herself, so I don’t expect her to be honest about my mom now. But it’s just so hurtful,” she said. “I wish her all the success in the world, but not at our expense.”\n\nKardashian said she and husband Kanye West have been avid supporters of Caitlyn Jenner’s transition and wanted to remain respectful of her, but thought there was no need to “bash” the family. She said she was hurt by her stepfather, who’s dad to her half-sisters Kendall and Kylie Jenner, and hasn’t spoken to Caitlyn in a few weeks.\n\n“Kendall and Kylie, that’s their dad and I think my mom’s been so respectful for so long and always wanting Caitlyn around and always wanting to have a great relationship with Caitlyn,” Kardashian said. But that doesn’t appear to be the case for the rest of the Kardashian brood.\n\n“I’ll always love her. That was my stepdad for so many years. She taught me about character and so much growing up and I just feel like I don’t respect the character that she’s showing now.”\n\nKim Kardashian’s younger sister, Khloe Kardashian, is also “taking it a little tough,” Caitlyn said at a book signing, according to RadarOnline. “Everyone on the Jenner side is fine. All this stuff tends to work itself out!”\n\nSomeone call Ryan Murphy, because this needs to be turned into a “Feud” series, stat.\n\n------------\n\nFOR THE RECORD\n\nApril 27, 3:31 p.m.: An earlier version of this article said Bruce Jenner and Kris Jenner finalized their divorce in 2013. They divorced in 2014.\n\n------------", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg"], "top_img": "https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.latimes.com/entertainment/la-et-entertainment-news-updates-april-2017-htmlstory.html", "title": "Today in Entertainment: Inside Disney’s Pandora; Fyre Fest’s apology; and ‘Hamilton’ ticket details", "meta_data": {"og": {"title": "Today in Entertainment: Inside Disney's Pandora; Fyre Fest's apology; and 'Hamilton' ticket details", "url": "https://www.latimes.com/entertainment/la-et-entertainment-news-updates-april-2017-htmlstory.html", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "url": "https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "width": 1200, "height": 630, "type": "image/jpeg", "alt": "LA Times logo"}, "description": "Here's what's new and interesting in entertainment and the arts:'Hamilton' L.A. tickets go on sale Sunday, at long last'Facts of Life' star Charlotte Rae has bone cancerKaty Perry serves up new single 'Bon Appetit'Kim Kardashian says she's no longer materialisticCaitlyn Jenner memoir creates a new…", "site_name": "Los Angeles Times", "type": "website"}, "twitter": {"card": "summary_large_image", "description": "Here's what's new and interesting in entertainment and the arts:'Hamilton' L.A. tickets go on sale Sunday, at long last'Facts of Life' star Charlotte Rae has bone cancerKaty Perry serves up new single 'Bon Appetit'Kim Kardashian says she's no longer materialisticCaitlyn Jenner memoir creates a new rift in the familyChris Soules' lawyers: Don't prejudge 'Bachelor' alumA new Haim LP is on the way (and a new video's here)", "site": "@latimes", "title": "Today in Entertainment: Inside Disney's Pandora; Fyre Fest's apology; and 'Hamilton' ticket details"}, "fb": {"app_id": 134435029966155, "pages": 5863113009}, "viewport": "width=device-width,initial-scale=1", "description": "Here's what's new and interesting in entertainment and the arts:'Hamilton' L.A. tickets go on sale Sunday, at long last'Facts of Life' star Charlotte Rae has bone cancerKaty Perry serves up new single 'Bon Appetit'Kim Kardashian says she's no longer materialisticCaitlyn Jenner memoir creates a new rift in the familyChris Soules' lawyers: Don't prejudge 'Bachelor' alumA new Haim LP is on the way (and a new video's here)", "brightspot.contentId": "0000016c-68c4-d4d6-a16e-eaef17c40000", "brightspot.cached": "false"}, "movies": [], "publish_date": null, "source": "https://www.latimes.com", "summary": ""}