{"url": "https://www.amazon.com/Kennedy-Babylon-Century-Scandal-Depravity/dp/0986193305", "text": "This is very timely. The groundwork for powerful men’s use and abuse of women in the modern media age, scandals now exploding publicly each day, was laid by the Kennedys. They were expert in getting what, and whom, they wanted, in keeping it quiet, in doing damage control, and in silencing a mostly compliant media. Wondering how Harvey Weinstein got away with it for so long? Here’s a primer. The Kennedys wrote that book.\n\n\n\nI’ve been reading about the Kennedys my entire life. I learned to read, and started looking at the photos in Life magazine and reading the captions, when JFK was in the White House. The bad stuff didn’t start coming out in volume until the 1970s. Howie Carr documents, scandal by scandal and year by year.\n\n\n\nYou can watch as this once-most-powerful American family, the closest thing we ever had to royals, slowly loses its grip on its image - what we know and think about them. You read the truth now because they aren’t feared as they once were. The Kennedys could not have risen to become icons in today’s more wide-open media environment.\n\n\n\nCarr absolutely trashes them here. It’s not a balanced portrait, but another way to regard it is we’ve all been fed adoring and sanitized stories about them for most of our lives. This IS the balance.\n\n\n\nThere was a lot to cover up. It’s breathtaking to read how much they got away with. Patriarch Joe Kennedy was shrewd, nasty and powerful enough to keep family shenanigans quiet, but with his paralyzing stroke in 1961 they no longer had someone who really understood how to deal with, say, the Mob.\n\n\n\nWhen Jack and Bobby were gone and Teddy was the last male of that generation standing, it got worse, as he wrecked himself drinking and philandering. Brother-in-law Steve Smith was that generation’s fixer, but when he died, their redoubts against unfavorable publicity were even fewer.\n\n\n\nEach generation seems more reckless and entitled. Even Jack Kennedy seemed not to understand what rules normal people play by. On his desk, where any staffer, guest or janitor might see it, he kept a photo of him and some pals on a yacht. The women were all naked. Kennedy memorialized conquests by having portraits of the two of them - wearing masks - taken and sent to an outside photographer for developing.\n\n\n\nThere are so many girlfriends, hookers, conquests, rapes, abortions, incests, adulteries and pimps here that I can’t even begin to remember them all. That’s not to mention the alcoholism, drug addiction, auto accidents, accidental deaths and other mayhem Kennedys created and usually emerged from with few or no consequences.\n\n\n\nA lot of the well-known scandals are here - Marilyn Monroe, Judith Campbell, Chappaquiddick, the drug-injecting Dr. Feelgood - plus a whole lot I’d never heard before. I didn’t realize Bobby and Jackie’s involvement after Jack’s death was as serious as it was.\n\n\n\nCarr puts the Kennedy-Mob-Rat Pack story into perspective: Campbell was the go-between, the bagman who carried a quarter million in cash to mobster Sam Giancana to swing the West Virginia primary towards JFK in 1960.\n\n\n\nThe Kennedys left themselves increasingly open to blackmail, and the book suggests public policy was affected by that at least once: the F-111 fighter plane was awarded despite inferior design to General Dynamics instead of Boeing because the former blackmailed JFK with the Campbell affair. This white elephant cost the nation billions before its cancellation a few years after his death.\n\n\n\nThere’s a lot here about FBI director J. Edgar Hoover. He feared the Kennedys would either sack him, or force his retirement when he turned 70 in 1965, presuming JFK would have been re-elected. Hoover gathered dirt as insurance. Meanwhile, the mob had dirt on him as a gay transvestite. Hoover often gets trashed in histories of this era, but he comes across here as more of a straight-shooter than the Kennedys were.\n\n\n\nYou ultimately see the Kennedys’ mob collusion in the 1960 election as the original sin that wouldn’t go away, that shadowed the entire administration and would have kept doing so. Being beholden to gangsters, and trying to keep it all quiet, was just too much. (That and JFK having sex with a probable East German spy while he was president.)\n\n\n\nCarr is also devastating on lesser things: cheapness. Not paying bills. Stiffing vendors and caterers and restaurants. Being mean to the household staff. Expecting others to pay and never carrying cash. He details how Jackie, after her mercenary marriage to Aristotle Onassis, padded her purse by spending his money on mind-boggling six-figure shopping sprees, then selling the clothes through consignment shops - tax-free cash that went to her. A clever grift, indeed.\n\n\n\nCarr doesn’t attribute much of the book, nor use footnotes. Much of what’s listed seems to track back, one way or another, to the FBI or Secret Service. Agents or former agents either were the sources, or pointed Carr towards public documents such as wiretap transcripts, or newspaper archives documenting the beginnings of scandals that all somehow ended up being squelched.\n\n\n\nI got to thinking why this might have been. Here’s my theory:\n\n\n\nMost cops and prosecutors are pretty strait-laced. Many may have been offended by the Kennedys’ wildness - women walking naked through the White House living quarters, say - but able early on to rationalize it. The Kennedys had been strong anti-Communists, the cops, many of them Catholic, tended to be anti-Communist too and so the Kennedys were fighting the good fight. Plus, one could say, as F. Scott Fitzgerald (no relation) wrote “the rich, they’re not like you and me.” Because they’re not.\n\n\n\nAfter JFK’s assassination, though, the Kennedys moved left. Teddy becoming the liberal lion of the U.S. Senate. Now these cops were neither morally nor politically on the same page as the Kennedys, and so felt less obliged to keep mum. Teddy’s wave of liberalism brought about an expanded welfare era that destroyed the black family, opened the floodgates of illegal immigration, and imposed controversial school busing. Cops were blue-collar people whose own families were affected by all that.\n\n\n\nAnd the Kennedy family seemed to degenerate with each passing generation, as those who had won wealth or power died and were replaced by those who accomplished little beyond being born rich and growing up decadent. Teddy was really the first of the later generation that way. There wasn’t anyone around for the minions to respect - not the drunken Teddy, the dim-bulb Joe II, the heroin addict Bobby Jr., the statutory rapist Michael. Not any minions, anyway, close enough to see them as they were, rather than their manicured public image.\n\n\n\nSome of the most damning revelations came from their own Lost Generation, notably the alienated and drug-addicted David Kennedy and Chris Lawford, who spilled many family beans to authors David Horowitz and Peter Collier, or from cousins treated more like retainers than family. Things overheard by an embittered maid or groundsman might be discounted as having been taken out of context or misunderstood. But you can’t write off the revelations of family members that easily.\n\n\n\nThe sheer volume here is what’s so damning. Any of us could be savaged by a hostile journalist who puts warts under a magnifying glass, who draws the worst conclusions from passing remarks, who writes with a savage style, who ignores the good. But few of us, even with a Howie Carr following us 24/7 for 20 years, could provide one percent this amount of dirt. This family worked at being bad, and slept through countless wake-up calls.", "images": ["https://images-na.ssl-images-amazon.com/images/G/01/gno/sprites/nav-sprite-global-1x-hm-dsk-reorg._CB405937547_.png", "https://fls-na.amazon.com/1/batch/1/OP/ATVPDKIKX0DER:143-6002037-5958244:2T6AYP8WACAV920PPSWP$uedata=s:%2Frd%2Fuedata%3Fnoscript%26id%3D2T6AYP8WACAV920PPSWP:0", "https://images-na.ssl-images-amazon.com/images/G/01/US-hq/2021/img/Amazon_Exports/XCM_CUTTLE_1351597_1786068_US_650x45_en_US._CB645630042_.jpg", "https://m.media-amazon.com/images/I/91JzgrHA-9L._CR896,0,2304,2304_UX175.jpg", "https://images-na.ssl-images-amazon.com/images/I/91TkrioG9dL._AC_UL160_SR160,160_.jpg", "https://assoc-na.associates-amazon.com/abid/um?s=143-6002037-5958244&m=ATVPDKIKX0DER", "https://images-na.ssl-images-amazon.com/images/I/51dvotC7w-L._AC_UL160_SR160,160_.jpg", "https://images-na.ssl-images-amazon.com/images/I/7112DOcsEVL._CR55,0,389,389_SX48_.jpg", "https://images-na.ssl-images-amazon.com/images/G/01/amazonbookclub/ABC_logo_primary_beta._CB408510813_.svg", "https://images-na.ssl-images-amazon.com/images/G/01/kindle/app/QR-store-link-kindle-app._CB626291935_.png", "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png", "https://images-na.ssl-images-amazon.com/images/S/amzn-author-media-prod/9qa9ljp0ia1biodndeffahs322._SY600_.jpg", "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/transparent-pixel._V192234675_.gif", "https://fls-na.amazon.com/1/batch/1/OP/ATVPDKIKX0DER:143-6002037-5958244:2T6AYP8WACAV920PPSWP$uedata=s:%2Frd%2Fuedata%3Fstaticb%26id%3D2T6AYP8WACAV920PPSWP:0", "https://images-na.ssl-images-amazon.com/images/I/514ovbbehuL._AC_SY60_CR,0,0,60,60_.jpg", "https://images-na.ssl-images-amazon.com/images/I/514ovbbehuL._SX218_BO1,204,203,200_QL40_ML2_.jpg", "https://images-na.ssl-images-amazon.com/images/I/71PWcUnlSDL._AC_UL160_SR160,160_.jpg", "https://m.media-amazon.com/images/I/91wLzO7CHhL._CR896,0,2304,2304_UX175.jpg", "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif", "https://images-na.ssl-images-amazon.com/images/G/01/amazonbookclub/chooseBooksImage._CB409113671_.svg", "https://images-na.ssl-images-amazon.com/images/G/01/amazonbookclub/joinClubsImage._CB409113671_.svg", "https://images-na.ssl-images-amazon.com/images/G/01/kindle/app/kindle-app-logo._CB668847749_.png", "https://images-na.ssl-images-amazon.com/images/I/81SQP3LRORL._AC_UL160_SR160,160_.jpg", "https://m.media-amazon.com/images/I/91P8z-f+kVL._CR896,0,2304,2304_UX175.jpg", "https://images-na.ssl-images-amazon.com/images/G/01/personalization/ybh/loading-4x-gray._CB485916920_.gif", "https://images-na.ssl-images-amazon.com/images/G/01/amazonbookclub/scheduleWithEaseImage._CB409113670_.svg", "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/2b63b433-6db5-4ca0-947f-bafad912b531._CR0,0,496,496_SX48_.jpg", "https://images-na.ssl-images-amazon.com/images/I/91xRqD8NROL._AC_UL160_SR160,160_.jpg", "https://images-na.ssl-images-amazon.com/images/I/71XvODTPy6L._AC_UL160_SR160,160_.jpg"], "top_img": "https://images-na.ssl-images-amazon.com/images/S/amzn-author-media-prod/9qa9ljp0ia1biodndeffahs322._SY600_.jpg", "keywords": [], "authors": ["Howie Carr", "Follow The Author", "Abqa"], "canonical_link": "https://www.amazon.com/Kennedy-Babylon-Century-Scandal-Depravity/dp/0986193305", "title": "Kennedy Babylon: A Century of Scandal and Depravity: Howie Carr: 9780986193309: Amazon.com: Books", "meta_data": {"description": "Kennedy Babylon: A Century of Scandal and Depravity [Howie Carr] on Amazon.com. *FREE* shipping on qualifying offers. Kennedy Babylon: A Century of Scandal and Depravity", "title": "Kennedy Babylon: A Century of Scandal and Depravity: Howie Carr: 9780986193309: Amazon.com: Books", "csrf": "1@gwZXsU5yjPtaJt5sTa02CVhuDz6vEiprA1eNMSJCCJ8sAAAAAQAAAABiMV6DcmF3AAAAABVX8CwXqz42z+J7i/ABqA==@NLD_L8KSDJ"}, "movies": [], "publish_date": null, "source": "https://www.amazon.com", "summary": ""}