{"url": "www.latimes.com/entertainment/la-et-grammys-2018-nominations-live-here-s-why-taylor-swift-was-shut-out-1511879531-htmlstory.html", "text": "M. Shadows of hard rock band Avenged Sevenfold talks about ‘The Stage’ and its first ever Grammy nomination\n\nNonbelievers may guffaw, but perhaps Avenged Sevenfold wasn’t fated to possess a Grammy until the Huntington Beach band issued its seventh album — therefore avenging past oversights.\n\nThe hard-rock quintet, which was birthed in 1999, has been grinding riffs and gathering fans through albums including “Sounding the Seventh Trumpet,” “City of Evil,” “Nightmare” and “Hail to the King.” But only with its 2016 album “The Stage” did the band draw the attention of Recording Academy voters.\n\nMaybe it was the album’s conceptual underpinnings, which address current-day issues involving progress, religion, technology and the very question of life itself. Or maybe it’s an acknowledgement that Avenged Sevenfold, nearly two decades into its career, is just hitting its stride.\n\nThe band is nominated in the rock song category for the title track from “The Stage.”\n\nSinger and Avenged Sevenfold co-founder Matt Sanders, who performs as M. Shadows, spoke to The Times after he learned of the Grammy nod. The following has been edited for length and clarity.\n\nIt was surprising to learn that Avenged Sevenfold had never earned a nomination. Congratulations.\n\nYeah, you know, every year the nominations have come out, and we’ve had some pretty big records, and every year we’ve never gotten anything. So we kind of wrote it off as, ‘We’re probably never going to get one, and that’s the way it is.’ So it was a nice surprise.\n\n“The Stage” is a concept album. Can you talk about its underlying story?\n\nI call it a “conceptual album” because there’s not really a story there like Queensryche’s “Operation: Mindcrime” or the Who’s “Tommy.” The record really goes to the human experience — one foot based in scientific things that we’re dealing with now, like artificial intelligence and space exploration and where we’re going as a human race — some of the big questions that are going to have to be answered. On the last track we had Neil deGrasse Tyson do a monologue that he’d written for it.\n\nHow did you introduce “The Stage” to your fans?\n\nWe were getting extremely bored with the bread-crumb release strategy — put out one song, then two songs. The way streaming is now, once the record comes out people have been listening to four or five songs and the whole record’s out there and there are opinions out there. And when you’re dealing with a conceptual record like this, we really wanted people to hear the whole thing.\n\nSo one day we dropped the video for “The Stage,” which is the song that’s nominated, and then two weeks later, just out of the blue, we played a show on top of Capitol Records and the record came out.\n\nBut it was a tough sell for the rock fans. They didn’t really know what to think of it, and we don’t really have the social media presence of a Beyonce, with 90 million followers. But the tour did extremely well and now we’ve got a Grammy nod for it. So you take the good with the bad. We’re really happy about it — today.\n\nDoes the nomination feel like a validation?\n\nIt’s coming at a good time for us. I think when we were younger, all these things were, like — we don’t care about the awards, we were just kind of out there.\n\nAnd I think some perspective on our career and perspective on how these things work, we’re just really grateful at this point in our lives to be able to get the nod and show up. and it’s rock song, so it’s a televised award and we’re really grateful for that.\n\nAnd to be in there with Foo Fighters and Metallica and all those bands, we’re just excited. We’re going against some Goliaths, but it’s not about the win. We’re just really happy to be recognized.", "images": ["https://ca-times.brightspotcdn.com/dims4/default/445b707/2147483647/strip/true/crop/662x348+0+338/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff6%2F18%2Fdaaf04bfc8875208ed57ad154127%2Fla-lb-media-grammy-ill-20171128-075840", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://ca-times.brightspotcdn.com/dims4/default/445b707/2147483647/strip/true/crop/662x348+0+338/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff6%2F18%2Fdaaf04bfc8875208ed57ad154127%2Fla-lb-media-grammy-ill-20171128-075840", "keywords": [], "authors": [], "canonical_link": "https://www.latimes.com/entertainment/la-et-grammys-2018-nominations-live-updates-htmlstory.html", "title": "Grammy nominations 2018 updates: The Grammys embrace hip-hop and newcomers; Nashville, Post Malone, Ed Sheeran snubbed", "meta_data": {"og": {"title": "Grammy nominations 2018 updates: The Grammys embrace hip-hop and newcomers; Nashville, Post Malone, Ed Sheeran snubbed", "url": "https://www.latimes.com/entertainment/la-et-grammys-2018-nominations-live-updates-htmlstory.html", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/445b707/2147483647/strip/true/crop/662x348+0+338/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff6%2F18%2Fdaaf04bfc8875208ed57ad154127%2Fla-lb-media-grammy-ill-20171128-075840", "url": "https://ca-times.brightspotcdn.com/dims4/default/445b707/2147483647/strip/true/crop/662x348+0+338/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff6%2F18%2Fdaaf04bfc8875208ed57ad154127%2Fla-lb-media-grammy-ill-20171128-075840", "width": 1200, "height": 630, "type": "image/jpeg"}, "description": "In a reflection of the current state of pop, in which hip-hop and urban music are the dominating forces, artists such as Jay-Z, Kendrick Lamar, Childish Gambino and Bruno Mars are among the top nominees the 60th Grammy Awards, to be held Jan. 28 from Madison Square Garden in New York. Grammys get…", "site_name": "Los Angeles Times", "type": "website"}, "twitter": {"card": "summary_large_image", "description": "In a reflection of the current state of pop, in which hip-hop and urban music are the dominating forces, artists such as Jay-Z, Kendrick Lamar, Childish Gambino and Bruno Mars are among the top nominees the 60th Grammy Awards, to be held Jan. 28 from Madison Square Garden in New York. Grammys get in tune with hip-hop and diversity for 2018 nominationsGrammys 2018: Complete list of nomineesGrammy snubs: Ed Sheeran and Post Malone largely left out in the coldKesha finally gets her first Grammy nominationMeet Taylor Swift, behind-the-scenes songwriter'Despacito,' the year's runaway hit sung in Spanish, could make Grammy historyGrammy nods for women, people of color an encouraging sign the Recording Academy is paying attention", "image": "https://ca-times.brightspotcdn.com/dims4/default/d858c96/2147483647/strip/true/crop/662x372+0+326/resize/1200x675!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff6%2F18%2Fdaaf04bfc8875208ed57ad154127%2Fla-lb-media-grammy-ill-20171128-075840", "site": "@latimes", "title": "Grammy nominations 2018 updates: The Grammys embrace hip-hop and newcomers; Nashville, Post Malone, Ed Sheeran snubbed"}, "fb": {"app_id": 134435029966155, "pages": 5863113009}, "viewport": "width=device-width,initial-scale=1", "description": "In a reflection of the current state of pop, in which hip-hop and urban music are the dominating forces, artists such as Jay-Z, Kendrick Lamar, Childish Gambino and Bruno Mars are among the top nominees the 60th Grammy Awards, to be held Jan. 28 from Madison Square Garden in New York. Grammys get in tune with hip-hop and diversity for 2018 nominationsGrammys 2018: Complete list of nomineesGrammy snubs: Ed Sheeran and Post Malone largely left out in the coldKesha finally gets her first Grammy nominationMeet Taylor Swift, behind-the-scenes songwriter'Despacito,' the year's runaway hit sung in Spanish, could make Grammy historyGrammy nods for women, people of color an encouraging sign the Recording Academy is paying attention", "brightspot.contentId": "0000016c-68c4-d4d6-a16e-eaef189f0000", "brightspot.cached": "false"}, "movies": [], "publish_date": null, "source": "http://www.latimes.com", "summary": ""}