{"url": "http://www.newslocker.com/en-us/news/celebrity/ellen-degeneres-reflects-on-20th-anniversary-of-her-public-coming-out-it-was-a-really-scary-time/", "text": "Sylvester Stallone Buys $18 Million Mansion - See 50+ Photos from Inside the House! Sylvester Stallone has purchased a new home after selling his Beverly Park mansion to Adele!\n\nThe 75-year-old Rocky actor previously sold his former home for $58 million and now has purchased a mansion in Hidden Hills for *just* $18.2 million.\n\nDirt.com reports that the new home sits at the end of a cul-de-sac in a gated community. The various homes on the property have a total of 10,460 square feet of living space with four bedrooms and 6.5 bathrooms.The home features an open kitchen with Wolf a Read more\n\nBrittany Snow & Kid Cudi Premiere 'X' Movie at SXSW, Secret Prequel Revealed! Brittany Snow and Kid Cudi were at SXSW this weekend for the world premiere of their new horror movie X!\n\nThe two stars were joined by co-star Martin Henderson and the film’s writer and director Ti West for the premiere on Sunday (March 13) in Austin, Tex.\n\nEarlier in the day, the foursome made an appearance at the Variety Studio and The Prime Video Blue Room Lounge at SXSW.\n\nAt the premiere, Ti announced that a secret prequel has already been shot!\n\nClick inside to read more…\n\nX takes Read more\n\nJennifer Lopez & Ben Affleck Spotted Together in Spain While She Films New Movie Jennifer Lopez and Ben Affleck are together in Spain!\n\nThe 52-year-old singer and actress was photographed with the 49-year-old actor and director during a day off from work on Sunday (March 13) in Gran Canaria, Spain.\n\nJennifer and Ben were seen holding hands while enjoying a stroll around the town and they relaxed on a park bench at one point.\n\nJLo is currently filming the upcoming Netflix movie The Mother, which is being directed by Mulan director Niki Caro.\n\nThe film follows “a deadly fem Read more\n\nEvan Rachel Wood Breaks Silence on Marilyn Manson's Lawsuit Against Her Evan Rachel Wood is speaking out in response to the lawsuit that her former boyfriend and alleged abuser Marilyn Manson has filed against her.\n\nIt was reported two weeks ago that Marilyn is suing Evan for defamation over the sexual abuse allegations she made against him. He also claims that she impersonated an FBI agent.Evan made an appearance on The View on Monday (March 14) to discuss her new documentary Phoenix Rising and she responded to a question about the lawsuit.\n\nClick inside to find out Read more\n\nRiverdale's Charles Melton Sparks Dating Rumors with Chase Sui Wonders Charles Melton is rumored to be dating someone new and you might recognize her!\n\nThe 31-year-old Riverdale actor is reportedly in a relationship with Chase Sui Wonders, who is best known for her role on the short-lived HBO Max series genera+ion.\n\nPhotos have emerged online of Charles and Chase, 25, spending time together in New York City, where they’ve been seen flaunting some PDA.\n\nClick inside for more details and other evidence that they might be a couple…\n\nOn one occasion, he could Read more\n\nMilo Ventimiglia Kicked Off His Week With a Workout & We've Been Blessed with These New Photos Milo Ventimiglia leaving the gym has basically become a new category of photos that we are always excited to see.\n\nThe 44-year-old This Is Us actor looked great while putting his muscle gains on display while leaving the gym on Monday afternoon (March 14) in West Hollywood, Calif.\n\nMilo went viral almost a year ago when he was seen leaving the gym in very, very short shorts after a workout. He reacted to the buzz surrounding the photos a month later.The final season of This Is Us is currently air Read more\n\nDaniel Radcliffe Makes Rare Red Carpet Appearance with Girlfriend Erin Darke for 'The Lost City' Screening Can you believe that this is only the second time that Daniel Radcliffe has been on a red carpet with longtime love Erin Darke?!\n\nThe 32-year-old actor walked the carpet with Erin, 37, at the screening for his movie The Lost City on Monday night (March 14) in New York City.\n\nDaniel stars in the movie with Sandra Bullock and he joined the rest of the cast on the red carpet.\n\nClick inside to read more…\n\nWhile Daniel and Erin have posed together at some parties in the past, the only other time Read more\n\nJordin Sparks Walks Red Carpet in a Dress That's Been in Her Closet for 10 Years Jordin Sparks is showing everyone that it can be cool to re-wear clothes on the red carpet!\n\nThe 32-year-old former American Idol winner stepped out this weekend for the Celebrity Fight Night event on Saturday (March 12) in Phoenix, Ariz.\n\nJordin took to Instagram two days later to share side-by-side photos from the 2022 event and the time she wore the dress in 2012.\n\nClick inside to read more…\n\n“If you thought this dress looked familiar, ding ding!! It’s been in my closet for a Read more\n\n'The Bachelor' 2022: Shocking Finale Ending Revealed, Plus Reality Steve's Spoilers for Night Two SPOILER ALERT! Stop reading now if you don’t want to know what happens in the finale of Clayton Echard’s season of The Bachelor!\n\nPart one of the two-night finale of The Bachelor just aired and we saw one half of the shocking conclusion to Clayton Echard‘s journey on the show.\n\nThe episode that aired last week followed Clayton‘s fantasy suite dates with the final three women – Rachel, Gabby, and Susie. He slept with the first two women and told them he’s in lov Read more\n\nKristen Stewart & Dylan Meyer Run Errands After Making Red Carpet Debut at Critics Choice Awards Kristen Stewart goes casual for an afternoon out with fiancée Dylan Meyer in Los Angeles on Monday (March 14).\n\nThe 31-year-old Oscar nominee masked up as she and Dylan ran some errands together.\n\nKristen and Dylan were seen doing a little window shopping together after stopping for some coffee.\n\nOver the weekend, the engaged duo made their official red carpet debut at the 2022 Critics Choice Awards.\n\n“I really just didn’t think that I was going to receive a nomination,” Kr Read more\n\nSandra Bullock's Position on Doing Sequels Has Changed Sandra Bullock is hard at work promoting her new movie The Lost City!\n\nThe 57-year-old actress walked the red carpet for a screening of the film at the Whitby Hotel on Monday (March 14) in New York City.\n\nSandra was joined at the event by co-stars Daniel Radcliffe, Da’Vine Joy Randolph, and Patti Harrison, as well as co-directors and co-writers Aaron Nee and Adam Nee, plus producer Liza Chasin.In an interview while promoting the movie at SXSW, Sandra explained why she has changed her positi Read more\n\nKanye West Denies He's Making 'Wild Claims,' Explains Latest Actions Regarding Kim & Pete Kanye West is speaking out again and this time he’s focusing on a media outlet that said he made “wild claims” over his children with Kim Kardashian.\n\nThe 44-year-old rapper’s latest Instagram post went up on Monday night (March 14) and he responded to OK Magazine reporting about Kim‘s comment on his post from earlier in the day.\n\n“#KimKardashian is done playing nice! The mogul called out #KanyeWest for his wild claims over their children,” the outlet wro Read more\n\nShanna Moakler & Matthew Rondeau Appear to Be Back Together, Weeks After His Arrest Shanna Moakler appears to be back with Matthew Rondeau, just three weeks after he was arrested for felony domestic violence.\n\nThe possibly on-again couple was seen together in Rhode Island this past weekend and details about their reunion have been revealed.\n\nClick inside to read more…\n\nTMZ reports that Shanna and Matthew went to Opa Restaurant for dinner on Sunday night in Providence. The couple had a late meal and left the restaurant at around 1am.\n\nShanna reportedly told a fellow diner, & Read more\n\nDylan O'Brien Cancels 'The Outfit' Press Opps After Testing Positive For COVID-19 Dylan O’Brien has cancelled the rest of his press plans for The Outfit.\n\nThe 30-year-old actor shared with fans that the reason behind the decision is because he has tested positive for COVID-19.\n\nClick inside to read more…\n\nTaking to social media, Dylan shared that he’s only experiencing mild symptoms.\n\n“Being vaxxed & boosted (and having it with Obama) is v much helping,” he wrote. “but had to cancel rest of press. sobering reminder that we’re still Read more\n\nWWE Legend Scott Hall Has Died at 63 After Surgery Complications Scott Hall, a Hall of Fame wrestler from the WWE, has died at the age of 63.\n\nThe organization confirmed the news in a statement saying, “WWE is saddened to learn that two-time WWE Hall of Famer Scott Hall has passed away. WWE extends its condolences to Hall’s family, friends and fans.”\n\nA report has revealed what led to Scott‘s death.\n\nClick inside to read more…\n\nPWTorch reports that Scott passed away on Monday (March 14) after being on life support since Saturday. H Read more\n\nRegina Hall Opens Up About Not Airing Craft Categories at Oscars 2022 Regina Hall gathers up with Zoe Renee and Mariama Diallo at the premiere of Master during the 2022 SXSW Conference and Festivals held at ZACH Theatre on Monday (March 14) in Austin, Texas.\n\nThe trio were also joined by co-star Noa Fisher at the screening event, just days after the premiere event in New York City.\n\nIn a new interview, Regina is opening up about her upcoming host duties at the 2022 Oscars, and those sidelined categories that many have issues with.\n\n“They won’t be out of Read more\n\nRebel Wilson Jokes About Her Weight Loss at BAFTAs 2022, Shows Before & After Photos Rebel Wilson went on a “year of health” in 2020 and she lost a lot of weight throughout the past two years.\n\nThe 42-year-old actress joked about her weight loss during her opening monologue at the 2022 BAFTAs on Sunday night (March 13) at Royal Albert Hall in London, England.\n\nRebel hosted the ceremony, two years after attending the 2020 show. When she came out on stage for last night’s show, she shared a before photo to show off her transformation.\n\nClick inside to read more&hel Read more\n\n'Bachelor' Couples Still Together Today - Only 9 Out of 43 Couples From the Franchise Have Lasted The finale of The Bachelor‘s current season begins TONIGHT, so it’s time to look back at all of the couples from Bachelor Nation that have remained together.The Bachelor and The Bachelorette franchises haven’t had the best success rates with having couples stay together after the finale, but there are still 9 out of 43 couples that are still together as of 2022!\n\nThere have been 25 seasons of The Bachelor so far and four of those couples are still together. Two of those couples Read more\n\nRachel Zegler Was Saved From a Wardrobe Malfunction By Lady Gaga & Alana Haim! Rachel Zegler has Lady Gaga, Alana Haim and Este Haim to thank for saving her from a possible wardrobe malfunction over the weekend at the 2022 BAFTAs in London.\n\nThe 20-year-old West Side Story star opened up about what went down at the award show, and how Lady Gaga and the Haim sisters came to her rescue.\n\nClick inside to read more…\n\nRachel revealed in a series of tweets that her Vivienne Westwood dress had broken just before she walked the red carpet at the ceremony.\n\n“M\\my dress br Read more\n\nStephanie Beatriz Was Actually in Labor While Recording This 'Encanto' Song Stephanie Beatriz is opening up about being in active labor while recording a song for Encanto.\n\nIn a new interview with Variety, the 41-year-old actress revealed that she actually kept that part secret from director Byron Howard on the day of recording “Waiting on a Miracle”.\n\nClick inside to read more…\n\nAccording to Stephanie, she says she “didn’t want to tell anybody at Disney because I didn’t want anyone to freak out.”\n\n“I was already having some Read more\n\nSandra Bullock Wears Cool Color Blocked Pants in NYC Sandra Bullock makes a fashionable arrival in New York City on Monday (March 14).\n\nThe 57-year-old actress stepped out in a pair of very colorful pants with her team to tape her appearance on The Late Show With Stephen Colbert, promoting her new movie, The Lost City.\n\nSpeaking to Entertainment Tonight, Sandra opened up about co-star Channing Tatum, and his skin baring moments in the flick.\n\n“Channing is so comfortable with [himself],” she shared. “He knew it was for a comedy, he Read more", "images": ["http://www.newslocker.com/images/rss.png", "https://img.newslocker.com/2022/03/15/259172850_350.jpg", "https://img.newslocker.com/2022/03/15/259182071_725.jpg", "http://www.newslocker.com/images/share-linkedin.png", "https://img.newslocker.com/2022/03/15/259182070_725.jpg", "http://akns-images.eonline.com/eol_images/Entire_Site/2017221/rs_600x600-170321040522-600.ellen-degeneres-2.32117.jpg?downsize=450:*&crop=450:350;left,top", "https://img.newslocker.com/2022/03/15/259182068_725.jpg", "https://img.newslocker.com/2022/03/15/259182075_725.jpg", "https://img.newslocker.com/2022/03/15/259182081_725.jpg", "https://img.newslocker.com/2022/03/15/259182082_725.jpg", "https://img.newslocker.com/2022/03/15/259182090_725.jpg", "http://www.newslocker.com/images/share-twitter.png", "http://www.newslocker.com/images/newslocker-cube.png", "https://img.newslocker.com/2022/03/15/259182077_725.jpg", "https://img.newslocker.com/2022/03/15/259182089_725.jpg", "https://img.newslocker.com/2022/03/15/259172849_350.jpg", "https://static.addtoany.com/buttons/share_save_120_16.gif", "https://img.newslocker.com/2022/03/15/259182078_725.jpg", "https://img.newslocker.com/2022/03/15/259182069_725.jpg", "https://img.newslocker.com/2022/03/15/259182072_725.jpg", "http://www.newslocker.com/images/share-facebook.png", "https://img.newslocker.com/2022/03/15/259182073_725.jpg", "https://img.newslocker.com/2022/03/15/259182067_725.jpg", "https://img.newslocker.com/2022/03/15/259182086_725.jpg", "https://img.newslocker.com/2022/03/15/259172851_350.jpg", "https://img.newslocker.com/2022/03/15/259182074_725.jpg", "https://img.newslocker.com/2022/03/15/259182085_725.jpg", "https://img.newslocker.com/2022/03/15/259182091_725.jpg", "https://img.newslocker.com/2022/03/15/259182084_725.jpg", "https://img.newslocker.com/2022/03/15/259172848_350.jpg", "https://img.newslocker.com/2022/03/15/259182087_725.jpg", "https://img.newslocker.com/2022/03/15/259182083_725.jpg", "http://www.newslocker.com/images/newslocker-logo.png"], "top_img": "http://akns-images.eonline.com/eol_images/Entire_Site/2017221/rs_600x600-170321040522-600.ellen-degeneres-2.32117.jpg?downsize=450:*&crop=450:350;left,top", "keywords": [], "authors": [], "canonical_link": "https://www.newslocker.com/en-us/news/celebrity/ellen-degeneres-reflects-on-20th-anniversary-of-her-public-coming-out-it-was-a-really-scary-time/", "title": "Ellen DeGeneres Reflects on 20th Anniversary of Her Public Coming Out: \"It Was a Really Scary Time\"", "meta_data": {"description": "This weekend marks the 20th anniversary of Ellen DeGeneres publicly coming out, so given the big milestone she's reflecting on her choice and how it affected her career, then and...", "og": {"title": "Ellen DeGeneres Reflects on 20th Anniversary of Her Public Coming Out: It Was a Really Scary Time - Celebrity news - NewsLocker", "description": "This weekend marks the 20th anniversary of Ellen DeGeneres publicly coming out, so given the big milestone she's reflecting on her choice and how it affected her career, then and...", "type": "website", "url": "https://www.newslocker.com/en-us/news/celebrity/ellen-degeneres-reflects-on-20th-anniversary-of-her-public-coming-out-it-was-a-really-scary-time/", "image": "http://akns-images.eonline.com/eol_images/Entire_Site/2017221/rs_600x600-170321040522-600.ellen-degeneres-2.32117.jpg?downsize=450:*&crop=450:350;left,top", "site_name": "Newslocker"}, "fb": {"admins": 1335791813}, "robots": "index", "google-site-verification": "wAInSoPxz3OEgOXCHtETx-x7ukmlX40FRoiPZpO7ww4", "msvalidate.01": "2F0DB39856FAA0E47C70E9E1FF8653AA"}, "movies": [], "publish_date": 1493323140.0, "source": "http://www.newslocker.com", "summary": ""}