{"url": "https://web.archive.org/web/20170726183725/http://www.vanityfair.com/hollywood/2017/07/angelina-jolie-cover-story", "text": "There’s the Angelina Jolie who’s now a single mother—managing the day-to-day chaos of six kids, and the trauma of her split from Brad Pitt—and there’s the Angelina Jolie whose latest movie, a groundbreaking Netflix original about Cambodia’s genocide, is also a thank-you to the nation that transformed her. At her new L.A. mansion, Jolie reveals the tension between the two Angelinas and the reason her life will never be normal.\n\nThere’s the Angelina Jolie who’s now a single mother—managing the day-to-day chaos of six kids, and the trauma of her split from Brad Pitt—and there’s the Angelina Jolie whose latest movie, a groundbreaking Netflix original about Cambodia’s genocide, is also a thank-you to the nation that transformed her. At her new L.A. mansion, Jolie reveals the tension between the two Angelinas and the reason her life will never be normal.\n\nThere’s the Angelina Jolie who’s now a single mother—managing the day-to-day chaos of six kids, and the trauma of her split from Brad Pitt—and there’s the Angelina Jolie whose latest movie, a groundbreaking Netflix original about Cambodia’s genocide, is also a thank-you to the nation that transformed her. At her new L.A. mansion, Jolie reveals the tension between the two Angelinas and the reason her life will never be normal.\n\nLike most things involving Angelina Jolie, stepping foot into her house is an experience so heightened one wonders if it’s for real or the product of careful orchestration. The large gates to her recently purchased Los Feliz house—an 11,000-square-foot Beaux-Arts mansion once owned by the epic filmmaker Cecil B. DeMille—slowly swing open, revealing rolling lawns, lush trees at the perimeter. No one’s there, and all is quiet except for the delicate sound of fountains, arched in a row over a swimming pool. A number of doors to the house are open, as if posing some riddle from a fairy tale—which one to enter? Inside, the vibe is airy and calm: all open windows and cross-breezes, creamy-white unlit candles, soft creamy-white furnishings. Finally she emerges from the other side of the house and glides across the room in a creamy-white, floor-length caftan. Her hair is down, her feet bare, only a touch of makeup, her skin luminous. She smiles widely—a beneficent, ethereal wood nymph. But as soon as she starts speaking, you realize that your preconceived notions about Jolie aren’t quite right. She’s not a celestial goddess. She’s not the high-and-mighty do-gooder. She’s not the intense control freak—or at least not obviously so. She comes across, rather, as normal-person friendly and practical, even chitchatty. She explains the deal with the big empty mansion. She moved into this space just four days ago with her six kids. It wasn’t for the prestigious history or the architecture. She needed a good place fast, somewhere secluded, with a lot of rooms; this one, which was listed for around $25 million, has six bedrooms and 10 bathrooms. Following her September 2016 filing for divorce from Brad Pitt, she and her children spent nine months in a rental, basically living out of suitcases. And so she hasn’t really unpacked, barely knows her way around the place, has never had a real visitor, and isn’t sure where the best spot is to sit and talk. With that in question, she roams from room to room—the fabulous kitchen, worthy of a Nancy Meyers movie, charming gray library with a library ladder (her favorite room in the house), the generous landing at the foot of a sweeping staircase, anchored by a round table with a bouquet of white flowers. She finally settles on the living room, which a set-decorator friend furnished on the fly, with two creamy-white sofas and some big throw pillows. She looks at them curiously. “I didn’t even know I needed ‘throw pillows.’ ” Decorating, house stuff, “that was always Brad’s thing.” On cue, as if taunting her, Jolie’s large Rottweiler, Dusty, soaking from a trip to the pool, jumps onto the sofa, soiling it. She sighs, amused, half tries to wipe it off with her bare hand, then gives up and sits somewhere else. Photograph by Mert Alas and Marcus Piggott. Styled by Jessica Diehl. Life in her household is apparently like this—messy, relaxed, normal. The kids are polite but not phony polite. Zahara, 12, whom Jolie describes as “the rock” of the family, comes downstairs. “Zaz!” Jolie cries, midsentence. They discuss the whereabouts of everyone else. Zahara hugs the wet dog. Jolie laughs and tells her daughter about the swim Dusty just took. We move to the kitchen, where Jolie fixes herself a cup of tea. Vivienne, 9, comes in with a friend, having just been at a sleepover. She’s wearing a jean backpack covered with pins. Jolie envelops her in her arms. I ask the girl if she’s called “Viv” or “Vivienne.” “Either one!” she says with a smile. She dumps her stuff on the counter and goes out to play with her friend. Jolie picks up a small piece of a blanket, shredded to death, and explains, laughing, “She has 32 blankets. She is very into her blanket, and she gets very mad if you wash her blanket. She actually said to me the other day, ‘Mom, I can taste my blanket.’ ‘That, honey, is a sign that it really, really needs to be washed.’ ” Jolie tidies up Vivienne’s things and promptly spills her entire mug of tea all over the counter. We step outside and there’s Shiloh, 11, and Knox, 9, hanging out. Shiloh, who likes to dress like a boy, is wearing a camouflage jacket, long shorts, and heavy black sneakers, despite the blazing heat. Knox immediately wants to know when Jolie’s going to put up the waterslide. “How about a ‘Hello, Mom’?” she says, with a hug, sounding like just about every other loving, exasperated mother in America. So far, there’s only one piece of personal artwork up—a black-and-white photograph on the mantelpiece of the six children, smiling and holding their various pets—dogs, reptiles, and rodents.\n\nJolie and Pitt, who’d been together for 12 years and appeared to be the most gloriously evolved couple in Hollywood, split last September. She filed for divorce suddenly “for the health of the family,” according to her lawyer, and announced she was seeking sole custody of the children, three of whom are adopted (Maddox, 15, Pax, 13, and Zahara), three of whom are biological (Shiloh, Vivienne, and Knox). Things had been rocky for some time, but the last straw was a dramatic trip on a private plane, where there was reportedly a physical and verbal altercation between Pitt and Maddox. When they touched down, Jolie went home with the kids, effectively kicking him out. This was no “Conscious Uncoupling.” An anonymous phone call was made to authorities. The F.B.I. and the Los Angeles County Department of Children and Family Services began investigating Pitt for child abuse. He was soon cleared and later said in an interview with GQ Style that he was smarting from the pain of his suddenly broken family and admitted he had a serious drinking problem. Watch Angelina Jolie explain her journey to Cambodia and the passion that led her to make First They Killed My Father. There were rumors he was having an affair with Marion Cotillard (denied by both Pitt and Cotillard). Jolie got the early jump P.R.-wise. But Pitt won hearts and minds with the mea culpa in GQ Style. The two are still negotiating the terms of their divorce. As for Jolie, a life already bursting at the seams—with acting, directing, humanitarian work, parenting six kids, and guest-lecturing on women’s rights at the London School of Economics—just got exponentially bigger and more complicated, because she’s now doing it alone. There’s the chaos surrounding the practical day-to-day—playdates, doctors’ appointments, packing and unpacking, and organizing mealtimes. And there’s the deeper, emotional chaos. “It’s just been the hardest time, and we’re just kind of coming up for air. [This house] is a big jump forward for us, and we’re all trying to do our best to heal our family.” As it happens, the personal trauma has coincided with her most personal film yet. Jolie has directed a moving, large-scale adaptation of First They Killed My Father, Loung Ung’s 2000 memoir of the Khmer Rouge genocide, in which Ung’s parents and two of her siblings perished, along with an estimated two million other Cambodians, a quarter of the country’s population. Shot entirely in Cambodia, and in the Khmer language, the film, a Netflix original, is the largest production the country has witnessed since the war, and according to the reports of several Cambodians who’ve seen it, it’s one of the most revelatory pieces of art about that chapter in the country’s history, a history that’s still difficult for Cambodians to discuss. But if Cambodians consider the film to be something of a gift, then it’s surely a thank-you gift. For Jolie, Cambodia is where she started her family, and it’s where she made a cathartic personal transformation, becoming the woman she is today.\n\nRecall, if you can, the Angelina of the late 90s, the era of Angie Peak Crazy. Specializing in dark volatile characters that seemed extensions of her wild-child restless self, Jolie won three Golden Globes for her roles in television movies and a best- supporting-actress Oscar for her portrayal of a young woman with apparent borderline personality disorder in Girl, Interrupted. She talked freely about having dabbled in heroin and self-cutting, and her love of knives. She and new husband Billy Bob Thornton wore each other’s dried blood in pendants around their necks, and publicly bragged about their wild sex. At the 2000 Oscar ceremony, she talked provocatively about being “so in love . . . right now” with her brother, James, and kissed him with unsettling intimacy. To be sure, Jolie had legitimate pain in her early life—her father, actor Jon Voight, had been unfaithful to her mother, Marcheline Bertrand, and the two split up early on. But it was First World pain. Being Hollywood’s newest “It girl” landed Jolie the title role in Lara Croft: Tomb Raider, based on a popular video game. As it happened, the movie, an example of Hollywood’s most vacuous, commercial, shoot-’em-up instincts, was filmed on location in Cambodia. There, Jolie, who’d grown up in privileged bubbles in Los Angeles and New York, witnessed what real suffering looked like: poverty, the loss of limbs from land mines, a generation of relatives wiped out. In this world there was no room for free-floating malaise or self-indulgent antics. And in spite of their profound trials, “I found a people who were so kind and warm and open, and, yes, very complex,” recalls Jolie. “You drive around here you can see a lot of people with many things, but not often expressing happiness. You go there, and you see the families come out with their blanket and their picnic to watch a sunset.” Photographs by Mert Alas and Marcus Piggott. Styled by Jessica Diehl. She suddenly became curious about the world—starting with the country she was in. One day in Siem Reap, Cambodia, she picked up a book that was being sold on the side of the road for $2: Ung’s memoir. It was among the factors that inspired Jolie to find a greater purpose. In 2001, equipping herself with as much knowledge as she could, she contacted the United Nations and eventually became a goodwill ambassador for the High Commissioner for Refugees. On one of her first U.N. missions, in 2002, she returned to Cambodia to meet up with NGO workers who were dealing with land-mine issues. Among them was Ung, the author of that transformative book, who had moved to America since the war but had spent her adult years working on Cambodia’s troubles. She had never seen an Angelina Jolie movie, but Jolie certainly didn’t seem like anyone’s vision of a movie star. “She was just a really cool human being,” recalls Ung. “And she didn’t mind getting dirty.” On her relationship with Brad Pitt: “We care for each other and care about our family, and we are both working towards the same goal.” She and Jolie clicked and made a plan to travel together to a land-mine-filled part of Cambodia where Ung hadn’t been since the war. Thus began a sequence that sounds as though it must have been written for a movie—but it wasn’t. They met up with a bunch of de-miners, took off on mo-peds, with only a flashlight and some extra toilet paper as supplies, when a monsoon started. Soaked, they went to bed in hammocks. Before going to sleep, Jolie realized she already trusted Ung enough to ask her about something personal, something big she’d been thinking about—adopting a Cambodian orphan. “I asked her as a Cambodian orphan if she would be offended for somebody like me, an outsider, [to do that], or if that would be a nice thing,” recalls Jolie. Ung was wholeheartedly supportive. “Angie was maternal to everybody around her, not just children, but adults included. I wanted her to adopt me,” says Ung. “I was orphaned when I was eight years old, and so I think, when you’ve gone through experiences like that, there’s always a part of you that craves to have full parent figures in your life.” Jolie says that Ung’s enthusiasm for the idea of her adopting was a deciding factor. Had she responded differently, explains Jolie, “it might have changed my decision. It might have made it very hard for me.” Ung has been in Jolie’s life ever since and is now one of her few close friends. Jolie immediately set the adoption process in motion. A couple of months later, she visited an orphanage in the provincial town of Battambang, having promised herself that she’d go only to one, that she wasn’t going to shop around. But Jolie felt uneasy as she wandered the rooms, meeting the children. “I didn’t feel a connection with any of them,” she recalls. Photographs by Mert Alas and Marcus Piggott. Styled by Jessica Diehl. Photograph by Mert Alas and Marcus Piggott. Styled by Jessica Diehl. “They then said, ‘There’s one more baby.’ ” Baby Maddox was lying in a box that was suspended from the ceiling. She looked at him. He looked at her. “I cried and cried,” she recalls.\n\nAnd thus began a 15-year project, in which Jolie rebranded herself, expanding her world, her family, her career, and her image. She bought a house in Cambodia and became a citizen. In 2003, she started what became the Maddox Jolie-Pitt Foundation, focusing on Cambodia’s environmental conservation, health, education, and infrastructure. She intensified her U.N. work, going on dozens of fact-finding missions, to such global hot spots as Sierra Leone, Afghanistan, Iraq, Bosnia, and Haiti. (She’s now been on more than 60 missions.) She split from Thornton, who didn’t understand her newfound passion. She adopted her second child, Zahara, from Ethiopia. In 2004 she met Pitt, on the set of Mr. & Mrs. Smith, when he was still married to Jennifer Aniston. For Jolie, dating Pitt—Hollywood’s gorgeous, laid-back golden boy—catapulted her to another level of fame. Though she has maintained that they didn’t become romantically involved until he and Aniston had split, the couple wasted no time in exhibiting their romance for the pages of W, which did a 32-page spread of them playing house, with a pretend brood of five. Aniston was devastated. For Pitt, dating Jolie meant doing it her way, at least at the outset. It marked the beginning of his own philanthropic life—in Africa, Haiti, and New Orleans—and he formally adopted Maddox and Zahara. He persuaded Jolie to have biological children. She gave birth to Shiloh in 2006, in Namibia, then the twins, Vivienne and Knox, in 2008. In between they adopted Pax, then three, from Vietnam. They bought more homes—in France, Spain, New York, and New Orleans. While Pitt, as a producer and actor, churned out one prestige movie after another (Moonlight, The Tree of Life, Moneyball, 12 Years a Slave), Jolie took a new chance with directing—with In the Land of Blood and Honey, about Bosnia, a project inspired by some of the U.N. work she’d done there. Together, they appeared unstoppable, the most creatively alive citizens on the planet. Nothing seemed beyond their abilities. They traipsed around the globe as a nomadic clan of eight, making art, doing good, and setting up home wherever they happened to be. They tied the knot in 2014, mainly because the kids wanted them to. They had the means to take along tutors for the children wherever they went. But Jolie’s idea of an education meant immersion in the real world, to bring an understanding of one’s “small part in the bigger picture.” For a time, it all worked beautifully. Photographs by Mert Alas and Marcus Piggott. Styled by Jessica Diehl.\n\nIt was 2012, and Jolie had recently finished In the Land of Blood and Honey. She wanted her next project to be just as meaningful, and Ung’s story had at this point been with her for a decade. By the time they had a completed draft, the chance for Jolie to direct Unbroken, based on the best-selling book by Laura Hillenbrand, had come along, and they put the script aside. After that, Maddox, who knew “Auntie” Loung’s story, brought it up. “He was the one who said, ‘It’s time to do it,’ ” says Jolie. She knew that Maddox would be deeply involved in the production, that he’d be “standing there watching horrors that his countrymen did to each other. [So] he had to be ready.” Jolie and Ung dived back in. Credited on the film as an executive producer, Maddox read draft after draft, giving comments. Jolie took it to Netflix, where chief creative officer Ted Sarandos signed on without hesitation. “In the room, she created a visual experience of what this film could be,” recalls Sarandos. “The film is in many ways about the death of beauty, about the way the Khmer Rouge had killed all things beautiful, color itself, which becomes part of the joy of life. . . . That’s what hooked me more than anything.” Watch the video below for a look at Angelina Jolie’s life as a humanitarian. Despite Jolie’s Cambodian ties, she felt she needed a Cambodian filmmaker to help shepherd the project. So she reached out to Rithy Panh, one of the most famous filmmakers in Cambodia, who had lost family members to the genocide and had chronicled the Khmer Rouge in several documentaries, including The Missing Picture, which was nominated for the best-foreign-language-film Academy Award in 2014. She and Panh agreed that the only way this film could be made was if Cambodia wanted it to be—not a foregone conclusion, given that Cambodians are still somewhat reticent about their painful history. (The Killing Fields, Roland Joffé’s 1984 film about the Khmer Rouge, had to be filmed in Thailand and elsewhere.) The war tribunals, which were set in motion in 2009 and are ongoing, have helped open up the topic. Still, Jolie was trepidatious and approached the country’s culture ministers gingerly, explaining that they were telling not just Ung’s story but also the story of a people. Jolie’s Cambodian track record made the difference, says Ung. “In a country like Cambodia, respect is very much elevated—respect for each other, respect for the culture, respect for the history, respect for the elders. Angie walks in Cambodia with this respect.” Cambodia went all in—closing off Battambang for days, giving the filmmakers permits to land in remote zones, providing them with 500 officials from their actual army to play the Khmer Rouge army. “It’s not a poetic thing to say—[this film] was made by the country,” says Jolie. Between cast and crew, some 3,500 Cambodians participated.\n\nTo cast the children in the film, Jolie looked at orphanages, circuses, and slum schools, specifically seeking children who had experienced hardship. In order to find their lead, to play young Loung Ung, the casting directors set up a game, rather disturbing in its realism: they put money on the table and asked the child to think of something she needed the money for, and then to snatch it away. The director would pretend to catch the child, and the child would have to come up with a lie. “Srey Moch [the girl ultimately chosen for the part] was the only child that stared at the money for a very, very long time,” Jolie says. “When she was forced to give it back, she became overwhelmed with emotion. All these different things came flooding back.” Jolie then tears up. “When she was asked later what the money was for, she said her grandfather had died, and they didn’t have enough money for a nice funeral.” That authentic connection to pain was awakened in everyone involved, says Jolie, making for a film set like nothing she’d ever seen. “There wasn’t a person who was working on the movie who didn’t have a personal connection. They weren’t coming to do a job. They were walking in the exodus for the people whom they had lost in their family, and it was out of respect for them that they were going to re-create it . . . It completed something for them.” Some had flashbacks and nightmares. For this reason, a therapist was on set every day. And then there were the odd bystanders who hadn’t been aware that a movie was being made, and were traumatized. In one scene, recalls Jolie, “when the Khmer Rouge came over the bridge, we had a few people who really dropped to their knees and wailed. They were horrified to see them come back.” Given the size and complexity of the production, a different Hollywood director might have, consciously or not, muscled in and flexed her power in a way that might have seemed boorish. According to Ung and Panh, Jolie knows Cambodia so well she’s internalized the country’s character traits. At lunch, she waited in line like everyone else, recalls Panh, and she never raised her voice. “Here we don’t shout. We talk,” he says. In Cambodia, yelling is not just disrespectful—it’s also considered a sign of weakness. Photograph by Mert Alas and Marcus Piggott. Styled by Jessica Diehl. Many eyes were on Maddox, who is as famous in Cambodia as Jolie. “It was a way for him to walk in the steps that most likely his birth parents walked,” says Jolie, who wasn’t sure how he’d ultimately react to the experience. Would he connect? Would he want to flee? Jolie was thrilled one morning during the shoot when she heard Maddox say, “Can I go sleep in my house with my friends?,” referring to their house in the jungle, which she had bought back in 2002. “I hadn’t heard him refer to it that way. You can’t push it. You can’t say, ‘Isn’t this great?’ You just have to kind of keep bringing them there, putting it in front of them . . . and hope that they find the pride and find the comfort.” She considers the endeavor to connect Maddox to his homeland—as she does Zahara to Ethiopia and Pax to Vietnam—a family effort, not a solo one. With that in mind, while Pitt was in the Middle East working on War Machine, the other five kids also went to Cambodia and played a role, official or not, in their mother’s movie. Pax did still photography. The other four were on set every day and became close playmates with the child actors. In February, the film premiered for an audience of 1,000 at the outdoor amphitheater near the temple complex of Angkor Wat. According to numerous reports, it was a screening filled with tears of recognition, remembrance, and catharsis. What moved Jolie perhaps more than anything was that “the Cambodian people had a big movie premiere. They saw a movie for which they made the sets. [It was] their actors doing a great job, their country looking beautiful even through all the horrors.”\n\nAlas, while she was making film history for a country, her relationship with Pitt was suffering. By the time First They Killed My Father was in postproduction, in the summer of 2016, “things got bad,” says Jolie. “I didn’t want to use that word. . . . Things became ‘difficult.’ ” There has been Hollywood talk that their lifestyle had taken its toll on Pitt, and that he was craving a more stable, normal life for the whole family. When I bring this question up to her, it’s the one moment when Jolie becomes a bit defensive. “[Our lifestyle] was not in any way a negative,” she says quickly, adamantly. “That was not the problem. That is and will remain one of the wonderful opportunities we are able to give our children . . . They’re six very strong-minded, thoughtful, worldly individuals. I’m very proud of them.” Jolie has indicated that, for the sake of the kids, she doesn’t want to talk about the breakup. And yet it seems she wants to get her point across, which calls for a careful choice of words, something of a high-wire act. “They’ve been very brave. They were very brave.” Brave when? “In times they needed to be.” Other statements are similarly cryptic. “We’re all just healing from the events that led to the filing . . . They’re not healing from divorce. They’re healing from some . . . from life, from things in life.” I mention Pitt’s mea culpa in GQ Style. Did it surprise her? “No,” she replies, looking unmoved. I refer to tabloid reports that suggest their communication has improved, and ask if that’s true. There’s a long pause. She looks down, formulates an answer. “We care for each other and care about our family, and we are both working towards the same goal.” There’s anger and pain right there beneath the surface. But she’s trying to keep the emotions at bay. “I was very worried about my mother, growing up—a lot. I do not want my children to be worried about me. I think it’s very important to cry in the shower and not in front of them. They need to know that everything’s going to be all right even when you’re not sure it is.” Photograph by Mert Alas and Marcus Piggott. Styled by Jessica Diehl. Her protectiveness over the kids has become all that more fierce due to her recent brushes with the specter of ovarian cancer; the disease took her mother’s life when she was just 56, as well as those of other family members. In a 2013 New York Times op-ed column, Jolie chronicled her decision to have a preventive double mastectomy and reconstructive surgery after she learned she had the BRCA1 gene. Two years later, while working in the editing room on By the Sea, she got a call from the doctor saying that he was concerned about certain levels in her blood work that potentially suggested cancer. “Ten minutes later, the room’s spinning, and you just think, How . . . ?” She kept the news from the kids, did further tests, and waited a few agonizing days. When she finally learned she didn’t have cancer, “I dropped to my knees.” She made an appointment to get her ovaries taken out. “I went into the actual surgery happy as they come. I was skipping. Because at that point it was just preventative.” She instantly went into menopause. Last year, in addition to hypertension, Jolie developed Bell’s palsy, a result of damage to facial nerves, causing one side of her face to droop. “Sometimes women in families put themselves last,” she says, “until it manifests itself in their own health.” Jolie credits acupuncture for her full recovery from the condition. Lately, her skin has become drier, she reports, and she has extra gray hairs. She quips, “I can’t tell if it’s menopause or if it’s just been the year I’ve had.” The idea that she could still be anyone’s idea of a sex symbol is laughable to her. But she says, “I actually feel more of a woman because I feel like I’m being smart about my choices, and I’m putting my family first, and I’m in charge of my life and my health. I think that’s what makes a woman complete.” Photograph by Mert Alas and Marcus Piggott. Styled by Jessica Diehl.\n\nApart from promoting First They Killed My Father, on Netflix this month, Jolie has no interest in working on another film at this particular moment—her life just doesn’t have the space for it. Right now, “I’m just wanting to make the proper breakfast and keep the house. That’s my passion. At the request of my kids, I’m taking cooking classes. As I go to sleep at night, I think, Did I do a great job as a mom or was that an average day?” (But it is rumored she is negotiating to star in Bill Condon’s remake of the 1935 film The Bride of Frankenstein.) She’s reconnected with her father, from whom she’d been estranged. “He’s been very good at understanding they needed their grandfather at this time. I had to do a therapy meeting last night and he was just around. He knows kind of the rule—don’t make them play with you. Just be a cool grandpa who’s creative, and hang out and tell stories and read a book in the library.” Her main source of comfort has been Ung. “She’s that girlfriend who rolled up her sleeves, got on a plane, and helped me on Christmas morning,” says Jolie. “She’s been my closest friend. I cried on her shoulder.”", "images": ["https://web.archive.org/web/20170726183725im_/http://media.vanityfair.com/photos/59764e18b5f53c646c2dea5a/master/h_1440,c_limit/angelina-jolie-vf-0917-cover-ss05.png", "https://web.archive.org/web/20170726183725im_/http://media.vanityfair.com/photos/59764e6d7c67a060584ba8f8/master/h_1440,c_limit/angelina-jolie-vf-0917-cover-ss01.jpg", "https://web.archive.org/web/20170726183725im_/http://media.vanityfair.com/photos/59764e18fe060e64db80eb3f/master/h_1440,c_limit/angelina-jolie-0917-Vf-cover.png", "https://web.archive.org/web/20170726183725im_/http://media.vanityfair.com/photos/59764e19b5f53c646c2dea5c/master/h_1440,c_limit/angelina-jolie-vf-0917-cover-ss07.png", "https://web.archive.org/web/20170726183725im_/http://media.vanityfair.com/photos/59764e1790225743bcad6788/master/w_767,c_limit/angelina-jolie-vf-0917-cover-ss02.png", "https://web.archive.org/web/20170726183725im_/http://media.vanityfair.com/photos/59764e181bd71e4b33f10347/master/w_1440,c_limit/angelina-jolie-vf-0917-cover-ss04.png", "https://web.archive.org/web/20170726183725im_/http://media.vanityfair.com/photos/59764e19b5f53c646c2dea5e/master/h_1440,c_limit/angelina-jolie-vf-0917-cover-ss08.png", "https://web.archive.org/web/20170726183725im_/http://media.vanityfair.com/photos/5978bb411bd71e4b33f103c2/16:9/w_1200,h_630,c_limit/t-angelina-jolie-0917-Vf-cover.png", "https://web.archive.org/web/20170726183725im_/http://media.vanityfair.com/photos/5978ba1d7c67a060584ba972/master/h_1440,c_limit/angelina-jolie-vf-0917-cover-ss09.png", "https://web.archive.org/web/20170726183725im_/http://media.vanityfair.com/photos/597667f81bd71e4b33f10351/master/w_767,c_limit/a-angelina-jolie-vf-0917-cover-ss03.png"], "top_img": "https://web.archive.org/web/20170726183725im_/http://media.vanityfair.com/photos/5978bb411bd71e4b33f103c2/16:9/w_1200,h_630,c_limit/t-angelina-jolie-0917-Vf-cover.png", "keywords": [], "authors": ["Evgenia Peretz", "Mert Alas", "Marcus Piggott", "Jessica Diehl", "Vanity Fair", "Janine Di Giovanni", "Hilary Weaver"], "canonical_link": "https://web.archive.org/web/20170726183725/http://www.vanityfair.com/hollywood/2017/07/angelina-jolie-cover-story", "title": "Angelina Jolie’s Vanity Fair Cover Story", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no,width=device-width,initial-scale=1,maximum-scale=1", "parsely-metadata": "{\"rubric\":\"Cover Story\"}", "author": "Evgenia Peretz", "pubdate": "2017-07-26T12:44:00Z", "copyright": "Copyright (c) Condé Nast 2017", "description": "There’s the Angelina Jolie who’s now a single mother—managing the day-to-day chaos of six kids, and the trauma of her split from Brad Pitt—and there’s the Angelina Jolie whose latest movie, a groundbreaking Netflix original about Cambodia’s genocide, is also a thank-you to the nation that transformed her. At her new L.A. mansion, Jolie reveals the tension between the two Angelinas and the reason her life will never be normal.", "keywords": "article,cover story,angelina jolie,movies & film,brad pitt", "fb": {"pages": 8810407571, "app_id": 330433047345504}, "og": {"site_name": "HWD", "image": "https://web.archive.org/web/20170726183725im_/http://media.vanityfair.com/photos/5978bb411bd71e4b33f103c2/16:9/w_1200,h_630,c_limit/t-angelina-jolie-0917-Vf-cover.png", "title": "Cover Story: Angelina Jolie Solo", "description": "There’s the Angelina Jolie who’s now a single mother—managing the day-to-day chaos of six kids, and the trauma of her split from Brad Pitt—and there’s the Angelina Jolie whose latest movie, a groundbreaking Netflix original about Cambodia’s genocide, is also a thank-you to the nation that transformed her. At her new L.A. mansion, Jolie reveals the tension between the two Angelinas and the reason her life will never be normal.", "url": "https://web.archive.org/web/20170726183725/http://www.vanityfair.com/hollywood/2017/07/angelina-jolie-cover-story", "type": "article"}, "twitter": {"site": "@VanityFair", "domain": "www.vanityfair.com", "card": "summary_large_image", "title": "Cover Story: Angelina Jolie Solo", "description": "There’s the Angelina Jolie who’s now a single mother—managing the day-to-day chaos of six kids, and the trauma of her split from Brad Pitt—and there’s the Angelina Jolie whose latest movie, a groundbreaking Netflix original about Cambodia’s genocide, is also a thank-you to the nation that transformed her. At her new L.A. mansion, Jolie reveals the tension between the two Angelinas and the reason her life will never be normal.", "image": {"src": "http://media.vanityfair.com/photos/5978bb411bd71e4b33f103c2/16:9/pass/t-angelina-jolie-0917-Vf-cover.png?mbid=social_retweet"}}}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}