{"url": "https://www.harpersbazaar.com/celebrity/red-carpet-dresses/g3827/kate-middleton-princess-diana-photos/", "text": "The Best Songs of 2022 So Far\n\nEverything We Know About Pachinko\n\n21 Lingerie Brands to Know Right Now\n\nHow to Get Zoë Kravitz's 'Batman' Beauty Look\n\nThe Duchess of Cambridge often pays subtle sartorial tribute to her late mother-in-law.\n\nEvery product on this page was chosen by a Harper's BAZAAR editor. We may earn commission on some of the items you choose to buy.\n\nGetty Images As the wife of the future King of England, The Duchess of Cambridge is bound to draw comparisons between herself and her husband's late mother, Diana, Princess of Wales. Here, we're taking a look back at all the times Kate Middleton paid sartorial tribute to her late mother-in-law. View Gallery 51 Photos Getty Images 1 of 51 Diana in St. Albans in 1988; Kate at The Royal Opera House in 2019. Getty Images 2 of 51 Diana during a visit to Leckhampton in Gloucestershire in 1984; Kate at the Church of St. Mary Magdalene on the Sandringham estate in 2019. Getty Images 3 of 51 Diana at Birmingham airport in 1984; Kate at the Church of St. Mary Magdalene on the Sandringham estate in 2018. Getty Images 4 of 51 Diana during a visit to Bedfordshire in 1983; Kate at RAF Akrotiri in 2018. Shutterstock/Splash 5 of 51 Diana at the Remembrance Sunday Service in 1991; Kate in a Diane von Furstenberg coat at the same service in 2016. Getty Images 6 of 51 Diana in a polka dot dress and matching wide brim hat at the The Royal Ascot in 1988; Kate in a similar polka dress at the Wimbledon Tennis Championships in 2018. Getty Images 7 of 51 Princess Diana photographed in a polka dot dress with a white collar in 1985; Kate Middleton posing for Prince Charles' 70th birthday portraits in a Prada polka dot dress in November 2018. Getty Images 8 of 51 Princess Diana leaving St. Mary's Hospital with newborn Prince Harry in 1984 wearing a red collared dress and coat; Duchess Kate leaving the same hospital in 2018 with newborn son Prince Louis wearing a red dress with a white lace collar. Getty Images 9 of 51 Princess Diana attending a dinner at the British Embassy in 1985 wearing the \"Lover's Knot tiara\"; Kate Middleton wearing the same tiara for a state dinner in 2018. Getty Images 10 of 51 Lady Di in a gray coatwith black detailing during a visit to Barnardo's Charity in 1984; Kate Middleton in a similar blazer while arriving to Coach Core Essex in 2018. Getty Images 11 of 51 Princess Diana in a navy long-sleeve gown with a lace back to the 1985 premiere of Santa Claus: The Movie; Kate Middleton wearing a teal Jenny Packham dress with lace and button back detailing to a gala dinner at the Royal Albert Hall in 2012. Shutterstock / Getty 12 of 51 Princess Diana in a red houndstooth suit by Moschino during a royal visit to Canada in 1991; the Duchess of Cambridge in a red Catherine Walker houndstooth coat dress during a royal tour of Sweden in January 2018. Getty Images 13 of 51 Princess Diana at her wedding rehearsal in July 1981; the Duchess of Cambridge at the Sunken Garden at Kensington Palace in August 2017. Getty Images 14 of 51 Diana visits Westminster in June 1990; Kate visits the Stephen Lawrence Centre in London in March 2015. Getty Images 15 of 51 Princess of Wales on a visit to Portsmouth in 1989 wearing a plaid coat; the Duchess of Cambridge arriving at a Christmas party at Kensington Palace in a festive long plaid skirt in 2018. Getty Images 16 of 51 Diana in the Cambridge Lovers' Knot tiara in Hong Kong in 1989; Kate in the same tiara at Buckingham Palace in December 2016. Getty Images 17 of 51 Diana wearing Catherine Walker at a dinner in Paris in November 1988; Kate in Erdem at the 100 Women In Hedge Funds Gala at the Victoria and Albert Museum in October 2015. Getty Images 18 of 51 Diana and Charles at Ayers Rock in Australia in 1983; Kate and William at Ayers Rock in 2014. Getty Images 19 of 51 Diana visits the Barnados Charity in November 1984; Kate in Manchester in December 2017. Getty Images 20 of 51 Diana skiing in Switzerland in February 1986; Kate also skiing in Switzerland in March 2005. Getty Images 21 of 51 Diana in Catherine Walker in Qatar in November 1986; Kate in Jenny Packham at the Palladium Theatre in London in November 2017. Getty Images 22 of 51 Diana in Bruce Oldfield at a movie premiere in November 1991; Kate in Beulah London at a reception in Thimphu, Bhutan in April 2016. Getty Images 23 of 51 Diana in Jasper Conran during a visit to Canada in June 1983; Kate visiting Bacon's College in July 2012. Getty Images 24 of 51 Diana in Yuki before a dinner in Japan in May 1986; Kate in Jenny Packham at a Bollywood gala in Mumbai, India in April 2016. Getty Images 25 of 51 Diana in Catherine Walker on a visit to the Isle of Wight in May 1985; Kate in Alexander McQueen at Princess Charlotte's christening in July 2015. Getty Images 26 of 51 Diana attending a premiere in London's West End in April 1993; Kate in Temperley London meeting the Prime Minister of India in New Delhi in April 2016. 27 of 51 Diana in Versace at a dinner at the Field Museum Of Natural History in Chicago in June 1996; Kate celebrates National Canada Day in an Issa dress during the Royal Tour of North America in July 2011. 28 of 51 Diana at Buckingham Palace in 1980; Kate wearing Alexander McQueen in Charlottetown, Canada during the Royal Tour of North America in July 2011. 29 of 51 Diana in Bruce Oldfield at the Grosvenor House Hotel in London in March 1985; Kate in Jenny Packham at the National Memorial Arboretum Appeal at St James's Palace in London in November 2011. 30 of 51 Diana in 1988; Kate leaving for Clarence House for the reception following her wedding in April 2011. Next Vintage Photos of Prince Charles at Cambridge Advertisement - Continue Reading Below\n\nThis content is created and maintained by a third party, and imported onto this page to help users provide their email addresses. You may be able to find more information about this and similar content at piano.io", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-princess-diana-kate-middleton-twinning-houndstooth-1517421410.jpg?crop=0.492xw:0.984xh;0,0&resize=640:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-princess-diana-kate-middleton-twinning-5-1565885057.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-princess-diana-kate-middleton-twinning-3-1565884904.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-princess-diana-kate-middleton-twinning-houndstooth-1517421410-1-1566231503.jpg?crop=1.00xw:0.334xh;0,0&resize=1200:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-princess-diana-kate-middleton-twinning-4-1565884975.jpg?crop=1xw:1xh;center,top&resize=480:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-princess-diana-kate-middleton-twinning-houndstooth-1517421410-1-1566231503.jpg?crop=1.00xw:0.334xh;0,0&resize=1200:*", "keywords": [], "authors": ["Harper'S Bazaar Staff"], "canonical_link": "https://www.harpersbazaar.com/celebrity/red-carpet-dresses/g3827/kate-middleton-princess-diana-photos/", "title": "51 Times Kate Middleton Channeled Princess Diana's Style", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=6", "msapplication-tap-highlight": "no", "theme-color": "#606060", "og": {"type": "article", "site_name": "Harper's BAZAAR", "title": "Here's Every Time Kate Middleton Gave Us Major Princess Diana Style Vibes", "description": "The Duchess of Cambridge often pays subtle sartorial tribute to her late mother-in-law.", "url": "https://www.harpersbazaar.com/celebrity/red-carpet-dresses/kate-middleton-princess-diana-photos", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-princess-diana-kate-middleton-twinning-houndstooth-1517421410-1-1566231503.jpg?crop=1.00xw:0.334xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 227018747326504, "pages": 8327967561}, "article": {"publisher": "https://www.facebook.com/HarpersBazaar", "modified_time": "2021-03-03 03:24:32", "published_time": "2019-08-19 04:26:00", "section": "Red Carpet Dresses", "opinion": "false"}, "twitter": {"site": "@harpersbazaarus", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-princess-diana-kate-middleton-twinning-houndstooth-1517421410-1-1566231503.jpg?crop=1.00xw:0.334xh;0,0&resize=640:*"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "title": "51 Times Kate Middleton Channeled Princess Diana's Style", "description": "As the wife of the future King of England, Kate Middleton is bound to draw comparisons between herself and her husband's mother, Princess Diana.", "keywords": "kate middleton, kate middleton style, princess diana, kate middleton fashion, duchess of cambridge, princess diana style, kate and diana outfits", "auto-publish": "evergreen", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-princess-diana-kate-middleton-twinning-houndstooth-1517421410-1-1566231503.jpg?crop=1.00xw:0.668xh;0,0&resize=320:*", "sailthru.contenttype": "gallery", "sailthru.tags": "Celebrity,celebrity,red-carpet-dresses,princess diana,kate middleton style,red carpet dresses,catherine duchess of cambridge,kate middleton,fashion", "sailthru.date": "2019-08-19T16:26:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-princess-diana-kate-middleton-twinning-houndstooth-1517421410-1-1566231503.jpg?crop=1.00xw:0.334xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-princess-diana-kate-middleton-twinning-houndstooth-1517421410-1-1566231503.jpg?crop=1.00xw:0.668xh;0,0", "sailthru.socialtitle": "Here's Every Time Kate Middleton Gave Us Major Princess Diana Style Vibes", "sailthru.excerpt": "As the wife of the future King of England, The Duchess of Cambridge is bound to draw comparisons between herself and her husband's late mother, Diana, Princess of Wales. Here, we're taking a look back at all the times Kate Middleton paid sartorial tribute to her late mother-in-law."}, "movies": [], "publish_date": 1566181560.0, "source": "https://www.harpersbazaar.com", "summary": ""}