{"url": "www.inquisitr.com/4790472/angelina-jolie-reportedly-has-shocking-effect-on-brad-pitt-jennifer-aniston-turns-to-ex-reports-express/", "text": "Angelina Jolie filed for divorce from Brad Pitt in 2016, but the divorce proceedings still have not been finalized. Consequently, when Jennifer Aniston became single again after separating from Justin Theroux, Jolie reportedly had a shocking influence on Brad's feelings for Jennifer. As a result, Aniston has turned to her ex-boyfriend, Scottish actor Gerard Butler, an insider told the Express.\n\n\"[Jennifer Aniston is] really touched Gerard is doing everything he can to console her. When she's ready, there's no doubt he'll be at her side.\"\n\n\"[Brad Pitt and Jennifer Aniston are] never going to happen and there are six little reasons why: Brad's children with Angelina Jolie.\"\n\nAt this point in the custody and divorce proceedings, Brad reportedly is worried about Angelina's reaction. Jolie and Aniston allegedly are feuding, causing Pitt to fear that Angelina \"would hit the roof\" if he became romantically involved with Jennifer. Aniston's friend claimed that the situation could make the divorce proceedings \"extremely difficult.\"\n\nAlthough some reports have claimed that Pitt already introduced some of his kids to Jennifer when Aniston dropped by for a visit, the insider denied it. Instead, the source said that Brad is steering clear of Jennifer because he doesn't want Jolie to think \"he'd so much as introduced the kids to Jen during a visit.\"\n\nJennifer's friend told the Express that Brad wants to protect his children and that love has caused him to steer clear of Aniston.\n\n\"Brad loves his children dearly and he's not going to let anyone come between them if doing so would create custody problems and expose them to negative and invasive publicity.\"\n\nGerard once revealed that he feels Jennifer Aniston is a \"much better\" on-screen kisser than Angelina Jolie. Jen's friend told the Express that it's not a coincidence that Gerard has been supporting Jennifer, hinting that he knew her marriage was falling apart long before she and Justin Theroux announced their split.\n\nJennifer and Justin reportedly chose her 49th birthday to split. But a source told the newspaper that to those on the inside, it has been \"very obvious\" that their marriage was over. Jennifer and Justin \"led almost completely separate lives,\" added the insider. Theroux was primarily based in New York, while Aniston reportedly preferred their California mansion. That put thousands of miles between the two, causing them to grow \"completely apart,\" said the source.", "images": ["https://imgb.srgcdn.com/b5c635af-0182-490b-9ed0-70d493ce0bd7.jpg", "https://www.inquisitr.com/wp-content/uploads/2021/01/danica-patrick-2.jpg", "https://secure.gravatar.com/avatar/fa8aa86244d76bf2aee7e2fb5b934ea3?s=800", "https://imgb.srgcdn.com/2236d9db-e4d3-4354-b26e-38352fa5255d.jpg", "http://www.inquisitr.com/static/inquisitr/images/favicon-32x32.png", "https://imgb.srgcdn.com/5a8d67e0-f95c-458e-a699-7044c2610778.jpg", "https://imgb.srgcdn.com/cb72b1bf-36aa-44a8-a6c7-835711fcfff0.jpg", "https://imgb.srgcdn.com/75bc5f8f-bdb6-4450-8b34-19f657ce2327.jpg"], "top_img": "http://www.inquisitr.com/static/inquisitr/images/favicon-32x32.png", "keywords": [], "authors": [], "canonical_link": "https://www.inquisitr.com/4790472/angelina-jolie-reportedly-has-shocking-effect-on-brad-pitt-jennifer-aniston-turns-to-ex-reports-express/", "title": "Angelina Jolie's Alleged Shocking Impact On Brad Pitt Makes Jennifer Aniston Turn To Ex, Reports 'Express'", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimal-ui, user-scalable=no", "msapplication-TileImage": "/static/inquisitr/favicon-128x128.png", "robots": "max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Angelina Jolie's Alleged Shocking Impact On Brad Pitt Makes Jennifer Aniston Turn To Ex, Reports 'Express'", "url": "https://www.inquisitr.com/4790472/angelina-jolie-reportedly-has-shocking-effect-on-brad-pitt-jennifer-aniston-turns-to-ex-reports-express/", "site_name": "The Inquisitr", "description": "Angelina Jolie's Alleged Shocking Impact On Brad Pitt Makes Jennifer Aniston Turn To Ex, Reports 'Express'", "updated_time": "2021-08-16 18:13:43Z"}, "article": {"modified_time": "2021-08-16 18:13:43Z", "published_time": "2018-02-18 15:27:31Z", "section": "Rumors"}, "description": "Angelina Jolie's Alleged Shocking Impact On Brad Pitt Makes Jennifer Aniston Turn To Ex, Reports 'Express'", "keywords": "Rumors", "news_keywords": "Rumors", "twitter": {"card": "summary_large_image"}}, "movies": [], "publish_date": 1518967651.0, "source": "http://www.inquisitr.com", "summary": ""}