{"url": "https://en.wikipedia.org/wiki/Jodie_Whittaker", "text": "English actress (born 1982)\n\nJodie Whittaker (born 17 June 1982) is an English actress. She came to prominence in her 2006 feature film debut Venus, for which she received British Independent Film Award and Satellite Award nominations. She was later praised for her roles in the cult science fiction film Attack the Block (2011), the Black Mirror episode \"The Entire History of You\" (2011), and as grieving mother Beth Latimer in Broadchurch (2013–2017).\n\nOn 16 July 2017, the BBC announced that Whittaker would become the thirteenth incarnation of The Doctor[1] in the television series Doctor Who. She formally assumed the role from Peter Capaldi in the 2017 Christmas special episode \"Twice Upon a Time\" when Capaldi's Twelfth Doctor regenerated into Whittaker's Thirteenth Doctor. Whittaker appeared in her first full series as The Doctor in the eleventh series, which premiered in October 2018. She continued in the role in the twelfth series in 2020. Whittaker later announced that she would reprise her role as The Doctor into its thirteenth series.[2] It was announced on 29 July 2021 that she would step down after three special episodes in 2022.[3]\n\nEarly life [ edit ]\n\nJodie Whittaker[4] was born on 17 June 1982[4] in Skelmanthorpe, West Yorkshire. She is the second child and only daughter of Adrian Whittaker and Yvonne Whittaker (née Auckland).[5][6][7][8] She attended Scissett Middle School and Shelley High School before training at the Guildhall School of Music and Drama, graduating in 2005 with an acting gold medal.[9]\n\nCareer [ edit ]\n\nEarly career [ edit ]\n\nWhittaker made her professional debut in The Storm at Shakespeare's Globe in 2005.[9] She has since worked in film, television, radio and theatre. In 2007, she stood in at short notice for an unwell Carey Mulligan in the Royal Court's production of The Seagull, and appeared in a fundraising play at the Almeida Theatre.\n\nIn Whittaker's first major role, she co-starred as Jessie (Venus) in the film Venus. Her radio credits include a 2008 adaptation of Blinded by the Sun by Stephen Poliakoff[10] and Lydia Bennett in Unseen Austen, an original drama by Judith French. In 2009, she worked on the film Ollie Kepler's Expanding Purple World, the BBC2 drama Royal Wedding,[11] and the short film Wish 143,[12] which was nominated for the Academy Award for Live Action Short Film at the 83rd Academy Awards.[13]\n\nIn 2010, Whittaker appeared in the film The Kid and co-starred in BBC's Accused. She appeared in the 2009 Irish comedy crime film Perrier's Bounty. In 2011, she appeared as Viv in the BBC adaptation of Sarah Waters's novel The Night Watch and the cult film Attack the Block. In 2012, she starred in the musical comedy-drama Good Vibrations.\n\nWhittaker appeared in the crime drama Broadchurch, the reality-based spy drama miniseries The Assets, and the four-part BBC One medical drama Trust Me.[14]\n\nDoctor Who [ edit ]\n\nOn 16 July 2017, Whittaker was announced as the Thirteenth Doctor in the science fiction television series Doctor Who; she is the first woman to play the title role.[15][16][17] She had previously worked with incoming Doctor Who showrunner Chris Chibnall on Broadchurch.[18] She admitted that she had to \"tell a lot of lies\" after being cast to keep the information secret and used the codeword \"Clooney\" when talking about the role.[18] Whittaker kept her mother in \"the inner circle\" regarding knowledge of the role, as her father, Adrian, \"would have the ability to tell the world\".[19]\n\nShe urged fans not to be afraid of her gender, saying \"Doctor Who represents everything that's exciting about change. The fans have lived through so many changes, and this is only a new, different one, not a fearful one.\"[18] Chibnall said that he always wanted a woman for the part and that Whittaker was their first choice.[20]\n\nReaction to Whittaker's casting was mostly positive, although a \"sizeable minority\" was unhappy.[21] Some said that a female Doctor would be a good role model for young girls, while others felt the Doctor was only ever meant to be male, or criticised the casting as an exercise in political correctness.[22][23] Whittaker debuted in the 2017 Christmas special \"Twice Upon a Time\".[24][25]\n\nIn November 2018, the BBC confirmed that the twelfth series, Whittaker's second series, began production in November 2018.[26][27] Whittaker returned for the thirteenth series,[28] and is set to depart the programme following the series and three associated specials, to air by 2022.[29]\n\nPersonal life [ edit ]\n\nWhittaker met Belizean-American actor and writer Christian Contreras in drama school, and they married in Arizona in 2008.[5] She gave birth to their daughter in April 2015.[30] They now live in London[1] and are expecting their second child in 2022.[31]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nStage [ edit ]\n\nRadio [ edit ]\n\nYear Title Role Notes 2008 Blinded by the Sun [47] BBC Radio 4 Unseen Austen Lydia Bennett[48]\n\nVideo games [ edit ]\n\nYear Title Role Notes 2019 Doctor Who: The Runaway The Doctor (voice) Virtual Reality game by BBC[49] Doctor Who: The Edge of Time The Doctor (voice) Virtual Reality game by Maze Theory[50] 2021 Doctor Who: The Lonely Assassins The Doctor (voice) Video Game by Maze Theory & Kaigan Games, Cameo Role[50] Doctor Who: The Edge of Reality The Doctor (voice) Video Game by Maze Theory[50]\n\nMusic [ edit ]\n\nYear Title Album/Project Notes 2019 Yellow Children in Need: Got It Covered Single (#5 on the Official Big Top 40)", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Jodie_Whittaker_by_Gage_Skidmore.jpg/1200px-Jodie_Whittaker_by_Gage_Skidmore.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Jodie_Whittaker_by_Gage_Skidmore.jpg/220px-Jodie_Whittaker_by_Gage_Skidmore.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Jodie_Whittaker_by_Gage_Skidmore.jpg/1200px-Jodie_Whittaker_by_Gage_Skidmore.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jodie_Whittaker", "title": "Jodie Whittaker", "meta_data": {"generator": "MediaWiki 1.38.0-wmf.25", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Jodie_Whittaker_by_Gage_Skidmore.jpg/640px-Jodie_Whittaker_by_Gage_Skidmore.jpg", "width": 640, "height": 799}, "title": "Jodie Whittaker - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}