{"url": "https://durangoherald.com/articles/233325", "text": "On Monday, MTV aired footage of “Teen Mom 2″ star Jenelle Evans reaching for a handgun during a heated confrontation with an aggressive driver – all while her 8-year-old son sat beside her.\n\nIn an episode titled “Road Rage,” Evans called 911 to report the driver of a white truck she said had been tailgating her before speeding around her and slamming on his brakes. MTV displayed a black screen with type informing viewers that Evans chose to follow the driver after he turned off the highway. The next scene showed Evans reaching for a handgun and placing it beside her while her son, Jace, sat in the passenger seat.\n\nA chaotic series of events followed. Evans called her husband and told him that she was in front of the other driver’s house. MTV informed viewers that she “unintentionally backed in to the other driver’s mailbox.” Evans told her husband that the other driver hit her car and was blocking her in. “Dude, leave me alone!” she yelled before the show cut to another black screen: “At this point, Jenelle pulled out her firearm.”\n\nMTV showed Evans speeding away from the driver, who she said was following her. After apparently losing the driver’s trail, Evans tearily recounted the ordeal to a police officer who pulled her over after she turned onto another road. According to TMZ, neither driver was charged in the April incident.\n\nThis isn’t the first controversy involving Evans – or other cast members of MTV’s popular franchise, which launched in 2009 with “16 and Pregnant.” Let’s take a look back at some of the drama that has unfolded in front of (and away) from the cameras.\n\nJenelle Evans. Evans has a long string of arrests and legal issues – including a long-standing custody battle with her mother, Barbara Evans, over Jace. The mother of three has also spoken openly about battling drug addiction.In 2015, Evans was arrested in Myrtle Beach, South Carolina, for driving without a license. At the time, E! News reported that it was her 11th arrest in less than five years.\n\nIn February, her husband, David Eason – with whom she was shown talking in Monday’s episode – was fired by MTV after allegedly posting homophobic tweets.\n\nRyan Edwards. Edwards, who was featured alongside his ex-fiancee Maci Bookout on the first season of “16 and Pregnant,” was arrested Monday and charged with heroin possession, according to People.Edwards was last arrested in March for a probation violation. After that arrest, Us Weekly reported that Bookout had filed for orders of protection against her ex on behalf of herself, her husband, Taylor McKinney, and her three children – one of whom she shares with Edwards.\n\nEdwards announced last week that he and his wife, Mackenzie Standifer, would not be returning to the spinoff “Teen Mom OG.” Last June, the couple was featured in a harrowing scene that showed Edwards driving erratically – on the way to elope – as Standifer attempted to help him steer the vehicle and accused him of taking Xanax.\n\nMTV was criticized for airing footage of an impaired driver. “MTV does not condone driving under the influence,” the network said in a statement to People. “Ryan’s erratic behavior was due to actions that he took without anyone’s prior knowledge.”\n\nOn Friday, just days before his most recent arrest, Edwards slammed the network in an Instagram post about his struggles with addiction. “Help is out there, don’t take everything you see on MTV as factual truth,” he wrote. “They don’t want to show me or Mack in a happy light or that I am active in my recovery.”\n\nFarrah Abraham. Abraham, who was also part of the show that launched the “Teen Mom” franchise, was arrested in June after allegedly hitting a security guard at the Beverly Hills Hotel. According to TMZ, which published a video of Abraham yelling during her arrest, she was later charged with battery and resisting an officer.In 2013, she pleaded guilty and was sentenced to six months probation in a DUI case.\n\nAbraham said earlier this year that she would not return to “Teen Mom OG,” making room for new cast member Bristol Palin. In March, the reality star settled a lawsuit against MTV ‘s parent company, Viacom, after alleging the network “discriminated against ... and sex shamed” her after she appeared in pornographic videos.\n\nAmber Portwood. Also part of the original “16 and Pregnant” cast, Portwood was often shown having explosive – and physical – arguments with her ex-boyfriend, Gary Shirley – in some cases, arguing in front of their daughter Leah. In 2010, she was charged with felony domestic battery and child neglect. Shirley was arrested in 2011 – for driving with a suspended license – after one of their arguments.In 2012, Portwood was ordered to serve a five-year prison sentence for a felony drug charge after violating her probation requirements. She was released after 17 months.", "images": ["https://durangoherald.com/wp-content/themes/durango/images/durangoherald/top-bar-logo.png", "https://durangoherald.com/wp-content/themes/durango/images/weather-icons/partly-cloudy-day.png", "https://imengine.public.prod.dur.navigacloud.com/?uuid=9cb7b617-774d-5bc1-90c1-5fbec1a991aa&function=hardcrop&type=preview&source=false&width=390&height=202", "https://durangoherald.com/wp-content/themes/durango/images/article-header-logo.png", "https://imengine.public.prod.dur.navigacloud.com/?uuid=8013afc3-c405-5599-a464-d0b9176a2f1a&function=hardcrop&type=preview&source=false&width=390&height=202", "https://imengine.public.prod.dur.navigacloud.com/?uuid=501fac90-b958-56e8-9b35-f2251e4a4494&function=thumbnail&type=preview&source=false&width=423&height=237", "https://imengine.public.prod.dur.navigacloud.com/?uuid=cdaacb3b-623e-5548-bb92-1fe78b261132&function=thumbnail&type=preview&source=false&width=423&height=237", "https://imengine.public.prod.dur.navigacloud.com/?uuid=6E4AD7C9-7628-49AE-B7C9-384C10149A19&function=thumbnail&type=preview&source=false&width=423&height=237", "https://www.durangoherald.com/wp-content/themes/durango/images/default_article_image_dur.jpeg", "https://durangoherald.com/wp-content/themes/durango/images/weather-icons/clear-night.png", "https://durangoherald.com/wp-content/themes/durango/images/durangoherald/default_footer-logo.png", "https://durangoherald.com/wp-content/themes/durango/images/weather-icons/clear-day.png", "https://durangoherald.com/wp-content/themes/durango/images/weather-icons/cloudy.png", "https://imengine.public.prod.dur.navigacloud.com/?uuid=c5520d8f-c364-5255-9870-0d58cc0d0d94&function=hardcrop&type=preview&source=false&width=390&height=202"], "top_img": "https://www.durangoherald.com/wp-content/themes/durango/images/default_article_image_dur.jpeg", "keywords": [], "authors": ["Bethonie Butler"], "canonical_link": "https://www.durangoherald.com/articles/even-before-jenelle-evans-gun-incident-teen-mom-had-a-controversial-history/", "title": "Even before Jenelle Evans’ gun incident, ‘Teen Mom’ had a controversial history", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "mobile-web-app-capable": "yes", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "The Durango Herald - Breaking news and photos from Durango, Colorado", "title": "Even before Jenelle Evans’ gun incident, ‘Teen Mom’ had a controversial history", "pubdate": "2018-07-24", "author": "Bethonie Butler", "description": "On Monday, MTV aired footage of “Teen Mom 2″ star Jenelle Evans reaching for a handgun during a heated confrontation with an aggressive driver – all while her 8-year-old son sat beside her.          \n...", "og": {"title": "Even before Jenelle Evans’ gun incident, ‘Teen Mom’ had a controversial history", "type": "article", "url": "https://www.durangoherald.com/articles/even-before-jenelle-evans-gun-incident-teen-mom-had-a-controversial-history/", "site_name": "Durango Herald", "description": "On Monday, MTV aired footage of “Teen Mom 2″ star Jenelle Evans reaching for a handgun during a heated confrontation with an aggressive driver – all while her 8-year-old son sat beside her.          \n...", "image": "https://www.durangoherald.com/wp-content/themes/durango/images/default_article_image_dur.jpeg"}, "fb": {"app_id": 263076300371367, "pages": 205518469520233}}, "movies": [], "publish_date": null, "source": "https://durangoherald.com", "summary": ""}