{"url": "https://www.seventeen.com/fashion/celeb-fashion/g3011/gigi-hadid-street-style/", "text": "From bath robe-inspired jackets to lazy-girl sweats, Gigi Hadid expertly takes any trend and makes you want to buy it ASAP. Ahead, check out all her best street style moments throughout the years that you'll probably end up copying the next time you get dressed.\n\nThrift Store-Cool Getty Images Gigi's out here lookin' like she raided a vintage shop and I 100% approve this message. She leveled-up a grandpa sweater with a crisp white tee, mom jeans, and teeny shades.\n\nStatement Bra Getty Images This chic-as-hell ensemble gives you all the hot-girl vibes of a crop top, but looks so much more fashion. Structured trousers and glitzy chains give this look just the right amount of juxtaposition.\n\nBusiness Cool Getty Images Gigi's worn this outfit equation endless times (seriously, just keep scrolling), but somehow always makes it feel brand new. I think the secret here is those badass leopard boots, amiright?!\n\nFashion-Girl Western Getty Images This outfit is literally just a cream sweater, jeans, and a jacket, so why does it look so freaking cool? The secret's in the subtle western details: a silver belt, buffalo check, and aviators.\n\nAll-Over Plaid (With Just a Splash of Neon) Getty Images Gigi has been blessed with the otherworldly ability to pull off even the wildest outfit. She literally wore neon, on plaid, on more plaid, on more neon, with a statement shoe – AND PULLED IT OFF. How?! Just how?!?\n\nTrendy Taupes Getty Images Layering sandy earth tones is one of Instagram's biggest style aesthetics atm. But all that khaki needs a little help to not come off boring – thankfully, ya girl Gigi knows that texture is key.\n\nLeather + Blazer Getty Images This is my personal favorite outfit combo for when I want to look cool, but don't have the energy to scrape together a brand new outfit. Just throw on a white tee, an oversized blazer, and a dash of leather.\n\nGrown-Up American Girl Doll Getty Images Remember your American Girl Doll, Samantha? This is what she looks like now. Feel old yet?\n\nLots of Tie Dye Gotham Getty Images As further proof that there's nothing she can't pull off, Gigi just stepped out in a full, head-to-toe tie dye outfit. She wore a blue-splotched hoodie with matching joggers, then added a button-up shirt and Reeboks.\n\nAll-Over Orange Getty Images Dust off your middle school polo collection, because Gigi Hadid just brought them back to life. She wore a tangerine Ralph Lauren version – with the collar popped, no less – and a matching midi skirt to a party with Maybelline.\n\nPeriwinkle Layers Getty Images Good morning to Gigi Hadid's extensions only. The model unveiled inches on inches for the 2019 CFDAs. On top of that beauty moment, she brought a whole look, wearing an artsy belt bag and blazer with a skirt-meets-pants situation – a beautifully abstract ensemble that could only be designed by Louis Vuitton's Virgil Abloh.\n\nPink and Metallic Getty Images Gigi just beat her record for craziest outfit in a Pepto pink sweater, metallic printed pants, and a sleeping bag with arms. I aspire to be this level of extra.\n\nAthleisure AF Getty Images If anyone ever makes you feel guilty for wearing leggings as pants, just show them this majorly chic pic of Gigi. It's all the evidence you need.\n\nFluffy Duster Jacket Getty While promoting her new shoe collection with Stuart Weitzman, Gigi walked the red carpet in an all-white ensemble tied together with what's basically a fluffy bath robe. I'm living for this level of comfy.\n\nPuffer Jacket and Sweats Getty Forever on-trend, Gigi rocked a massive puffer coat in a majorly trendy hue. She glammed it up with futuristic sunglasses and a ribbed sweater with striped track pants.\n\nEverything Yellow Getty This sunny look is making me want to replace the piles of black in my closet for glowing yellow. Thanks for the shopping inspo, Gigi!\n\nWindbreaker Pants Getty Gigi just made those weird pants your 2nd grade crush used to wear look cool again. She paired her probably very loud windbreaker pants with a simple turtleneck, strappy heels, and angular shades.\n\nLeather Pants and Platforms Getty Gigi Hadid has just accomplished the seemingly impossible mission we've all been on since the age of six: finding Baby Spice's sky-high platform sneakers. The model killed the retro look, pairing her statement kicks with a Prada tee and leather skinnies.\n\nPrinted Jumpsuit Getty Well, the just-rolled-out-of-bed look will never be the same again. Gigi dominated in a silky pajama-inspired jumpsuit and green accessories with zero makeup.\n\nPunches of Red Getty It's not even October yet but Gigi is already channeling the spirit of Winnie Sanderson. Her pointed toe shoes and fur bag add a ~witchy~ touch to a classic jeans-and-a-white-tee combo.\n\nSpiderweb Top Getty Gigi Hadid is like the 2017 version of Cinderella, but instead of mice sewing her a ball gown, a team of spiders spun this delicate mesh top for her. At any rate, the spiders did a great job and this outfit is crazy cute.\n\nSummer Layers Getty The best way to amp up your crop top game: wear two. Gigi doubled up on teeny tops, then paired the duo with vintage-y patchwork jeans and cool shades.\n\nButton-Up With Jeans Getty Laid-back button-ups are Gigi's specialty, which is great for anyone trying to steal her style. Dupe this look with cropped jeans of your own – and if you don't have any, just chop those old flares you never wear.\n\nBold Boots Getty I'm beginning to think that Gigi's closet is literally just a room full of mom jeans – and honestly I'm jealous af. She paired her faves with an androgynous button-up and the most badass booties you've ever seen.\n\nPops of Crimson Getty As a dedicated lipstick-wearer, Gigi basically matched her entire outfit to her fave lippie: bright red. She rocked red shoes, a red crop, and red lipstick with denim staples to tie it all together.\n\nRodeo Chic Getty This Western-inspired look is cooler than I ever thought pink could be. Thank you, Gigi for blessing us with this outfit and teaching us that you can look like a total badass while wearing pink from head to toe.\n\nSequins and Satin Getty Over the weekend, Gi stepped out looking like a shimmery blush palette in an embellished all-over tube top and floaty bronze trousers. The orange-y goodness didn't stop there – the mega model rocked a subtly smoky terra cotta eye to pull the look together.\n\nElectric Orange Getty This bold bright shade is shaping up to be one of summer's hottest colors and if you don't believe me, just ask Gigi's pants. Per usual, the model added a bit of retro flare to her fit with a '70s-inspired denim jacket and cat eye sunnies.\n\nPaper Bag Pants Getty Pinterest's hottest trend just got the Gigi Hadid treatment! She paired powder blue paper bag pants with a matching slouchy sweater and yet another mini bag.\n\nThrowback Sweatshirt Getty G put a throwback spin on her signature crop top-jeans-booties equation. She rocked an old-school Nickelodeon Studios sweatshirt that my 9-year-old self would have killed for.\n\nGiraffe Pants Getty Gigi's pant game has been on point lately and it just took a major turn – towards the zoo, to be specific. The model rocked a pair of striped trousers with – SURPRISE! – a peek-a-boo giraffe on them. She totally pulled off the look, pairing the safari-friendly pants with a white crop and tangerine-colored sunnies.\n\nRemovable-Leg Pants Getty As a professional outfit-wearer, Gigi can pull off anything – including the 2017 version of those zip-off-at-the-knee pants from your childhood. Her all-white ensemble was anything but boring with these negative space booty short-jeans.\n\nChic AF PJs Getty Yes, you can take this laid-back look as a sign that you never need to wear real clothes again. Just go ahead and stay in your pajamas, Gigi Hadid approves.\n\nA Sweatsuit Fit for a Queen Getty There are three things all items in Gigi's closet must have: massive thigh slits, a subtle anthleisure vibe, and some kind of eye-grabbing detail. This super fancy sweatsuit checks off all three. But that level of slayage doesn't come cheap – the Sally LaPointe set costs $4,100. 😳\n\nThigh-Slit Pants Getty Think a pair of pants can't be shorts too? Gigi is here to prove you oh so wrong. She wore barely-there trousers while out and about in NYC, thoroughly confusing/enthralling the world.\n\n'50s Vibes Getty This look is basically what Barbie would wear if she became a motorcycle-riding extra in Grease.\n\nReppin' Zayn Malik Getty Like the wonderful gf that she is, Gi wore her BF's face for V-Day Z-Day. It looks like this is becoming her signature, because she pulled a similar move on Zayn's birthday.\n\nSuper Slouchy Getty Wearing off-the-shoulder coats is a fave celeb style trick. Gigi rocked the trend times two, with an oversized white top hanging off her shoulder, layered under a marshmallow coat that's also off-the-shoulder.\n\nBlack & Blue Getty Gigi's fav outfit recipe: cropped sweatshirt, cool duster, mom jeans, and metallic sunnies. Add accessories when needed.\n\nBeetlejuice 2.0 Getty All-over stripes are an easy way to spiced up a black/white/gray wardrobe. The look is classic, but totally non-boring.\n\nCool Coat Getty These sweats look runway ready thanks to Gigi's reflective shades and fashion-y coat.\n\nArmy-Inspired Layers Getty It looks like the Gi is rocking four different layers on top? It's weirdly amazing.\n\nTexture Overload Getty Snakeskin, studs, lace, brocade – there's nothing Gigi can't rock.\n\nPJ Top Getty \"If you make me leave my bed, I'm wearing pajamas.\" – Gigi probz\n\nStand-Out Accessories Getty The best way to make a white tee and jeans look fashion af: add glitter shoes, a funky coat, and some statement shades.\n\nAll the '70s Vibes Getty This chunky jacket perfectly balances out Gigi's massive flares – retro perfection.\n\nBath Robe and Slip Dress Getty Once again, G schools you in wearing pajamas in public.\n\nThe Chicest Sweats You've Ever Seen Getty Note to self: a trendy coat and over-the-top sunglasses make sweats look like real clothes.\n\nWhite on White Getty Gigi made all-white look totally wearable with pops of skin and an army green duster jacket. (Related: is there a duster that Gigi doesn't own?)\n\nModern Matrix Getty Chunky pink sunnies add a futuristic twist to these patent leather tent pants.\n\nPop of Denim Getty Gigi's grungy statement jacket keeps her all-black OOTD from looking boring.\n\nThis content is created and maintained by a third party, and imported onto this page to help users provide their email addresses. You may be able to find more information about this and similar content at piano.io", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-1209943707.jpg?crop=0.922xw:0.923xh;0.0629xw,0.0499xh&resize=480:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-1178326246.jpg?crop=0.954xw:0.899xh;0,0.0716xh&resize=480:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-1153622533.jpg?crop=1.00xw:0.752xh;0,0.0529xh&resize=1200:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/17-index-gigioutfits-1549990205.jpg?crop=1.00xw:1.00xh;0,0&resize=480:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-1200327312.jpg?crop=0.937xw:0.938xh;0.0629xw,0.0375xh&resize=480:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-1153622533.jpg?crop=1.00xw:0.752xh;0,0.0529xh&resize=1200:*", "keywords": [], "authors": ["Kelsey Stiegman"], "canonical_link": "https://www.seventeen.com/fashion/celeb-fashion/g3011/gigi-hadid-street-style/", "title": "49 Gigi Hadid Street Style Outfits You'll Want to Copy Immediately (Photos)", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=6", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Seventeen", "title": "Gigi Hadid is the Style Icon of Our Generation and I Will NOT Be Taking Questions", "description": "Would wear 99% of her outfits.", "url": "https://www.seventeen.com/fashion/celeb-fashion/g3011/gigi-hadid-street-style/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-1153622533.jpg?crop=1.00xw:0.752xh;0,0.0529xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 112965278727107, "pages": 8028997215}, "article": {"publisher": "https://www.facebook.com/seventeen", "modified_time": "2020-09-24 03:10:59", "published_time": "2020-09-24 03:08:00", "section": "Celeb Fashion", "opinion": "false"}, "twitter": {"site": "@seventeen", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-1153622533.jpg?crop=1.00xw:0.752xh;0,0.0529xh&resize=640:*"}, "google-site-verification": "uQMdsrh02fvs6lNVGcB04v0iEtK1MpGMQ3UF-Fy0RVI", "title": "49 Gigi Hadid Street Style Outfits You'll Want to Copy Immediately (Photos)", "description": "From bath robe-inspired jackets to lazy-girl sweats, Gigi can rock it all. Here are her best street style moments that you'll probably copy tomorrow.", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-1153622533.jpg?crop=0.639xw:0.959xh;0.155xw,0.0409xh&resize=320:*", "sailthru.contenttype": "listicle", "sailthru.tags": "Fashion,fashion,celeb-fashion,gigi hadid", "sailthru.date": "2020-09-24T15:08:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-1153622533.jpg?crop=1.00xw:0.752xh;0,0.0529xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-1153622533.jpg?crop=0.639xw:0.959xh;0.155xw,0.0409xh", "sailthru.socialtitle": "Gigi Hadid is the Style Icon of Our Generation and I Will NOT Be Taking Questions", "sailthru.excerpt": "From bath robe-inspired jackets to lazy-girl sweats, Gigi Hadid expertly takes any trend and makes you want to buy it ASAP. Ahead, check out all her best street style moments throughout the years that you'll probably end up copying the next time you get dressed."}, "movies": [], "publish_date": 1600909680.0, "source": "https://www.seventeen.com", "summary": ""}