{"url": "https://www.wanttoknow.info/newsstories-0-10000", "text": "News Stories Excerpts of Key News Stories in Major Media\n\nNote: This comprehensive list of news stories is usually updated once a week. Explore our full index to revealing excerpts of key major media news stories on several dozen engaging topics. And don't miss amazing excerpts from 20 of the most revealing news articles ever published.\n\nI've seen the saucers: Obama weighs in as US interest in UFOs rises\n\n2021-05-20, The Guardian (One of the UK's leading newspapers)\n\nPosted: 2022-03-14 17:45:22\n\nFor some time, expressing interest in unidentified flying objects, or UFOs, has been deemed mostly unacceptable in wider society. But attitudes appear to be changing in America this week, with luminaries from Barack Obama to the former NBA star Shaquille O'Neal sharing their thoughts. Obama was asked about the issue of UFOs during an interview. Much of the newfound, and newly sincere, interest in UFOs, this week appears to stem from a report on CBS's 60 Minutes on Sunday, which tackled \"the US government's grudging acknowledgment\" of UFOs. With the defense department and intelligence agencies due to deliver a much-anticipated official report on mysterious aerial sightings next month, 60 Minutes interviewed a number of credible witnesses, including a former navy pilot who said he had seen unidentified aerial phenomena – the government's preferred term – \"every day for at least a couple years\". That prompted Obama's discussion of aerial phenomena. \"What is true, and I'm actually being serious here, is that there's footage and records of objects in the skies, that we don't know exactly what they are, we can't explain how they moved, their trajectory,\" Obama told CBS. \"They did not have an easily explainable pattern. And so, you know I think that people still take seriously trying to investigate and figure out what that is. But I have nothing to report to you today.\" On Monday, O'Neal shared his experience of seeing a \"flying saucer\" with ABC.\n\nNote: Read the public testimony of very high level officials revealing a major cover-up around UFOs for over 75 years. Most serious UFO researchers believe that this is a planned rollout to avoid showing how the US military has been hiding and even deceitfully ridiculing this information for decades. For more along these lines, see concise summaries of deeply revealing news articles on UFOs from reliable major media sources.\n\nA former US Navy pilot said he saw UFOs off the Atlantic Coast every day, moving in a way that was impossible for scientists to explain\n\n2021-05-17, Yahoo! News\n\nPosted: 2022-03-14 17:43:28\n\nFormer US Navy pilot Ryan Graves told CBS's 60 Minutes that pilots training off the US coast sighted UFOs nearly every day. The show on Sunday explored a series of alleged recent encounters between US military pilots and UFOs, some of which were caught on film and have been released by the Pentagon. One encounter took place in 2014, when Graves and his F/A-18F squadron sighted UFOs in restrictive airspace near Virginia Beach, in southeastern Virginia. In 2019, US military pilots recorded UFOs in the same area in images obtained by the program. The Pentagon told CBS News that it had not been able to identify the objects. Graves said that such sightings were a nearly daily occurrence. \"Every day. Every day for at least a couple years,\" he said of the sightings. He discussed an encounter off the coast of Jacksonville, Florida, in 2015, captured by one of his pilots on camera. \"This is a difficult one to explain. You have rotation, you have high altitudes. You have propulsion, right? I don't know. I don't know what it is, frankly,\" remarked Graves. Lue Elizondo, the former head of a Pentagon project to investigate UFO sightings, said that some objects seemed to defy what was believed to be technologically possible. In April the US military certified the authenticity of several videos showing encounters between pilots and UFOs that had been published in the media. It followed the declassification last year of several videos showing encounters with UFOs.\n\nNote: Don't miss the 15-minute \"60 Minutes\" segment on this fascinating topic at the link above. Read the public testimony of very high level officials revealing a major cover-up around UFOs for over 75 years. Most serious UFO researchers believe that this is a planned rollout to avoid showing how the US military has been hiding and even deceitfully ridiculing this information for decades. For more along these lines, see concise summaries of deeply revealing news articles on UFOs from reliable major media sources.\n\nHere Comes the Full Amazonification of Whole Foods\n\n2022-02-28, New York Times\n\nPosted: 2022-03-14 17:41:27\n\n\"Would you like to sign in with your palm?\" That was the question a cheerful Amazon employee posed when greeting me last week at the opening of a Whole Foods Market in Washington's Glover Park neighborhood. For the next 30 minutes, I shopped. Then I simply walked out, no cashier necessary. Whole Foods – or rather Amazon – would bill my account later. More than four years ago, Amazon bought Whole Foods for $13 billion. Now the Amazon-ification of the grocery chain is physically complete. Amazon designed my local grocer to be almost completely run by tracking and robotic tools for the first time. The technology, known as Just Walk Out, consists of hundreds of cameras with a god's-eye view of customers. Sensors are placed under each apple, carton of oatmeal and boule of multigrain bread. Deep-learning software analyzes the shopping activity to detect patterns and increase the accuracy of its charges. The Whole Foods in Glover Park ... has sparked a spirited local debate, with residents sparring on the Nextdoor community app and a neighborhood email list over the store's \"dystopian\" feeling versus its \"impressive technology.\" Some ... said they had found errors in their bills and complained about the end of produce by the pound. Everything is now offered per item, bundle or box. Some mourned the disappearance of the checkout line, where they perused magazines. Many were suspicious of the tracking tech. \"It's like George Orwell's '1984,'\" said Allen Hengst, 72, a retired librarian.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on food system corruption and the disappearance of privacy from reliable major media sources.\n\nA white man got probation for voting fraud. A Black woman faced six years in prison for an error\n\n2022-03-03, The Guardian (One of the UK's leading newspapers)\n\nPosted: 2022-03-14 17:39:40\n\nIn the late summer of 2020, Bruce Bartman went to Pennsylvania's voter registration website and signed up his mother and mother-in-law to vote. Both women were dead. A few months later, Bartman, who is white, requested a mail-in ballot for his late mother and cast her vote for Donald Trump. Bartman was arrested that December and charged with perjury and unlawful voting. He pleaded guilty, admitted he made a \"stupid mistake\", was sentenced to five years of probation and barred from serving on a jury or voting for four years. When Bartman pleaded guilty, nearly 1,000 miles away, in Memphis, a Black Lives Matter activist named Pamela Moses was facing her own election-related criminal charges. A few years previously, Moses, who is Black, permanently lost the right to vote after committing a felony. But no one had actually removed Moses from the voter rolls or told her she couldn't vote. And in 2019, when state officials began looking into her eligibility, a probation officer signed a certificate saying Moses had completed her sentence and was eligible to vote. So she applied to do so. Even though corrections officials conceded they made an error, Moses was indicted anyway. She was sentenced to six years and one day in prison. The case ... underscored what many experts see as a double standard in the US criminal justice system: white people face relatively light punishment for intentional cases of fraud, while Black people face tougher punishments for unintentional voting errors.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on court system corruption from reliable major media sources.\n\nSupreme Court rules against disclosure in torture case\n\n2022-03-03, NPR\n\nPosted: 2022-03-14 17:37:46\n\nThe Supreme Court ruled Thursday that the federal government can shield former government contractors from testifying about the torture of a post-9/11 detainee. The decision likely will make it harder for victims to expose secret government misconduct in the future. Abu Zubaydah was the first prisoner held by the CIA to undergo what, at the time, was euphemistically called \"enhanced interrogation.\" During one 20-day period, he was waterboarded 83 times, 24 hours a day. During that period, the suspected terrorist was also slammed against walls, put in a coffin-like box for hours at a time to simulate live burial, and subjected to something the government called \"rectal rehydration.\" In the end, the two CIA contractors who supervised Zubaydah's interrogation concluded that they had the wrong man. But when lawyers for Zubaydah subpoenaed them, the U.S. government blocked the move by invoking the so-called \"state secrets\" privilege. In this case, both the Trump and Biden administrations argued that even though the information about the torture program is widely known, confirming the existence of CIA black sites in Poland would jeopardize the U.S. government's relationship with foreign intelligence services. Josh Colangelo-Bryan, a lawyer who represents other Guantanamo Bay detainees, was ... critical. \"There has been no accountability for the U.S. program that subjected people to torture,\" he said in a statement.\n\nNote: Read more about the CIA's torture program. For more along these lines, see concise summaries of deeply revealing news articles on intelligence agency corruption from reliable major media sources.\n\nSwitzerland at risk of EU blacklist after Credit Suisse leak\n\n2022-02-21, The Guardian (One of the UK's leading newspapers)\n\nPosted: 2022-03-14 17:35:46\n\nThe fallout from a huge leak of Credit Suisse banking data threatened to damage Switzerland's entire financial sector on Monday after the European parliament's main political grouping raised the prospect of adding the country to a money-laundering blacklist. The European People's party (EPP), the largest political grouping of the European parliament, called for the EU to review its relationship with Switzerland and consider whether it should be added to its list of countries associated with a high risk of financial crime. Experts said that such a move would be a disaster for Switzerland's financial sector, which would face the kind of enhanced due diligence applied to transactions linked to rogue nations including Iran, Myanmar, Syria and North Korea. The EPP released the proposal after media outlets including the Guardian, SĂĽddeutsche Zeitung, the Organized Crime and Corruption Reporting Project (OCCRP), and Le Monde revealed how a massive leak of Credit Suisse data had uncovered apparently widespread failures of due diligence by the bank. The investigation, called Suisse secrets, identified clients of the Swiss bank who had been involved in torture, drug trafficking, money laundering, corruption and other serious crimes. The country's addition to the EU high-risk third countries list would mean regulated professions, such as bankers, lawyers and accountants, would be required to conduct enhanced due diligence on any transaction or commercial relationship with a person or company in the country.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on financial system corruption from reliable major media sources.\n\nPlastic particles falling out of sky with snow in Arctic\n\n2019-08-14, BBC News\n\nPosted: 2022-03-14 17:33:28\n\nIn the Arctic, microscopic particles of plastic are falling out of the sky with snow. Scientists said they were shocked by the sheer number of particles they found: more than 10,000 of them per litre in the Arctic. Even there, people are likely to be breathing in microplastics from the air. The health implications remain unclear. The region is often seen as one of the world's last pristine environments. A German-Swiss team of researchers has published the work in the journal Science Advances. The scientists also found rubber particles and fibres in the snow. Researchers collected snow samples from the Svalbard islands. In the laboratory ... they discovered far more contaminating particles than they'd expected. Many were so small that it was hard to ascertain where they had come from. The majority appeared to be composed of natural materials like plant cellulose and animal fur. But there were also particles of plastic, along with fragments of rubber tyres, varnish, paint and possibly synthetic fibres. The lead scientist, Dr Melanie Bergmann, told BBC News: \"We expected to find some contamination but to find this many microplastics was a real shock.\" She said: \"The majority of the microplastic in the snow comes from the air.\" Microplastics are defined as those particles below 5mm in size. Addressing their potential effects on people, Dr Bergmann explained: \"We don't know if the plastics will be harmful to human health or not. But we need to take much better care of the way we're treating our environment.\"\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on health from reliable major media sources.\n\nCIA's Gus Hunt On Big Data: We 'Try To Collect Everything And Hang On To It Forever'\n\n2013-03-20, Huffington Post\n\nPosted: 2022-03-14 17:31:04\n\nThe CIA's chief technology officer outlined the agency's endless appetite for data in a far-ranging speech. Ira \"Gus\" Hunt said that the world is increasingly awash in information from text messages, tweets, and videos - and that the agency wants all of it. \"The value of any piece of information is only known when you can connect it with something else that arrives at a future point in time,\" Hunt said. \"Since you can't connect dots you don't have, it drives us into a mode of, we fundamentally try to collect everything and hang on to it forever.\" Hunt's comments come two days after Federal Computer Week reported that the CIA has committed to a massive, $600 million, 10-year deal with Amazon for cloud computing services. \"It is really very nearly within our grasp to be able to compute on all human generated information,\" Hunt said. After that mark is reached, Hunt said, the agency would also like to be able to save and analyze all of the digital breadcrumbs people don't even know they are creating. \"You're already a walking sensor platform,\" he said, noting that mobiles, smartphones and iPads come with cameras, accelerometers, light detectors and geolocation capabilities. \"Somebody can know where you are at all times, because you carry a mobile device, even if that mobile device is turned off,\" he said. Hunt also spoke of mobile apps that will be able to control pacemakers - even involuntarily - and joked about a \"dystopian\" future. Hunt's speech barely touched on privacy concerns.\n\nNote: The Internet of Things makes mass surveillance even easier. For more along these lines, see concise summaries of deeply revealing news articles on intelligence agency corruption and the disappearance of privacy from reliable major media sources.\n\nHere's Who MacKenzie Scott Donated To So Far In February\n\n2022-02-12, Forbes\n\nPosted: 2022-03-14 17:28:53\n\nMacKenzie Scott, the ex-wife of Amazon founder Jeff Bezos, is giving away her $46 billion fortune faster than anyone in history. In February alone, nine organizations announced gifts from Scott totaling $264.5 million. The largest donation, $133.5 million, went to Communities in Schools, a non-profit that helps keep at-risk children in schools. Another education nonprofit, Leading Educators, got $10 million to provide professional development for teachers. Scott donated to two organizations combatting addiction: $5 million to Shatterproof and $3 million to Young People in Recovery. Two groups focusing on reproductive rights, the Guttmacher Institute and the Collaborative for Gender + Reproductive Equity, received $15 million and $25 million respectively. The National Council on Aging got $8 million, while mental health nonprofit the Jed Foundation got $15 million. Additionally, the National 4-H Council, an agriculturally focused youth organization, received $50 million. Since divorcing Bezos in 2019, the 51-year-old Scott has emerged as one of the most secretive and prolific philanthropists in the world. Including February's gifts, she has given away a total of $8.8 billion in less than two years to more than 780 organizations–more than four times what her ex-husband has donated so far in his lifetime. Scott's gifts come in the form of unrestricted grants, meaning that nonprofits can spend the money however they want rather than on particular programs.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nAlzheimer's Disease: Music Brings Patients 'Back to Life'\n\n2012-04-11, ABC News\n\nPosted: 2022-03-14 17:27:13\n\nHenry Dryer sits slumped over the tray attached to his wheelchair. He doesn't speak, and rarely moves, until a nursing home worker puts his headphones on. Then Dryer's feet start to shuffle, his folded arms rock back and forth, and he sings out loud in perfect sync with his favorite songs. \"I feel a band of love, dreams,\" said Dryer, 92, who has dementia. \"It gives me the feeling of love, romance!\" Henry is one of seven patients profiled in the documentary \"Alive Inside,\" a heartwarming look at the power of music to help those in nursing homes. \"There are a million and a half people in nursing homes in this country,\" director Michael Rossato-Bennett told ABC News. \"When I saw what happened to Henry, whenever you see a human being awaken like that, it touches something deep inside you.\" Rossato-Bennett said he took on the documentary project to promote Music & Memory, a nonprofit organization that brings iPods with personalized music to dementia patients in nursing home care. \"When I end up in a nursing home, I'll want to have my music with me,\" said Dan Cohen, executive director of Music & Memory. \"There aren't many things in nursing homes that are personally meaningful activities. Here's the one easy thing that has a significant impact.\" Cohen said the personalized playlists, chosen by loved ones, make patients light up. \"They're more alert, more attentive, more cooperative, more engaged,\" he said. \"Even if they can't recognize loved ones and they've stopped speaking, they hear music and they come alive.\"\n\nNote: Don't miss this profoundly touching and inspiring documentary available here. Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nCan MDMA Save a Marriage?\n\n2022-02-08, New York Times\n\nPosted: 2022-03-14 17:25:35\n\nAfter 10 years of marriage, Ree, 42, and her husband were ready to call it quits. Then a friend suggested that they try the illegal drug MDMA, popularly known as Ecstasy or Molly. For Ree ... the answer was an \"immediate no.\" Six months later, after reading \"How to Change Your Mind,\" the best-selling book by Michael Pollan that details his transformative experience with psychedelics, Ree reconsidered. And that's how they found themselves in a secluded area of Utah at a large, rented house with a beautiful view of the mountains to trip on MDMA with five other couples. During their first trip on MDMA, Ree said she and her husband tearfully discussed things they had trouble speaking about for the last decade: How his emotional withdrawal had affected her self-esteem, and how sorry she was that she had continually pushed him to open up without understanding the pain he held inside. \"My husband started sharing with me for the first time all these thoughts and emotions,\" Ree said. \"It was him without the walls,\" she added. They also cuddled in bed for hours, skin to skin, describing all the things they loved about one another. \"For a person who has always had body image issues, to allow him to touch me – touch my stomach, the part of me I don't love, was incredibly healing,\" she said. They continued using MDMA about twice a year to help them have difficult conversations. They both started seeing therapists. Now, about three years after they first tried MDMA ... they no longer need the drug to speak openly with one another.\n\nNote: Read more about the healing potentials of mind-altering drugs. Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nUFOs regularly spotted in restricted U.S. airspace\n\n2021-08-29, CBS News\n\nPosted: 2022-03-06 23:05:10\n\nEarlier this summer, the director of national intelligence and secretary of defense released a highly-anticipated, unclassified report about something the Pentagon calls unidentified aerial phenomena–or UAP–more commonly known as UFOs. The government's grudging acknowledgment of 144 mysterious sightings documented by our military comes after decades of public denial. Luis Elizondo spent 20 years running military intelligence operations worldwide. He hadn't given UFOs a second thought until 2008. That's when he was asked to join something at the Pentagon called the Advanced Aerospace Threat Identification Program, or \"AATIP.\" Buried away in the Pentagon, AATIP was part of a $22 million program sponsored by then-Senate Majority Leader Harry Reid to investigate UFOs. When Elizondo took over in 2010 he focused on the national security implications of unidentified aerial phenomena documented by U.S. service members. \"Imagine a technology that can do 6-to-700 g-forces, that can fly at 13,000 miles an hour, that can evade radar and that can fly through air and water and possibly space,\" [said Elizondo]. \"And oh, by the way, has no obvious signs of propulsion, no wings, no control surfaces and yet still can defy the natural effects of Earth's gravity. That's precisely what we're seeing.\" AATIP's funding was eliminated in 2012, but ... last year, the Pentagon resurrected AATIP, it's now called the UAP task force; service members now are encouraged to report strange encounters.\n\nNote: Read the public testimony of very high level officials revealing a major cover-up around UFOs for over 75 years. Most serious UFO researchers believe that this is a planned rollout to avoid showing how the US military has been hiding and even deceitfully ridiculing this information for decades. For more supporting this idea, see concise summaries of deeply revealing news articles on UFOs from reliable major media sources.\n\n'Something's coming': is America finally ready to take UFOs seriously?\n\n2022-02-05, The Guardian (One of the UK's leading newspapers)\n\nPosted: 2022-03-06 23:03:28\n\nLast year was a breakthrough time for UFOs, as a landmark government report prompted the possibility of extraterrestrial visitors to finally be taken seriously by everyone from senators, to a former president, to the Pentagon. But 2022 could be even more profound, experts say. In June, the Pentagon released a highly anticipated report on unexplained aerial phenomena (UAP), the now preferred nomenclature by some in the extraterrestrial community, which found more than 140 instances of UAPs that could not be explained. The report came after leaked military footage documented seemingly otherworldly happenings in the sky, and after testimony from navy pilots helped to somewhat destigmatize a subject that has long been defined by conspiracy theories and dubious sightings. \"I'm confident that 2022 is going to be a seismic year for UFOs,\" said Nick Pope, who spent the early 1990s investigating UFOs for the British ministry of defence. In Congress ... a bipartisan group of senators has been pushing for years for the government to release more information on UFOs, and from the US defense department and intelligence community. For years, pilots had refused to share tales of their UFO experiences, worried of being labeled kooks. The account of the navy pilots was given credibility, however, by leaked military footage which showed an oval flying object near a US navy ship off San Diego, and separate videos which showed triangular-shaped objects buzzing around in the sky.\n\nNote: Watch the CBS 60 Minutes segment on this webpage. Read the public testimony of very high level officials revealing a major cover-up around UFOs for over 75 years. Most serious UFO researchers believe that this is a planned rollout to avoid showing how the US military has been hiding and even deceitfully ridiculing this information for decades. For more supporting this idea, see concise summaries of deeply revealing news articles on UFOs from reliable major media sources.\n\nSummary of Terrorism Threat to the U.S. Homeland\n\n2022-02-07, U.S. Department of Homeland Security\n\nPosted: 2022-03-06 23:01:20\n\nThe United States remains in a heightened threat environment fueled by several factors, including an online environment filled with false or misleading narratives and conspiracy theories, and other forms of mis- dis- and mal-information (MDM) introduced and/or amplified by foreign and domestic threat actors. These threat actors seek to exacerbate societal friction to sow discord and undermine public trust in government institutions to encourage unrest, which could potentially inspire acts of violence. The convergence of the following factors has increased the volatility, unpredictability, and complexity of the threat environment: (1) the proliferation of false or misleading narratives, which sow discord or undermine public trust in U.S. government institutions; (2) continued calls for violence directed at U.S. critical infrastructure; and (3) calls by foreign terrorist organizations for attacks on the United States. COVID-19 mitigation measures–particularly COVID-19 vaccine and mask mandates–have been used by domestic violent extremists to justify violence since 2020 and could continue to inspire these extremists to target government, healthcare, and academic institutions that they associate with those measures. Domestic violent extremists have ... have recently aspired to disrupt U.S. electric and communications critical infrastructure, including by spreading false or misleading narratives about 5G cellular technology.\n\nNote: Since when does questioning how much we trust our government make a person an extremist or terrorist? What ever happened to the first amendment of the U.S. Constitution? Our founding fathers would likely have been declared terrorists by the DHS. So sad... For more along these lines, see concise summaries of deeply revealing news articles on government corruption and the erosion of civil liberties from reliable major media sources.\n\nThe US government is deploying robot dogs to the Mexico border. Seriously?\n\n2022-02-14, The Guardian (One of the UK's leading newspapers)\n\nPosted: 2022-03-06 22:59:06\n\nThe military, technological, security and political classes in this country appear united in their desire to make robot dogs part of our future, and we should all be worried. On 1 February ... the Department of Homeland Security (DHS) issued a press release titled \"Robot Dogs Take Another Step Towards Deployment at the Border\". DHS dressed up their statement with the kind of adorable language made to warm the hearts of dog lovers everywhere. A picture of the \"four-legged ground drone\" accompanied the release. These particular robot dogs are made by Ghost Robotics, which claims that its 100lb machine was \"bred\" to scale \"all types of natural terrain including sand, rocks and hills, as well as human-built environments, like stairs\". Each robot dog is outfitted with a bevy of sensors and able to transmit real-time video and information feeds. A testing and evaluation program is under way in El Paso, Texas. As the Electronic Frontier Foundation notes, \"people who live along the border are some of the most heavily surveilled people in the United States. A massive amalgamation of federal, state and local law enforcement and national security agencies are flying drones, putting up cameras and just generally attempting to negate civil liberties – capturing the general goings-on of people who live and work in proximity to the border.\" Then there's the question of lethal force. These specific ground drones may not be armed, but Ghost Robotics is already infamous for the combination of robot dog and robot rifle.\n\nNote: Singapore used robot dogs to enforce pandemic distancing measures. For more along these lines, see concise summaries of deeply revealing news articles on government corruption and the disappearance from reliable major media sources.\n\nKilling of ISIS Leader Shows That U.S. Forever Wars Will Never End\n\n2022-02-03, The Intercept\n\nPosted: 2022-03-06 22:57:07\n\nIn a national address delivered this morning, President Joe Biden performed what has now become a familiar ritual for U.S. politicians: announcing the death of a terrorist leader. The latest enemy figure whose death has been presented to Americans as a victory was the head of the Islamic State in Iraq and Syria, Abu Ibrahim al-Hashimi al-Quraishi, who was reportedly killed alongside his family during a U.S. special forces raid in northern Syria. Biden characterized the raid as a victory that had made the world more secure, and without cost to Americans. The raid on a home where al-Quraishi was staying killed a total of 13 people, including a number of women and children. Images on social media of mangled corpses immediately began circulating in the aftermath. Since the outset of the Global War on Terrorism over two decades ago, the periodic killings of commanders from groups like the Taliban, Al Qaeda, al-Shabab, and, most recently, the Islamic State in Iraq and Syria have been touted as significant victories. Despite these repeated tactical victories ... the underlying wars themselves have continued. The killing of al-Quraishi [is] unlikely to mean an end to the U.S. \"forever wars\" in the region, which have switched to a permanent mode of militarized policing in which the U.S. reserves the right to carry out bombings and assassinations at will but does not refer to these actions as \"war,\" even when civilians are killed.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on military corruption from reliable major media sources.\n\nCovid-19: WHO efforts to bring vaccine manufacturing to Africa are undermined by the drug industry\n\n2022-02-09, The BMJ (Formerly British Medical Journal)\n\nPosted: 2022-03-06 22:55:34\n\nA foundation representing the vaccine maker BioNTech has been accused of seeking to undermine the World Health Organization's initiative to bring covid vaccine manufacturing to the African continent. The kENUP Foundation, a consultancy hired by BioNTech, has claimed that WHO's hub, which is creating a covid-19 mRNA vaccine that African companies can make, is unlikely to be successful and will infringe on patents, documents obtained by The BMJ have shown. Instead, they show kENUP promoting BioNTech's proposal to ship mRNA factories housed in sea containers from Europe to Africa, initially staffed with BioNTech workers, and a proposed new regulatory pathway to approve the vaccines made in these factories. The novel pathway has been described as paternalistic and unworkable. The move threatens the pan-African venture backed by WHO that seeks to scale up African production of lifesaving vaccines from 1% to 60% by 2040. WHO's technology transfer hub, launched in June 2021 and based in South Africa, uses publicly available information to recreate Moderna's vaccine, to teach companies and scientists across the continent how to use mRNA technology. It will then develop a comparable vaccine, which, if successful in clinical trials and approved by regulators, it will manufacture industrially. In a document sent to South African government officials after a visit to the country on 11-14 August last year, the kENUP Foundation said that the hub's activity should be stopped.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on coronavirus vaccines and Big Pharma profiteering from reliable major media sources\n\nWorld spends $1.8tn a year on subsidies that harm environment, study finds\n\n2022-02-16, The Guardian (One of the UK's leading newspapers)\n\nPosted: 2022-03-06 22:53:53\n\nThe world is spending at least $1.8tn (Ł1.3tn) every year on subsidies driving the annihilation of wildlife and a rise in global heating, according to a new study, prompting warnings that humanity is financing its own extinction. From tax breaks for beef production in the Amazon to financial support for unsustainable groundwater pumping in the Middle East, billions of pounds of government spending and other subsidies are harming the environment, says the first cross-sector assessment for more than a decade. This government support, equivalent to 2% of global GDP, is directly working against the goals of the Paris agreement and draft targets on reversing biodiversity loss, the research on explicit subsidies found, effectively financing water pollution, land subsidence and deforestation with state money. The fossil fuel industry ($620bn), the agricultural sector ($520bn), water ($320bn) and forestry ($155bn) account for the majority of the $1.8tn, according to the report. No estimate for mining, believed to cause billions of dollars of damage to ecosystems every year, could be derived. Lack of transparency between governments and recipients means the true figure is likely to be much higher, as is the implicit cost of harmful subsidies. Last year, an International Monetary Fund report found the fossil fuel industry benefited from subsidies worth $5.9tn in 2020.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on government corruption and climate change from reliable major media sources.\n\nEverybody Does It: The Messy Truth About Infiltrating Computer Supply Chains\n\n2019-01-24, The Intercept\n\nPosted: 2022-03-06 22:52:16\n\nBloomberg Businessweek published an alarming story: Operatives working for China's People's Liberation Army had secretly implanted microchips into motherboards made in China and sold by U.S.-based Supermicro. This allegedly gave Chinese spies clandestine access to servers belonging to over 30 American companies, including Apple, Amazon, and various government suppliers, in an operation known as a \"supply chain attack,\" in which malicious hardware or software is inserted into products before they are shipped to surveillance targets. U.S. spy agencies ... assessed that China was adept at corrupting the software bundled closest to a computer's hardware at the factory, threatening some of the U.S. government's most sensitive machines, according to documents provided by National Security Agency whistleblower Edward Snowden. The documents also detail how the U.S. and its allies have themselves systematically targeted and subverted tech supply chains, with the NSA conducting its own such operations, including in China, in partnership with the CIA and other intelligence agencies. The documents also disclose supply chain operations by German and French intelligence. Computer hardware can be altered at various points along the supply chain, from design to manufacturing to storage to shipment. The U.S. is among the small number of countries that could, in theory, compromise devices at many different points in this pipeline, thanks to its resources and geographic reach.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on intelligence agency corruption and the disappearance of privacy from reliable major media sources.\n\nAlive Inside documentary shows the healing power of music\n\n2012-04-12, The Guardian (One of the UK's leading newspapers)\n\nPosted: 2022-03-06 22:50:23\n\nHenry Dryer, 92, is one of seven patients profiled in the documentary Alive Inside, a look at the power of music to help those with Alzheimer's. A clip of Dryer, who suffers from dementia, appears in an extraordinarily moving rough cut of the documentary that went up online this week. In the clip, which has been viewed 3 million times already, Dryer is largely mute and slumped over. He does not recognize his own daughter. But when a caregiver places a pair [of] headphones on him, he undergoes an astonishing transformation. His face, formerly slack and inert, lights up. His eyes beam, and he sways in his chair, keening along to the music of his youth. The effect lasts even after the headphones are removed. \"I'm crazy about music,\" Dryer says. \"I guess Cab Calloway was my number one band guy.\" Music \"gives me the feeling of love\", Dryer says. Author and neurologist Oliver Sacks, who has written extensively about the effects of music on the human brain, watches Dryer. \"In some sense, Henry is restored to himself. He remembers who he is. He has reaquired his identity for a while through the power of music,\" Sacks says in the Alive Inside clip. \"There are a million and a half people in nursing homes in this country,\" Alive Inside director Michael Rossato-Bennett told ABC News. \"When I saw what happened to Henry, whenever you see a human being awaken like that, it touches something deep inside you.\"\n\nNote: Don't miss this profoundly touching and inspiring documentary available here. Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nLife may actually flash before your eyes on death - new study\n\n2022-02-23, BBC News\n\nPosted: 2022-03-06 22:48:39\n\nNew data from a scientific \"accident\" has suggested that life may actually flash before our eyes as we die. A team of scientists set out to measure the brainwaves of an 87-year-old patient who had developed epilepsy. But during the neurological recording, he suffered a fatal heart attack - offering an unexpected recording of a dying brain. It revealed that in the 30 seconds before and after, the man's brainwaves followed the same patterns as dreaming or recalling memories. Brain activity of this sort could suggest that a final \"recall of life\" may occur in a person's last moments, the team wrote in their study, published in Frontiers in Aging Neuroscience. Dr Ajmal Zemmar, a co-author of the study, said that what the team, then based in Vancouver, Canada, accidentally got, was the first-ever recording of a dying brain. \"I never felt comfortable to report one case,\" Dr Zemmar said. And for years after the initial recording in 2016, he looked for similar cases to help strengthen the analysis but was unsuccessful. But a 2013 study - carried out on healthy rats - may offer a clue. In that analysis, US researchers reported high levels of brainwaves at the point of the death until 30 seconds after the rats' hearts stopped beating - just like the findings found in Dr Zemmar's epileptic patient. The similarities between studies are \"astonishing\", Dr Zemmar said. They now hope the publication of this one human case may open the door to other studies on the final moments of life.\n\nNote: Read one of the most moving, miraculous accounts ever of a near-death experience. Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nA Psychedelic May Soon Go to the FDA for Approval to Treat Trauma\n\n2022-02-01, Scientific American\n\nPosted: 2022-03-06 22:46:38\n\nBerra Yazar-Klosinski [is the] chief scientific officer at the Multidisciplinary Association for Psychedelic Studies (MAPS). I ... committed to working with her on the phase 3 program that would assess the efficacy and safety of MDMA–known recreationally as Molly or Ecstasy–for severe PTSD, or post-traumatic stress disorder. Although more than half a dozen phase 2 studies have demonstrated the effectiveness and safety of MDMA for PTSD, early trials often fail to accurately predict the outcome of the larger, multisite phase 3 trials that follow. In the case of MDMA, we have been lucky. At 15 study sites across three countries, working with more than 70 different therapists and with study participants with childhood trauma, depression and a treatment-resistant subtype of PTSD, we have obtained incredibly promising results. Phase 3 study participants receiving MDMA-assisted therapy showed a greater reduction in PTSD symptoms and functional impairment than participants receiving placebo plus therapy. In addition, their symptoms of depression plummeted. By the end of the study more than 67 percent of the participants in the MDMA group no longer met criteria for PTSD. An additional 21 percent had a clinically meaningful response–in other words, a lessening of anxiety, depression, vigilant mental states, and emotional flatness. MDMA-assisted therapy did not increase measures of suicidal thinking or behavior. MDMA also did not demonstrate any measurable misuse potential.\n\nNote: Read more about the healing potentials of mind-altering drugs. Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nExecutive-level FDA official recorded on hidden camera saying annual COVID shots expected\n\n2022-02-16, ABC News (Arkansas affiliate)\n\nPosted: 2022-02-27 19:43:22\n\nProject Veritas released a video on Tuesday which allegedly shows an executive-level Food and Drug Administration (FDA) official admitting the Biden administration has plans to require yearly COVID shots \"just like the flu shot.\" Christopher Cole, an executive officer for the FDA's Medical Countermeasures Initiative (MCMi), was apparently recorded on hidden camera by Project Veritas admitting \"Biden wants to inoculate as many people as possible.\" \"You'll have to get an annual shot,\" Cole said on camera. \"I mean, it hasn't been formally announced yet 'cause they don't want to, like, rile everyone up,\" he added. Cole said in the video his managerial role at the FDA's MCMi involves overseeing vaccines, vaccine approvals, and devices for vaccines, and noted his \"office clears all the emergency approvals\" for such counter measures. \"There's almost a billion dollars a year going into FDA's budget from the people we regulate,\" Cole says in the Project Veritas video. \"The drug companies, the food companies, the vaccine companies, they pay us hundreds of millions of dollars a year to hire and keep the reviewers to approve their products. If they can get every person required at an annual vaccine, that is a recurring return of money going into their company,\" Cole added, in reference to pharmaceutical manufacturers. Cole also expresses concern over the FDA's process to approve COVID-19 vaccines for young children between six months of age and four years old in the video.\n\nNote: Explore hundreds of personal stories of severe vaccine injury and death that are being strongly suppressed by government and the major media. An MD's excellent research reveals that the government knew about and actively suppressed safe, effective, low-price treatments for COVID and targeted physicians who prescribed them. For more along these lines, see concise summaries of deeply revealing news articles on government corruption and coronavirus vaccines from reliable major media sources.\n\nStudy challenges evolutionary theory that DNA mutations are random\n\n2022-01-12, Science Daily\n\nPosted: 2022-02-27 19:41:25\n\nFindings, published January 12 in the journal Nature, radically change our understanding of evolution and could one day help researchers breed better crops or even help humans fight cancer. Mutations occur when DNA is damaged and left unrepaired, creating a new variation. The scientists wanted to know if mutation was purely random or something deeper. What they found was unexpected. \"We always thought of mutation as basically random across the genome,\" said [paper lead author] Grey Monroe. \"It turns out that mutation is very non-random and it's non-random in a way that benefits the plant. It's a totally new way of thinking about mutation.\" Researchers spent three years sequencing the DNA of hundreds of Arabidopsis thaliana, or thale cress. Sequencing of those ... plants revealed more than 1 million mutations. Within those mutations a nonrandom pattern was revealed, counter to what was expected. Instead of randomness they found patches of the genome with low mutation rates. In those patches, they were surprised to discover an over-representation of essential genes, such as those involved in cell growth and gene expression. \"These are the really important regions of the genome,\" Monroe said. \"The areas that are the most biologically important are the ones being protected from mutation.\" The areas are also sensitive to the harmful effects of new mutations. The findings [reveal] that the plant has evolved to protect its genes from mutation to ensure survival.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on the mysterious nature of reality from reliable major media sources.\n\nProsecutors Silence Evidence of Cruel Factory Farm Practices in Animal Rights Cases\n\n2022-01-30, The Intercept\n\nPosted: 2022-02-27 19:40:06\n\nIn criminal trials, judges routinely rule that certain evidence or testimony does not get presented to the jury. By and large, these rulings to exclude evidence benefit the defendant. In ... cases against animal rights activists, who face hefty charges for removing ailing animals from farms, the typical logic behind keeping evidence from a jury is flipped on its head. The prosecutors, rather than defendants, have sought ... to suppress all mention during trial of animal cruelty. Next month, a Utah judge will hear pretrial motions on the exclusion of evidence in a case against two members of the animal liberation group Direct Action Everywhere. The activists face charges of burglary and theft for removing two suffering piglets from a hog farm in 2017, for which they could be sentenced to more than a decade in prison. The Utah attorney general is seeking to exclude all evidence and testimony relating to the torturous treatment of animals. The activists filmed themselves entering the pork facility; they turned the camera onto the pigs – mother pigs with bloody nipples, pigs with huge open sores, dead and dying piglets on the floor – and filmed themselves removing the piglets. The prosecution argues that ... the activists' commentary on the grim factory conditions and any mention of the company's mistreatment of its animals would be unfairly prejudicial. That a prosecutor would move to preclude real-time footage of the alleged crime speaks to a frantic desire to foreclose any reckoning with the case's crucial context.\n\nNote: Read more about how video evidence of animal cruelty is suppressed to protect factory farms. For more along these lines, see concise summaries of deeply revealing news articles on food system corruption from reliable major media sources.\n\nHow The Covid-19 Vaccine Injected Billions Into Big Pharma–And Made Its Executives Very Rich\n\n2021-05-14, Forbes\n\nPosted: 2022-02-27 19:38:30\n\nBefore the Covid-19 pandemic, Big Pharma had been easing out of the vaccine business for decades. Ultimately, Operation Warp Speed (OWS)–the U.S. government's Covid-19 relief program–would dole out $22 billion to Big Pharma. The amounts of money were the kinds of sums normally seen in the smaller defense budget line items, but were massive for a public health project–$2.5 billion to Moderna, $1.2 billion to AstraZeneca, half a billion dollars to Johnson & Johnson, and $1.6 billion to a small company called Novavax. Only Pfizer opted out of ponying up to the trough at first–it didn't want to devote resources to coordinating with the US government on its work. In July, Pfizer signed a $1.95 billion deal to sell one hundred million doses of its two-shot vaccine to the United States, enough for fifty million people. By February, the government had ordered three hundred million doses from Moderna, with its first shipment of one hundred million priced at thirty dollars per double-shot dose–cheaper than Pfizer partly because the United States had forked over nearly a billion dollars to Moderna research. Even more money was raining down on company insiders trading on good-news releases. Executives at Moderna and Pfizer cashed in on the vaccine, selling shares timed precisely to clinical trial press releases. Pfizer executives ... earned $14 million from stock sales in 2020. Moderna executives made $287 million from timed stock sales in 2020–and kept going.\n\nNote: Explore hundreds of personal stories of severe vaccine injury and death that are being strongly suppressed by government and the major media. An MD's excellent research reveals that the government knew about and actively suppressed safe, effective, low-price treatments for COVID and targeted physicians who prescribed them. For more along these lines, see concise summaries of deeply revealing news articles on coronavirus vaccines and Big Pharma profiteering from reliable major media sources.\n\nPfizer revenue and profits soar on its Covid vaccine business\n\n2021-11-02, CNN News\n\nPosted: 2022-02-27 19:36:58\n\nPfizer reported that earnings and sales more than doubled in the past quarter, and it raised its outlook for results the full year, thanks greatly to its Covid-19 vaccine. The company reported adjusted earnings of $7.7 billion, up 133% from a year earlier. Revenue soared to $24.1 billion, up 134%. Both easily cleared results forecast by analysts. The vaccine business alone was responsible for more than 60% of the company's sales, as vaccine revenue rose to $14.6 billion from only $1.7 billion a year earlier. The company said its Covid vaccine sales accounted for $13 billion of that revenue. Revenue outside of its Covid vaccine business was up a far more modest 7%. This year, the Covid vaccine has brought in revenue of $24.3 billion. And Pfizer said it expects a total of $36 billion from the vaccine for all of 2021 – nearly $12 billion more in revenue the final quarter of the year. And it said based on contracts it now has signed it expects revenue $29 billion from the Covid vaccine in 2022. The company said it now expects full-year 2021 revenue of between $81 billion to $82 billion, up $2 billion from its earlier guidance. It also raised its earnings per share outlook by about 3% to 5% above what it had been expected to earn. About 67% of the total US population has had a least one dose of a Covid vaccine, and 58% are fully vaccinated, according to data tracked by the Mayo Clinic.\n\nNote: Explore hundreds of personal stories of severe vaccine injury and death that are being strongly suppressed by government and the major media. An MD's excellent research reveals that the government knew about and actively suppressed safe, effective, low-price treatments for COVID and targeted physicians who prescribed them. For more along these lines, see concise summaries of deeply revealing news articles on coronavirus vaccines and Big Pharma profiteering from reliable major media sources.\n\nF.B.I. Secretly Bought Israeli Spyware and Explored Hacking U.S. Phones\n\n2021-01-28, New York Times\n\nPosted: 2022-02-27 19:35:00\n\nIt is widely regarded as the world's most potent spyware, capable of reliably cracking the encrypted communications of iPhone and Android smartphones. The software, Pegasus, made by an Israeli company, NSO Group, has been able to track terrorists and drug cartels. It has also been used against human rights activists, journalists and dissidents. Now, an investigation published Friday by The New York Times Magazine has found that Israel, which controls the export of the spyware ... has made Pegasus a key component of its national security strategy, using it to advance its interests around the world. The F.B.I. bought and tested NSO software for years with plans to use it for domestic surveillance until the agency finally decided last year not to deploy the tools. The F.B.I., in a deal never previously reported, bought the spyware in 2019. It also spent two years discussing whether to deploy a newer product, called Phantom, inside the United States. The discussions at the Justice Department and the F.B.I. continued until last summer. But Pegasus equipment is still in a New Jersey building used by the F.B.I. And the company also gave the agency a demonstration of Phantom, which could hack American phone numbers. A brochure ... says that Phantom allows American law enforcement and spy agencies to \"turn your target's smartphone into an intelligence gold mine.\" In 2018 ... the C.I.A. bought Pegasus to help Djibouti, an American ally, fight terrorism, despite longstanding concerns about human rights abuses there.\n\nNote: Read about how NSO Group spyware was used against journalists and activists by the Mexican government. For more along these lines, see concise summaries of deeply revealing news articles on intelligence agency corruption and the disappearance of privacy from reliable major media sources.\n\nPeng Shuai saga hews to familiar script in China\n\n2022-02-07, ABC News/Associated Press\n\nPosted: 2022-02-27 19:32:56\n\nThe drama surrounding Peng Shuai is following a familiar script, in which someone who has run afoul of China's Communist government disappears from view. What happens next depends on the case, but it is not uncommon for the person in question to disavow the statements or actions that first upset officials. Other times, the person simply keeps a lower profile. Sometimes, their arrest is eventually announced. Peng's saga began in November, when she wrote in a social media post that a former member of the party's all-powerful Politburo Standing Committee had forced her to have sex three years ago despite repeated refusals. The post was quickly taken down and the former top-ranked doubles player dropped out of public view late last year. After she reappeared weeks later, she denied to a Singapore newspaper that she ever made any accusation of sexual assault. In an interview published Monday by a French sports paper, the tennis player called the whole situation an \"enormous misunderstanding.\" Other people ... have disappeared over the years – a phenomenon that has expanded since President Xi Jinping came to power in 2013. Liu [Xiaobo], a dissident writer who joined calls for increased freedoms in China in 2008, was detained a day before the appeal for reforms was released. After his arrest, his whereabouts were unknown for a time. He was eventually accused of subversion and sentenced to 11 years in prison. He was awarded the Nobel Peace Prize and died of cancer before he was ever released.\n\nNote: What most likely happens is that these people are subjected to well established mind control procedures, such that afterward they dare not challenge those in power. For more along these lines, see concise summaries of deeply revealing news articles on government corruption and mind control from reliable major media sources.\n\nMore polio cases now caused by vaccine than by wild virus\n\n2019-11-25, ABC News/Associated Press\n\nPosted: 2022-02-27 19:30:55\n\nFour African countries have reported new cases of polio linked to the oral vaccine, as global health numbers show there are now more children being paralyzed by viruses originating in vaccines than in the wild. In a report late last week, the World Health Organization and partners noted nine new polio cases caused by the vaccine in Nigeria, Congo, Central African Republic and Angola. Seven countries elsewhere in Africa have similar outbreaks and cases have been reported in Asia. Of the two countries where polio remains endemic, Afghanistan and Pakistan, vaccine-linked cases have been identified in Pakistan. In rare cases, the live virus in oral polio vaccine can mutate into a form capable of sparking new outbreaks. All the current vaccine-derived polio cases have been sparked by a Type 2 virus contained in the vaccine. Type 2 wild virus was eliminated years ago. WHO and partners have long relied on oral polio vaccines because they are cheap and can be easily administered. Western countries use a more expensive injectable polio vaccine that contains an inactivated virus incapable of causing polio. The Independent Monitoring Board, a group set up by WHO to assess polio eradication, warned in a report this month that vaccine-derived polio virus is \"spreading uncontrolled in West Africa.\" The group said officials were already \"failing badly\" to meet a recently approved polio goal of stopping all vaccine-derived outbreaks within 120 days of detection.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on vaccines from reliable major media sources.\n\nCongress approves sex harassment bill in #MeToo milestone\n\n2022-02-14, San Francisco Chronicle/Associated Press\n\nPosted: 2022-02-27 19:29:01\n\nCongress on Thursday gave final approval to legislation guaranteeing that people who experience sexual harassment at work can seek recourse in the courts, a milestone for the #MeToo movement that prompted a national reckoning on the way sexual misconduct claims are handled. The measure, which is expected to be signed by President Joe Biden, bars employment contracts from forcing people to settle sexual assault or harassment cases through arbitration rather than in court, a process that often benefits employers and keeps misconduct allegations from becoming public. Significantly, the bill is retroactive, nullifying that language in contracts nationwide and opening the door for people who had been bound by it to take legal action. Sen. Kirsten Gillibrand, who has spearheaded the effort, called it \"one of the most significant workplace reforms in American history.\" \"No longer will survivors of sexual assault or harassment in the workplace come forward and be told that they are legally forbidden to sue their employer because somewhere in buried their employment contracts was this forced arbitration clause,\" she said. Gillibrand, who has focused on combating sexual harassment and sexual misconduct in the military, originally introduced the legislation in 2017. The legislation had uncommonly broad, bipartisan support. That allowed the bill to be passed in the Senate by unanimous consent – a procedure almost never used for significant legislation, especially one affecting tens of millions of Americans.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nWhy Finland's schools are great (by doing what we don't)\n\n2011-10-13, Washington Post\n\nPosted: 2022-02-27 19:27:08\n\nFor the past decade, 15-year-old Finnish students have consistently been at or near the top of all the nations tested in reading, mathematics, and science. And just as consistently, the variance in quality among Finnish schools is the least of all nations tested, meaning that Finnish students can get a good education in virtually any school in the nation. That's equality of educational opportunity, a good public school in every neighborhood. What makes the Finnish school system so amazing is that Finnish students never take a standardized test until their last year of high school, when they take a matriculation examination for college admission. There is a national curriculum – broad guidelines to assure that all students have a full education – but it is not prescriptive. Teachers have extensive responsibility for designing curriculum and pedagogy in their school. Teachers are prepared for all eventualities, including students with disabilities, students with language difficulties, and students with other kinds of learning issues. The schools I visited reminded me of our best private progressive schools. They are rich in the arts, in play, and in activity. Finland has one other significant advantage over the United States. The child-poverty rate in Finland is under 4 percent. Here it is 22 percent and rising. It's a well-known fact that family income is the most reliable predictor of academic performance. Finland has a strong social welfare system; we don't. It is not a \"Socialist\" nation, by the way. It is egalitarian and capitalist.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nAmazing Facts About Finland's Unorthodox Education System\n\n2011-12-14, Business Insider\n\nPosted: 2022-02-27 19:25:39\n\nFinland's school system has consistently come at the top for the international rankings for education systems. So how do they do it? It's simple – by going against the evaluation-driven, centralized model that much of the Western world uses. Finnish children don't start school until they are 7. Compared with other systems, they rarely take exams or do homework until they are well into their teens. The children are not measured at all for the first six years of their education. There is only one mandatory standardized test in Finland, taken when children are 16. All children, clever or not, are taught in the same classrooms. Finland spends around 30 percent less per student than the United States. 30 percent of children receive extra help during their first nine years of school. 66 percent of students go to college. The difference between weakest and strongest students is the smallest in the World. Science classes are capped at 16 students so that they may perform practical experiments every class. 93 percent of Finns graduate from high school. 17.5 percent higher than the US. Elementary school students get 75 minutes of recess a day in Finnish [schools] versus an average of 27 minutes in the US. Teachers only spend 4 hours a day in the classroom, and take 2 hours a week for \"professional development\". Teachers are effectively given the same status as doctors and lawyers. In an international standardized measurement in 2001, Finnish children came top or very close to the top for science, reading and mathematics.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nThe Battle for the World's Most Powerful Cyberweapon\n\n2022-01-28, New York Times\n\nPosted: 2022-02-21 19:15:59\n\nNSO Group [is] the world's most notorious maker of spyware. The F.B.I. had bought a version of Pegasus, NSO's premier spying tool. It could ... crack the encrypted communications of any iPhone or Android smartphone. Since NSO had introduced Pegasus to the global market in 2011, it had helped Mexican authorities capture JoaquĂ­n GuzmĂˇn Loera, the drug lord known as El Chapo. European investigators have quietly used Pegasus to thwart terrorist plots, fight organized crime and, in one case, take down a global child-abuse ring. Mexico deployed the software not just against gangsters but also against journalists and political dissidents. The United Arab Emirates used the software to hack the phone of a civil rights activist. Saudi Arabia used it against women's rights activists. During a presentation to officials in Washington, the company demonstrated a new system, called Phantom, that could hack any number in the United States that the F.B.I. decided to target. A slick brochure ... says that Phantom allows American law enforcement and spy agencies to get intelligence \"by extracting and monitoring crucial data from mobile devices.\" It is an \"independent solution\" that requires no cooperation from AT&T, Verizon, Apple or Google. The system, it says, will \"turn your target's smartphone into an intelligence gold mine.\" The Phantom presentation triggered a discussion among government lawyers. Last summer ... the F.B.I. finally decided not to deploy the NSO weapons.\n\nNote: Read more about how NSO Group spyware was used against journalists and activists by the Mexican government. For more along these lines, see concise summaries of deeply revealing news articles on intelligence agency corruption and the disappearance of privacy from reliable major media sources.\n\nDepression Rates in US Tripled When the Pandemic First Hit–Now, They're Even Worse\n\n2021-10-07, Boston University\n\nPosted: 2022-02-21 19:14:14\n\nDepression among adults in the United States tripled in the early 2020 months of the global coronavirus pandemic–jumping from 8.5 percent before the pandemic to a staggering 27.8 percent. New research from Boston University School of Public Health reveals that the elevated rate of depression has persisted into 2021, and even worsened, climbing to 32.8 percent and affecting 1 in every 3 American adults. The study is the first nationally representative study in the US that examines the change in depression prevalence before and then during the pandemic. Published in the journal The Lancet Regional Health–Americas, the study found that the most significant predictors for if a person experienced depressive symptoms during the pandemic were low household income, not being married, and experiencing multiple pandemic-related stressors. \"The sustained high prevalence of depression does not follow [the same] patterns [we observed] after previous traumatic events, such as Hurricane Ike,\" says study senior author Sandro Galea. \"Typically, we would expect depression to peak following the traumatic event and then lower over time. Instead, we found that 12 months into the pandemic, levels of depression remained high.\" The burden of depression intensified over the course of the pandemic and disproportionately impacted adults with lower incomes. By spring 2021, low-income adults were 7 times more likely to experience [elevated depressive] symptoms.\n\nNote: Note that this huge increase in depression was caused not directly by the pandemic, but more by the isolation of the lockdown measures instituted. For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus and health from reliable major media sources.\n\nThe cost of childcare has risen by 41% during the pandemic with families spending up to 20% of their salaries\n\n2022-01-28, Fortune\n\nPosted: 2022-02-21 19:12:52\n\nSince the start of the pandemic, childcare costs have gone through the roof. Across the U.S., parents are seeing an average annual cost increase of 41% for center-based childcare providers, and spending an average of $14,117 annually, up from $9,977 pre-pandemic, according to data from a recent LendingTree report. Households with children younger than 5 were hit hardest by these increases, the report found. Since the pandemic began, center-based care providers for 3- and 4-year-olds have seen their annual costs increase by 57%. Costs for center-based care providers for kids under 2 grew by 37%. Care providers for 3- and 4-year-olds in Georgia, Florida, and Louisiana saw the biggest jump in expenses, with an annual average increase of at least 144%. As for the direct impact on households, Indiana families with kids under 5 put the biggest chunk of their income–20%–toward childcare, with the average family spending $11,212 a year. Vermont families are close behind, with 19% of their paycheck–an average of $13,538 annually–going toward childcare. Families in New Jersey, Mississippi, Kentucky, Texas, and North Dakota pay the lowest portion, at 11%. But they may also be seeing a jump in their costs in the near future; in each of those states, the average care center saw its expenses increase by over 50% during the pandemic. The bulk of the increased costs stems from staffing, which the Center for American Progress says makes up 70% of a childcare provider's total budget.\n\nNote: Note that this major increase in childcare cost was caused not directly by the pandemic, but more by the isolation of the lockdown measures instituted. For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus from reliable major media sources.\n\nFatal police shootings in 2021 set record since The Post began tracking, despite public outcry\n\n2022-02-09, Washington Post\n\nPosted: 2022-02-21 19:10:57\n\nPolice shot and killed at least 1,055 people nationwide last year, the highest total since The Washington Post began tracking fatal shootings by officers in 2015 – underscoring the difficulty of reducing such incidents despite sustained public attention to the issue. The new count is up from 1,021 shootings the previous year and 999 in 2019. The total comes amid a nationwide spike in violent crime. Despite setting a record, experts said the 2021 total was within expected bounds. Police have fatally shot roughly 1,000 people in each of the past seven years, ranging from 958 in 2016 to last year's high. The number of fatal police shootings ... suggests officers' behavior has not shifted significantly since The Post began collecting data. Advocacy for policing overhauls has intensified since the murder of George Floyd by a Minneapolis police officer in 2020. More than 400 bills were introduced in state legislatures last year to address officers' use of force. Police departments increasingly partnered with mental health experts to respond to people in crisis. Cities established civilian review boards for use-of-force incidents. None of it decreased the number of people shot and killed by officers last year. Last year, all but 15 percent of people shot and killed by officers were armed. Ninety-four percent were men. Roughly 14 percent had known mental health struggles, down from about one-fifth in the two previous years and about one-fourth in 2016 and 2015.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on police corruption from reliable major media sources.\n\nVaccine monopolies make cost of vaccinating the world against COVID at least 5 times more expensive than it could be\n\n2021-07-09, Oxfam\n\nPosted: 2022-02-21 19:09:34\n\nThe cost of vaccinating the world against COVID-19 could be at least five times cheaper if pharmaceutical companies weren't profiteering from their monopolies on COVID-19 vaccines, campaigners from the People's Vaccine Alliance said today. New analysis by the Alliance shows that the firms Pfizer/BioNTech and Moderna are charging governments as much as $41 billion above the estimated cost of production. Colombia, for example, has potentially overpaid by as much as $375 million for its doses of the Pfizer/BioNTech and Moderna vaccines, in comparison to the estimated cost price. Despite a rapid rise in COVID-19 cases and deaths across the developing world, Pfizer/BioNTech and Moderna have sold over 90 percent of their vaccines so far to rich countries, charging up to 24 times the potential cost of production. Last week Pfizer/BioNTech announced it would licence a South African company to fill and package 100 million doses for use in Africa, but this is a drop in the ocean of need. Neither company have agreed to fully transfer vaccine technology and know-how with any capable producers in developing countries, a move that could increase global supply, drive down prices and save millions of lives. Analysis of production techniques for the leading mRNA type vaccines produced by Pfizer/BioNTech and Moderna Ă˘â‚Źâ€˘which were only developed thanks to public funding to the tune of $8.3 billionĂ˘â‚Źâ€˘ suggest these vaccines could be made for as little as $1.20 a dose.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on coronavirus vaccines and Big Pharma profiteering from reliable major media sources.\n\nPfizer Reaps Hundreds of Millions in Profits From Covid Vaccine\n\n2021-05-04, New York Times\n\nPosted: 2022-02-21 19:07:48\n\nLast year, racing to develop a vaccine in record time, Pfizer made a big decision: Unlike several rival manufacturers, which vowed to forgo profits on their shots during the Covid-19 pandemic, Pfizer planned to profit on its vaccine. On Tuesday, the company announced just how much money the shot is generating. The vaccine brought in $3.5 billion in revenue in the first three months of this year, nearly a quarter of its total revenue, Pfizer reported. The vaccine was, far and away, Pfizer's biggest source of revenue. The company did not disclose the profits it derived from the vaccine, but it reiterated its previous prediction that its profit margins on the vaccine would be in the high 20 percent range. That would translate into roughly $900 million in pretax vaccine profits in the first quarter. The company's vaccine is disproportionately reaching the world's rich – an outcome, so far at least, at odds with its chief executive's pledge to ensure that poorer countries \"have the same access as the rest of the world\" to a vaccine that is highly effective at preventing Covid-19. As of mid-April, wealthy countries had secured more than 87 percent of the more than 700 million doses of Covid-19 vaccines dispensed worldwide, while poor countries had received only 0.2 percent. Pfizer has kept the profitability of its vaccine sales opaque. The United States, for example, is paying $19.50 for each Pfizer dose. Israel agreed to pay Pfizer about $30 per dose.\n\nNote: If Pfizer is truly concerned about global health, why are they reaping such huge profits when other companies were willing to forgo profits. And why are they not helping the economically disadvantaged countries? For more along these lines, see concise summaries of deeply revealing news articles on coronavirus vaccines and Big Pharma profiteering from reliable major media sources.\n\nCovid vaccine profits mint 9 new pharma billionaires\n\n2021-05-21, CNN News\n\nPosted: 2022-02-21 19:05:36\n\nCovid-19 vaccines have created at least nine new billionaires after shares in companies producing the shots soared. Topping the list of new billionaires are Moderna CEO StĂ©phane Bancel and Ugur Sahin, the CEO of BioNTech, which has produced a vaccine with Pfizer (PFE). Both CEOs are now worth around $4 billion, according to an analysis by the People's Vaccine Alliance, a campaign group that includes Oxfam, UNAIDS, Global Justice Now and Amnesty International. Senior executives from China's CanSino Biologics and early investors in Moderna have also become billionaires on paper as shares skyrocketed, partly in expectation of profits earned from Covid vaccines, which also bode well for the companies' future prospects. Moderna's share price has gained more than 700% since February 2020, while BioNTech has surged 600%. CanSino Biologics' stock is up about 440% over the same period. The company's single-dose Covid-19 vaccine was approved for use in China in February. Activists said the wealth generation highlighted the stark inequality that has resulted from the pandemic. The nine new billionaires are worth a combined $19.3 billion. According to the World Health Organization, 87% of vaccine doses have gone to high- or upper middle-income countries, while low income countries have received just 0.2%. In a paper published Friday, IMF chief economist Gita Gopinath said that vaccinating 60% of the global population by mid-2022 would cost just $50 billion.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on coronavirus vaccines and income inequality from reliable major media sources.\n\nCOVID vaccines are set to be among the most lucrative pharmaceutical products ever\n\n2021-11-24, NPR\n\nPosted: 2022-02-21 19:04:19\n\nThis year, Pfizer expects to bring in $36 billion from worldwide sales of its COVID-19 vaccine. That would shatter the previous record in annual sales for a single pharmaceutical product - about $20 billion for the anti-inflammatory drug Humira - and make the Pfizer vaccine the bestselling pharmaceutical product ever. Moderna will deliver fewer doses but is still expecting up to $18 billion in sales for the year for its COVID-19 vaccine. Humira, has been ... churning out tens of billions of dollars a year for multiple years on end. And it's not entirely clear that the mRNA vaccines will do that. Just because Pfizer and Moderna are selling billions of doses now doesn't mean that will last forever. The vaccines could work so well they eliminate the need for further boosters, though it's also possible COVID shots could become routine, like flu shots. The uncertainty puts a premium on maximizing sales now. Any vaccine manufacturer is going to realize that there's a risk that they're going to have a very short lifecycle. Moderna got a lot of government funding, offsetting costs and minimizing risks. But the COVID-19 vaccine is its only product on the market. Pfizer, on the other hand, didn't accept early government investment and took on a lot of those upfront costs itself. But it has dozens of other products in its portfolio that it makes and will continue to make once the pandemic ends.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on coronavirus vaccines and Big Pharma profiteering from reliable major media sources.\n\nThe Power of Placebos\n\n2022-02-12, Daily Good\n\nPosted: 2022-02-21 19:02:26\n\nDid you ever feel your own shoulders relax when you saw a friend receive a shoulder massage? For those of you who said \"yes,\" congratulations, your brain is using its power to create a \"placebo effect.\" For those who said \"no,\" you're not alone, but thankfully, the brain is trainable. Since the 1800s, the word placebo has been used to refer to a fake treatment, meaning one that does not contain any active, physical substance. Today, placebos play a crucial role in medical studies in which some participants are given the treatment containing the active ingredients of the medicine, and others are given a placebo. These types of studies help tell researchers which medicines are effective, and how effective they are. Surprisingly, however, in some areas of medicine, placebos themselves provide patients with clinical improvement. Research suggests that the placebo effect is caused by positive expectations, the provider-patient relationship and the rituals around receiving medical care. Depression, pain, fatigue, allergies, irritable bowel syndrome, Parkinson's disease and even osteoarthritis of the knee are just a few of the conditions that respond positively to placebos. In addition to the ever-increasing body of evidence surrounding their effectiveness, placebos offer multiple benefits. They have no side effects. They are cheap. They are not addictive. They provide hope when there might not be a specific chemically active treatment available. They mobilize a person's own ability to heal through multiple pathways.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nJoe Biden Formally Backs Consumers' Right to Repair Their Electronics\n\n2022-01-24, Vice\n\nPosted: 2022-02-21 19:00:49\n\nPresident Biden became the first sitting president to give extensive comments supporting the right to repair and acknowledging the anticompetitive practices of electronics manufacturers that have spent the last decade creating repair monopolies and making it difficult for consumers to fix the things they own. At a cabinet meeting Monday, Biden gave an update on the executive order he issued last year that directed the Federal Trade Commission to create right to repair rules that would enforce against anticompetitive practices. \"Too many areas, if you own a product, from a smartphone to a tractor, you don't have the freedom to choose how or where to repair that item you purchased,\" Biden added. \"It's broke. Well, what do I do about it if it's broke, you had to go to the dealer and you had to pay the dealer's cost, the dealer's price. If you tried to fix it yourself, some manufacturers actually would void the warranty.\" Biden was referring here to practices by John Deere and Apple, as well as by video game console manufacturers, who as Motherboard reported violate the Magnusson-Moss Warranty Act with \"Warranty Void if Removed\" stickers. Biden ... also took credit for recent moves from Amazon and Microsoft that will, in theory, make it easier for people to gain access to repair parts and manuals for their devices. \"It's going to make it easy for millions of Americans to repair their electronics instead of paying an arm and a leg to repair or just throwing a device out.\"\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nBillionaire Mark Cuban's Discounted Pharmacy Has Launched: 'Bypass Middlemen and Outrageous Markups\n\n2022-01-25, People\n\nPosted: 2022-02-21 18:59:33\n\nMark Cuban has opened up a new online pharmacy to help make generic drugs more affordable. The Mark Cuban Cost Plus Drug Company (MCCPDC) officially launched last week, claiming to offer the \"lowest prices on 100 lifesaving prescriptions, according to a press release. The company is able to offer lower prices because it's a registered pharmaceutical wholesaler, meaning MCCPDC can \"bypass middlemen and outrageous markups,\" per the press release. \"The pharmacy's prices reflect actual manufacturer prices plus a flat 15% margin and pharmacist fee,\" the press release states. The company also \"refuses to pay spread prices\" to pharmacy benefits managers, which manage prescription drug benefits on behalf of health insurers. One of the medications available is Imatinib, a leukemia treatment that has a retail price of $9,657 a month and costs around $120 a month with a common voucher, per the press release. However, the MCCPDC offers a steep discount, making the drug available for $47 per month. Two other notable prescriptions available at a significantly reduced price are Mesalamine, used for ulcerative colitis treatment, as well as gout treatment drug Colchicine. \"Not everyone sets the goal of being the lowest cost producer and provider,\" the billionaire [said]. \"My goal is to make a profit while maximizing impact.\" \"We will do whatever it takes to get affordable pharmaceuticals to patients,\" CEO Alex Oshmyansky said.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nPost-infection immunity was very protective against Delta, the C.D.C. reports, but vaccines still offer the best defense.\n\n2022-01-19, New York Times\n\nPosted: 2022-02-17 02:08:30\n\nPrevious infection with the coronavirus appeared to provide stronger protection against the Delta variant than did vaccination in a large sample of patients, the Centers for Disease Control and Prevention reported. Scientists analyzed testing, surveillance and immunization data from the [New York and California] to gauge the level of protection offered by vaccines and previous infection. During the week beginning May 30, 2021, vaccinated people who had not experienced Covid had the lowest risk of coronavirus infection and hospitalization, followed by unvaccinated people who had been previously diagnosed with Covid. By the week beginning Oct. 3, however, vaccinated people with a prior diagnosis fared best against the Delta variant. Unvaccinated people with a history of Covid also had lower rates of infection and hospitalization than those protected by vaccines alone. Waning of vaccine-derived immunity may explain why vaccinated people were less protected from infection with the Delta variant than those who had a prior diagnosis. A recent study of employees at the Cleveland Clinic suggested that ... vaccination does not add much benefit to a prior bout for the first many months.\n\nNote: The full article is strongly biased towards vaccination, yet the data shows that prior exposure to COVID often provides better protection than the vaccines, whose protection clearly wanes over time. For more along these lines, see concise summaries of deeply revealing news articles on coronavirus vaccines from reliable major media sources.\n\nThe COVID generation: how is the pandemic affecting kids' brains?\n\n2022-01-12, Nature\n\nPosted: 2022-02-14 13:52:45\n\nLike many paediatricians, Dani Dumitriu braced herself for the impact of the SARS-CoV-2 coronavirus when it first surged in her wards. She was relieved when most newborn babies at her hospital who had been exposed to COVID-19 seemed to do just fine. But hints of a more subtle and insidious trend followed close behind. Dumitriu and her team ... had more than two years of data on infant development – since late 2017, they had been analysing the communication and motor skills of babies up to six months old. Dumitriu thought it would be interesting to compare the results from babies born before and during the pandemic. The infants born during the pandemic scored lower, on average, on tests of gross motor, fine motor and communication skills compared with those born before it. It didn't matter whether their birth parent had been infected with the virus or not; there seemed to be something about the environment of the pandemic itself. Lockdowns ... have isolated many young families, robbing them of playtime and social interactions. Stressed out and stretched thin, many carers also haven't been able to provide the one-to-one time that babies and toddlers need. Worryingly, [biophysicist Sean] Deoni has found that the longer the pandemic has continued, the more deficits children have accumulated. \"The magnitude is massive – it's just astonishing,\" Deoni says of the findings, which are now under revision in JAMA Pediatrics.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus and health from reliable major media sources.\n\n\"Theragrippers\" are tiny, shape-changing machines that deliver medicine efficiently to the GI tract\n\n2020-11-25, Johns Hopkins University\n\nPosted: 2022-02-14 13:50:51\n\nInspired by a parasitic worm that digs its sharp teeth into its host's intestines, Johns Hopkins researchers have designed tiny, star-shaped microdevices that can latch onto intestinal mucosa and release drugs into the body. David Gracias, a professor in the Whiting School of Engineering, and gastroenterologist Florin M. Selaru, director of the Johns Hopkins Inflammatory Bowel Disease Center, led a team of researchers and biomedical engineers that designed and tested shape-changing microdevices that mimic the way the parasitic hookworm affixes itself to an organism's intestines. The \"theragrippers\" are made of metal and a thin, shape-changing film, then coated in heat-sensitive paraffin wax. The devices, each roughly the size of a dust speck, can potentially carry any drug and release it gradually into the body. Thousands of theragrippers can be deployed in the GI tract. When the paraffin wax coating on the grippers reaches the temperature inside the body, the devices close autonomously and clamp onto the colonic wall. The closing action causes the tiny, six-pointed devices to dig into the mucosa and remain attached to the colon, where they are retained and release their medicine payloads gradually into the body. Theragrippers, says Gracias, don't rely on electricity, wireless signals or external controls. \"Instead, they operate like small, compressed springs with a temperature-triggered coating on the devices that releases the stored energy autonomously.\"\n\nNote: These tiny devices are literally the size of a speck of dust. They can easily be hidden in a cotton swab and administered without a person's knowledge. Might they even be put in a vaccine and go undetected? For more along these lines, see concise summaries of deeply revealing news articles on health from reliable major media sources.\n\nMilitary campaign to influence public opinion continued after defence chief shut it down\n\n2021-06-24, CBC (Canada's public broadcasting system)\n\nPosted: 2022-02-14 13:48:47\n\nPortions of a military information campaign meant to influence the Canadian public during the COVID-19 pandemic continued to operate months after the chief of the defence staff at the time ordered it shut down in the spring of 2020. The Canadian military recently conducted four reviews of controversial initiatives. A copy of one of those reviews was obtained by CBC News under access to information legislation. That review shows that even after the then-chief of the defence staff, Jonathan Vance, verbally called off the overall influence campaign in April 2020, some influence activities aimed at Canadians carried on for another six months – until Vance issued a written edict in November 2020. The military deployed propaganda techniques in Canada without approval during the pandemic and gathered information about Canadians' online activities without permission from authorities. DND denies it has used psychological warfare techniques, honed during the Afghan war, on Canadians. But the line between psychological warfare and information operation campaigns has become increasingly blurry over the last few years. The review document obtained by CBC News says the Canadian Joint Operations Command (CJOC) ... \"liberally interpreted\" department policy. The unit decided it had the authority to conduct information operations on Canadians without government approval because it was asked by the government to help with the response to the pandemic.\n\nNote: Learn more in this article titled, \"Military leaders saw pandemic as unique opportunity to test propaganda techniques on Canadians, Forces report says.\" For more along these lines, see concise summaries of deeply revealing news articles on military corruption from reliable major media sources.\n\nWe're pro-vaccine but can't support California lawmaker's school COVID vaccine mandate\n\n2022-02-08, San Francisco Chronicle (San Francisco's leading newspaper)\n\nPosted: 2022-02-14 13:46:57\n\nTwo weeks ago, state Sen. Richard Pan introduced a new bill which would require all children K-12 to be vaccinated against COVID-19 in order to attend school in person after Jan. 1, 2023. Unvaccinated children would be forced into remote learning. Pan said, \"We need to make sure schools are safe so that all parents are comfortable sending their children to school.\" Every parent wants safe schools. But our children deserve medical care driven by facts, not politics. As physician epidemiologists, we have analyzed the data and found that this mandate is not supported by the scientific evidence – which is why no European countries or other U.S. states have implemented their own. California already has a mandate for children over 12, which will be triggered once the vaccines receive full approval. Pan's bill would go much further, requiring every child in K-12 to be vaccinated while the shots are still under emergency use authorization. Excluding unvaccinated children from in-person learning would come at an enormous cost, at a time when they should be catching up on critical academic and social experiences. In December, when the Los Angeles Unified School District tried to implement a K-12 COVID-19 vaccine mandate, they found that 30,000 students ages 12 and older hadn't met the mandate requirements. If we extrapolate those numbers to the entire state, and take into account lower vaccination rates among children ages 5-11, over a million California children could be forced into remote learning.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on coronavirus vaccines from reliable major media sources.\n\nWe want all COVID restrictions in schools lifted. No, that's not radical.\n\n2022-02-01, San Francisco Chronicle (San Francisco's leading newspaper)\n\nPosted: 2022-02-14 13:45:15\n\nHere in California, our children continue to navigate the most restrictive policies in the country, in many cases not even allowing them to remove their masks while outdoors at school. There are now calls ... to exchange their cloth masks for thicker, larger and tighter N95/KN95 masks. The World Health Organization does not recommend the routine masking of young children at all, let alone the proposition that tight-fitting respirators should be donned by children for multiple hours a day. Yet we have come to view this as appropriate and necessary in California, despite our high levels of protection from serious COVID-19 illness given widespread vaccine uptake. Our government leaders made an implicit promise that the vaccination of adults and children would be the conduit by which our society would return to pre-pandemic freedoms. Despite a highly successful vaccination campaign in the Bay Area, most COVID-19 restrictions have remained in place for two years and counting. And despite widespread access to vaccines, we continue to prioritize the prevention of COVID-19 transmission, even in the absence of severe illness, above most other health considerations. Last week, we began an online petition asking California officials to immediately shift our public dialogue toward defining a path for removing all remaining COVID-19 restrictions in public schools. Despite the pushback we have received, normalizing our school environment is not a radical concept.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus from reliable major media sources.\n\nA small island nation has cooked up not 1, not 2, but 5 COVID vaccines. It's Cuba!\n\n2022-02-01, NPR\n\nPosted: 2022-02-14 13:43:05\n\nIn the early days of the COVID pandemic, Cuba decided it was going to make its own vaccine. It didn't want to rely on the whims of foreign governments or international pharmaceutical companies to immunize its people. Cuba didn't even sign up for the COVAX program, backed by the World Health Organization, that was promising to purchase vaccines in bulk and distribute them equitably around the globe. Cuba's vaccine development effort wasn't just risky from health perspective. Politically if the rest of the world got vaccine far earlier than Cuba, it would be a huge blow to the government. Cuba now has five vaccines in various stages. Three of the vaccines, Soberana 1, Soberana 2 and Soberna Plus, were developed at the Finlay Institute in Havana. The other two, Abdala and Mambisa, came out of Cuba's Center for Genetic Engineering and Biotechnology. Soberana 2, Soberana Plus and Abdala are authorized by the Cuban authorities for use and export while the other two (one of which is a nasal spray) are still in clinical trials. None of them have yet been authorized by the World Health Organization or any other major international regulator. But they've allowed Cuba to boast one of the highest COVID vaccination rates in the world. More than 85% of the island nation is fully immunized against the virus – a far higher vaccination rate than the U.S.. At a time when many other low- and middle-income nations continue to struggle to get enough doses, Cuba is exporting vaccine to Iran, Venezuela, Mexico, Nicaragua and Vietnam.\n\nNote: These vaccines do not rely on the mRNA technology about whose long-term side effects we know little to nothing. In deaths per million from COVID, Cuba is ranked #71 out of 155 countries as of early February 2022. For more along these lines, see concise summaries of deeply revealing news articles on coronavirus vaccines from reliable major media sources.\n\nAlmost 500 Service Members Discharged For Refusing COVID Vaccine\n\n2022-01-27, Newsweek\n\nPosted: 2022-02-14 13:41:21\n\nAlmost 500 U.S. service members have been discharged so far for refusing the COVID-19 vaccine. But that number is likely to climb as the various military branches continue the process of dealing with those who are refusing to get vaccinated against COVID-19, or have requested exemptions. The Navy said on Tuesday that it has discharged 23 active-duty sailors for refusing the coronavirus vaccine. The Air Force, as of January 21, has discharged 111 active-duty airmen. As of January 20, the Marine Corps had discharged 334 Marines. The Army is the only service that has not yet initiated separations for active-duty personnel for refusing the COVID-19 vaccine. But in a news release earlier this month, the Army said it had relieved six active-duty leaders, including two battalion commanders, from their positions for refusing the vaccine. The Army also said it had issued almost 3,000 general officer written reprimands to soldiers for vaccine refusal. The 2022 National Defense Authorization Act, which President Joe Biden signed into law in December, prohibits service members from being dishonorably discharged for refusing to get the COVID-19 vaccine. Last summer, the Department of Defense announced that it would make COVID-19 vaccination mandatory for all service members–active-duty, National Guard and Reserves. Around 98 percent of active-duty service members are fully vaccinated, according to the Department of Defense.\n\nNote: This 3-minute video features a hearing where data was given by Dept. of Defense whistleblowers reporting on the health of US soldiers. The data clearly shows that neurological problems among troops increased by 10 times (1,000%) over previous years. Other disease also had major increases. For more along these lines, see concise summaries of deeply revealing news articles on coronavirus vaccines from reliable major media sources.\n\nTherapies to Prevent Progression of COVID-19, Including Hydroxychloroquine, Azithromycin, Zinc, and Vitamin D3 With or Without Intravenous Vitamin C: An International, Multicenter, Randomized Trial\n\n2021-11-25, Cureus (Published on a National Institute of Health website)\n\nPosted: 2022-02-14 13:38:49\n\nCOVID-19 is a global pandemic. Treatment with hydroxychloroquine (HCQ), zinc, and azithromycin (AZM), also known as the Zelenko protocol, and treatment with intravenous (IV) vitamin C (IVC) have shown encouraging results in a large number of trials worldwide. In addition, vitamin D levels are an important indicator of the severity of symptoms in patients with COVID-19. Hospitalized patients with COVID-19 ... were screened for eligibility and randomly allocated to receive either HCQ, AZM, and zinc (group 1) or HCQ, AZM, zinc plus IV vitamin C treatment (group 2) for 14 days. The patients also received nontherapeutic levels of vitamin D3. A total of 237 hospitalized patients with COVID-19 ... were enrolled in the study. Almost all patients were vitamin D deficient (97%). All but one patient (99.6%; n = 236/237) treated with HCQ, AZM, and zinc with or without high-dose IV vitamin C (IVC) fully recovered. Additional IVC therapy contributed significantly to a quicker recovery (15 days versus 45 days until discharge; p = 0.0069). Low vitamin D levels were significantly correlated with a higher probability of admission to the intensive care unit (ICU) and longer hospital stay. Our study suggests that the treatment protocol of HCQ, AZM, and zinc with or without vitamin C is safe and effective in the treatment of COVID-19, with high dose IV vitamin C leading to a significantly quicker recovery.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus from reliable major media sources.\n\nSeeing 1,000 glorious fin whales back from near extinction is a rare glimmer of hope\n\n2022-01-17, The Guardian (One of the UK's leading newspapers)\n\nPosted: 2022-02-14 13:36:37\n\nGood news doesn't get any more in-your-face than this. One thousand fin whales, one of the world's biggest animals, were seen last week swimming in the same seas in which they were driven to near-extinction last century due to whaling. It's like humans never happened. This vast assembly was spread over a five-mile-wide area", "images": ["https://www.wanttoknow.info/m/images/header-logo.png", "https://www.WantToKnow.info/images/news-magnify.jpg", "https://www.paypalobjects.com/en_US/i/btn/btn_donate_LG.gif", "https://www.wanttoknow.info/images/rss.gif", "https://www.wanttoknow.info/m/images/header-mission.png"], "top_img": "https://www.WantToKnow.info/images/news-magnify.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "News Stories", "meta_data": {"description": "News stories: Excerpts from highly revealing major media news stories suggest major cover-ups of health, energy, media, 9/11, war, elections, and more. Links to original stories provided for easy verification.", "keywords": "news,articles,9/11,911,elections,energy,inventions,financial,global,warming,government,health,mass,media,,information,polls,able,danger,avian,flu,corporate,corruption,dolphins,whales,hurricane,katrina,income,inequality,inspirational,microchips,mind,control,nature,reality,non-lethal,nonlethal,privacy,secrecy,secret,societies,terrorism,ufos,vaccines,war", "viewport": "width=device-width, initial-scale=1", "ROBOTS": "INDEX,FOLLOW", "Revisit-after": "21 days", "rating": "general", "google-site-verification": "93poa4ULbuO4k4m5pcOzlCUyZF-QR_CMpiv-eFUo8sw"}, "movies": [], "publish_date": null, "source": "https://www.wanttoknow.info", "summary": ""}