{"url": "https://nationalpost.com/news/canada/is-tom-bradys-diet-no-nightshades-or-fruit-backed-by-science-to-be-behind-his-success", "text": "This advertisement has not loaded yet, but your article continues below.\n\nIs Tom Brady's diet — no nightshades or fruit — the secret behind his success? Brady shuns white sugar, white flour, nightshade vegetables (tomatoes, eggplant, mushrooms), most fruits, caffeine, MSG, iodized salt (pink Himalayan only) and dairy\n\nArticle content A loyal Patriots fan, Timothy Caulfield recently confessed in Policy Options Magazine that, should the seriously “dreamy” Tom Brady ever need a kidney, “I’m there for him.”\n\nAdvertisement 2 Story continues below This advertisement has not loaded yet, but your article continues below.\n\nArticle content But not even Brady’s epic Super Bowl win is enough to make Caulfield question whether he’s been wrong all along about the quarterback’s freakishly restricted diet, certain elements of which, writes Caulfield, holder of the University of Alberta’s Canada research chair in health law and policy, “register as full out kook.” We apologize, but this video has failed to load.\n\ntap here to see other videos from our team. Try refreshing your browser, or Is Tom Brady's diet — no nightshades or fruit — the secret behind his success? Back to video Brady and his supermodel wife Gisele Bündchen reportedly follow an 80-per-cent alkaline, 20-per-cent acidic diet — a meal plan the NFL quarterback famously told Sports Illustrated in 2014 provides “balance and harmony through my metabolic system.” Brady shuns white sugar, white flour, nightshade vegetables (tomatoes, eggplant, mushrooms), most fruits (“I’ve never eaten a strawberry in my life,” he told New York magazine last year), caffeine, MSG, iodized salt (pink Himalayan only) and dairy.\n\nAdvertisement 3 Story continues below This advertisement has not loaded yet, but your article continues below.\n\nArticle content He does enjoy avocado-based ice cream. The “ageless wonder” quarterback credits his insanely disciplined diet for his success and, at 39, says he has no plans for retiring (“Too bad babe,” he reportedly told Bündchen when she asked him to hang up his jersey after the Patriot’s stunning comeback Sunday, “I’m having too much fun.”) But is there any science to support his austere eating plan? “He’s such a good example of an anecdote overwhelming the data,” Caulfield says. “And the media usually give him the ‘you-can’t-argue-with success’ treatment.” Parts of Brady’s diet are undoubtedly healthy, Caulfield allows. He’s eating more “real” food. He avoids junk food. All good, he says. “But what often happens with these fad diets is, a little bit of good is wrapped in a blanket of pseudoscience, and the whole package is sold even though there’s no data to support it.”\n\nAdvertisement 4 Story continues below This advertisement has not loaded yet, but your article continues below.\n\nArticle content Brady appears to subscribe to an alkaline diet popularized by Robert O. Young, author of “The pH Miracle” book series. Young is an American naturopath now facing three years and eight months in a California jail for practising medicine without a licence. According to the BBC, he bought his PhD from a diploma mill. The alkaline view is based on the (scientifically discredited) theory people need to consume a diet high in alkaline foods in order to maintain the pH of the blood. If blood becomes too acidic, the hypothesis holds, the body starts leaching calcium and other minerals from the bones, muscles and major organs, and bad things start to happen. Dr. Rena Mendelson begs to differ. Our bodies naturally control our pH levels, says Mendelson, a professor in the school of nutrition at Ryerson University in Toronto.\n\nAdvertisement 5 Story continues below This advertisement has not loaded yet, but your article continues below.\n\nArticle content “It’s not something we even need to be conscious of, because our normal homeostatic mechanisms allow us to adapt to a range of different foods or fluids or whatever it is we consume,” she says. “How would the rest of us be walking around and performing well in our day-to-day life if we had to pay attention to the acidity or alkalinity of the foods we consume?” If I had Tom Brady’s personal chef I would eat healthy, too There’s nothing wrong with a diet that’s high in vegetables and whole grain. Eliminating any one food also isn’t a problem, Mendelson says. Strawberries aren’t essential to the diet. Neither are tomatoes. But tossing out an entire food group — nightshades, for example — can be problematic. Nightshades are high in nutrients, high in the proven Mediterranean diet and are actually anti-inflammatory, says Calgary University registered dietician and epidemiologist Tanis Fenton.\n\nAdvertisement 6 Story continues below This advertisement has not loaded yet, but your article continues below.\n\nArticle content We don’t need pure sugar. But neither do we need to cut out fruit because it has sugar, she says. Photo by Eric Gay / AP Last year, Fenton published a systematic review of the association between diet acidic load, and cancer. Her conclusion: “Almost no actual research” exists to prove or disprove these diets for cancer prevention or treatment. Brady is a phenomenal athlete, Fenton says. “And he very modestly is suggesting his diet is the reason, but, no. That’s not good evidence, because it’s a case study – it’s one individual, and an individual endowed with a wonderful genetic predisposition to be an athlete, obviously. Because diet alone doesn’t make us phenomenal athletes like him.” Still, Caulfield’s research has shown people subscribe to celebrities over any other source of authority. Celebrity trumps everything.\n\nAdvertisement 7 Story continues below This advertisement has not loaded yet, but your article continues below.\n\nArticle content More On This Topic Tom Brady can prompt complicated feelings, but there is no doubt about his football legacy World’s most prolific runner jogs every day for over 52 years, finally decides to take a break Crickets are a hot new source of protein — but their real value could lie in the poop they produce Brady isn’t alone: Think of swimmer Michael Phelps’ embrace of “cupping” at the Rio games, and super-cold cryotherapy devotee LeBron James. There’s a sociological phenomenon that suggests we can’t help, consciously or not, be influenced by celebrities, Caulfield says. “We’re all comparison machines — we can’t help but compare ourselves to others. For most of human history that was a pretty small cohort. Now it’s people like Tom Brady.” “They have such huge cultural footprint — they own social media, they own popular culture. We can’t help but hear the things they talk about.” But he worries the pseudoscience noise complicates the story about how to live a healthy lifestyle. “It makes it sound like eating healthy is hard and expensive. People will go, “if I had Tom Brady’s personal chef I would eat healthy, too.’ And that’s a terrible message,” he says. “Eating healthy doesn’t have to be complicated.”\n\nShare this article in your social network\n\nAdvertisement Story continues below This advertisement has not loaded yet, but your article continues below.\n\nNP Posted Sign up to receive the daily top stories from the National Post, a division of Postmedia Network Inc. Email Address There was an error, please provide a valid email address. Sign Up By clicking on the sign up button you consent to receive the above newsletter from Postmedia Network Inc. You may unsubscribe any time by clicking on the unsubscribe link at the bottom of our emails. Postmedia Network Inc. | 365 Bloor Street East, Toronto, Ontario, M4W 3L4 | 416-383-2300 Thanks for signing up! A welcome email is on its way. If you don't see it, please check your junk folder. The next issue of NP Posted will soon be in your inbox. We encountered an issue signing you up. Please try again", "images": ["https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2017/02/patriots-falcons-super-bowl-football8.jpg?w=100&quality=5&strip=all", "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2022/03/GettyImages-924528522-e1647037385758.jpg?quality=5&strip=all&w=100", "https://storage.googleapis.com/pmd-stage-northamerica-northeast1-dcs-static-files/10.0.3/websites/images/share-icons/icon-soc-yt-mono-rev.svg", "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2017/02/afp_le1rv.jpg?w=100&quality=5&strip=all", "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2022/03/lll-e1647280570993.jpg?quality=5&strip=all&w=100", "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2017/02/afp_lg1yi1.jpg?quality=90&strip=all&w=288&h=216", "https://storage.googleapis.com/pmd-stage-northamerica-northeast1-dcs-static-files/10.0.3/websites/images/share-icons/icon-soc-rdit.svg", "https://storage.googleapis.com/pmd-stage-northamerica-northeast1-dcs-static-files/10.0.3/websites/images/share-icons/icon-soc-tw-mono-rev.svg", "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2017/02/633958880.jpg?w=100&quality=5&strip=all", "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2017/02/afp_lg1yi1.jpg", "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2022/03/hushmain-1-e1647360229979.jpg?quality=5&strip=all&w=100", "https://storage.googleapis.com/pmd-stage-northamerica-northeast1-dcs-static-files/10.0.3/websites/images/share-icons/share-modal-icon-close.svg", "https://storage.googleapis.com/pmd-stage-northamerica-northeast1-dcs-static-files/10.0.3/websites/images/share-icons/icon-soc-fb.svg", "https://storage.googleapis.com/pmd-stage-northamerica-northeast1-dcs-static-files/10.0.3/websites/images/share-icons/icon-soc-fb-mono-rev.svg", "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2017/01/c3b0euwwyae9agg_large.jpg?h=96&strip=all&quality=5", "https://storage.googleapis.com/pmd-stage-northamerica-northeast1-dcs-static-files/10.0.3/websites/images/share-icons/icon-soc-tw.svg", "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2017/01/cricket.jpg?h=96&strip=all&quality=5", "https://storage.googleapis.com/pmd-stage-northamerica-northeast1-dcs-static-files/10.0.3/websites/images/share-icons/icon-soc-ig-mono-rev.svg", "https://storage.googleapis.com/pmd-stage-northamerica-northeast1-dcs-static-files/10.0.3/websites/images/share-icons/icon-circle-email.svg", "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2017/02/632870780.jpg?w=100&quality=5&strip=all", "https://storage.googleapis.com/pmd-stage-northamerica-northeast1-dcs-static-files/10.0.3/websites/images/share-icons/icon-circle-share.svg", "https://smartcdn.gprod.postmedia.digital/vancouversun/wp-content/uploads/2022/03/267769133-0319_this_just_in_lashes-w.jpg?quality=5&strip=all&w=100", "https://storage.googleapis.com/pmd-stage-northamerica-northeast1-dcs-static-files/10.0.3/websites/images/newsletters/logo/logo-NP_HeadlineNews.svg", "https://storage.googleapis.com/pmd-stage-northamerica-northeast1-dcs-static-files/10.0.3/websites/images/share-icons/icon-soc-li.svg", "https://storage.googleapis.com/pmd-stage-northamerica-northeast1-dcs-static-files/10.0.3/websites/images/share-icons/icon-soc-tblr.svg", "https://smartcdn.gprod.postmedia.digital/vancouversun/wp-content/uploads/2022/03/267774969-0319_it_list-w.jpg?quality=5&strip=all&w=100", "https://storage.googleapis.com/pmd-stage-northamerica-northeast1-dcs-static-files/10.0.3/websites/images/np/logo-footer-np.svg", "https://storage.googleapis.com/pmd-stage-northamerica-northeast1-dcs-static-files/10.0.3/websites/images/share-icons/icon-soc-pin.svg"], "top_img": "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2017/02/afp_lg1yi1.jpg", "keywords": [], "authors": [], "canonical_link": "https://nationalpost.com/news/canada/is-tom-bradys-diet-no-nightshades-or-fruit-backed-by-science-to-be-behind-his-success", "title": "Is Tom Brady's diet — no nightshades or fruit — the secret behind his success?", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "description": "Brady shuns white sugar, white flour, nightshade vegetables (tomatoes, eggplant, mushrooms), most fruits, caffeine, MSG, iodized salt (pink Himalayan only) and…", "vf": {"container_id": "30a40717-53af-4051-aa1b-37e0c7de71c7"}, "fb": {"pages": 110225254594, "app_id": 144435319507370}, "twitter": {"site": "@nationalpost", "title": "Is Tom Brady's diet — no nightshades or fruit — the secret behind his success?", "image": "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2017/02/afp_lg1yi1.jpg", "card": "summary_large_image"}, "og": {"site_name": "nationalpost", "type": "article", "title": "Is Tom Brady's diet — no nightshades or fruit — the secret behind his success?", "image": {"identifier": "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2017/02/afp_lg1yi1.jpg", "width": 705, "height": 940}}, "article": {"publisher": "https://www.facebook.com/NationalPost/"}, "ia": {"markup_url": "https://nationalpost.com/news/canada/is-tom-bradys-diet-no-nightshades-or-fruit-backed-by-science-to-be-behind-his-success?ia_markup=1"}}, "movies": [], "publish_date": null, "source": "https://nationalpost.com", "summary": ""}