{"url": "www.latimes.com/politics/washington/la-na-essential-washington-updates-trump-warns-north-korea-of-fire-and-1502220642-htmlstory.html", "text": "How many false statements did Trump make in his interview with the Wall Street Journal? We count at least five\n\n(Carolyn Kaster / Associated Press)\n\nThe Wall Street Journal didn’t release the full transcript of the interview its reporters and editors had last week with President Trump, but when Politico obtained a copy and published it, the interview quickly drew attention for several false statements Trump made.\n\nThe one that immediately gained notoriety was Trump’s claim that after his speech at the Boy Scout Jamboree last week, “I got a call from the head of the Boy Scouts saying it was the greatest speech that was ever made to them.”\n\nOn Wednesday, the Boy Scouts of America released a statement saying “we are unaware of any such call.” The Scouts specifically said that neither the organization’s president, AT&T chairman Randall Stephenson, nor its chief executive, Mike Surbaugh, had made such a call.\n\nIn fact, Surbaugh last week issued an unprecedented apology for a presidential speech — Scouts have heard from presidents back to Franklin D. Roosevelt — saying he was sorry that some members of the scouting community had been offended by Trump’s partisanship, language and tone.\n\nIn the daily White House press briefing, press secretary Sarah Huckabee Sanders said that other Boy Scout leaders, whom she did not name, had complimented Trump after his speech.\n\nThat wasn’t the only call to come into question recently. A few days after the Journal interview, Trump said that Mexico’s president, Enrique Peña Nieto, had paid him the “ultimate compliment” by calling and telling him that “their southern border, very few people are coming because they know they’re not going to get through our border.”\n\nThe Mexican government press office issued a statement Wednesday denying that.\n\nPeña Nieto “has not had recent telephone communication with President Donald Trump,” the statement said.\n\nSanders said that Peña Nieto did compliment Trump, but in a personal conversation, not a telephone call.\n\n“I wouldn’t say it was a lie,” she said of Trump’s statements.\n\nOther false statements involved broader factual matters.\n\n“We’re the highest-taxed nation in the world,” Trump said — a statement that he has repeatedly made and which has repeatedly been debunked. Whether measured by the top tax rate or the overall percentage of national income which is taxed, the U.S. has lower taxes than most of its chief economic competitors.\n\nTrump may have been thinking about the U.S. corporate tax rate, which is higher than most developed countries, although not the highest. Yet few companies actually pay that top rate given various tax deductions, credits and exemptions.\n\nTrump also said “I honestly believe for six months, I have done more than just about any other president when you look at all of the bills that were passed, 42, 43.”\n\nThat’s untrue. Many of Trump’s predecessors had signed more legislation, and nearly all recent ones had signed more significant measures by this point in their tenures.\n\nJimmy Carter had signed 70 bills into law by this point, Bill Clinton 50. Franklin D. Roosevelt had 76 in just his first 100 days.\n\nAbout one-third of the bills Trump has signed have been ceremonial measures, such as renaming courthouses.\n\nReferring to his top economic advisor, Gary Cohn, Trump said “Gary wrote a check for $200 million” when he entered the government. “He had to pay $200 million in tax.”\n\nTrump has said that before, including in a speech in June. It’s false.\n\nCohn owned about $220 million in Goldman Sachs stock when he resigned as the bank’s president to become the head of Trump’s National Economic Council. He sold the stock to minimize conflicts of interest, as most appointees do. But he certainly didn’t have to pay $200 million in tax on that sale.\n\nIn fact, it’s likely Cohn hasn’t paid any tax so far. He may never have to.\n\nFederal law allows appointees to government positions to defer any tax they owe on assets that they sell to avoid conflicts. The law requires that they put the proceeds of the sale into neutral investments such as Treasury securities. If his securities go up in value, Cohn might have to pay tax on that gain. The top tax rate on capital gains is 20%.\n\nTrump also repeated a false claim about his defeated rival from the election, Hillary Clinton.\n\n“Real crimes are what Hillary did with 33,000 emails, where she deleted them and bleached them after getting a subpoena.”\n\nTrump made that claim more than once during the campaign, and more recently on Twitter.\n\nHe is correct that Clinton deleted 33,000 emails from the private server she used for her messages while she was secretary of State. She says that all of those deleted emails were personal and that she had no obligation to keep them. No one has come up with evidence to the contrary.\n\nThe evidence from the FBI’s investigation of the emails shows that in December 2014, after she turned over about 30,000 work-related emails to the State Department, Clinton’s aides told the company that managed the server to delete the rest of the emails. The emails were subpoenaed about three months later, on March 4.\n\nThe company didn’t actually do the deletion until later in March, but there’s been no evidence that Clinton knew about the delay at the time or that the company knew the messages were under subpoena.\n\nIn any case, the FBI declined to recommend prosecution, contrary to Trump’s assertion that Clinton committed “real crimes.”\n\nA poll released Wednesday by Quinnipiac University asked Americans if they believe Trump is honest. By 62% to 34%, a majority said no.\n\n12:30 p.m.: This article was updated with comments by White House press secretary Sarah Huckabee Sanders.", "images": ["https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.latimes.com/politics/washington/la-na-essential-washington-updates-201708-htmlstory.html", "title": "U.S. orders Russia to close diplomatic offices in three cities", "meta_data": {"og": {"title": "U.S. orders Russia to close diplomatic offices in three cities", "url": "https://www.latimes.com/politics/washington/la-na-essential-washington-updates-201708-htmlstory.html", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "url": "https://ca-times.brightspotcdn.com/dims4/default/7046e4f/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "width": 1200, "height": 630, "type": "image/jpeg", "alt": "LA Times logo"}, "description": "Here's our look at the Trump administration and the rest of Washington:Moscow ordered to close offices in San Francisco, New York and WashingtonSpecial counsel has lobbyist at 2016 meeting with Trump Jr. testify to grand jury President Trump kicks off fall campaign for tax cuts, still without any…", "site_name": "Los Angeles Times", "type": "website"}, "twitter": {"card": "summary_large_image", "description": "Here's our look at the Trump administration and the rest of Washington:Moscow ordered to close offices in San Francisco, New York and WashingtonSpecial counsel has lobbyist at 2016 meeting with Trump Jr. testify to grand jury President Trump kicks off fall campaign for tax cuts, still without any planTrump gets criticism from the man he called 'my African-American'", "site": "@latimes", "title": "U.S. orders Russia to close diplomatic offices in three cities"}, "fb": {"app_id": 134435029966155, "pages": 5863113009}, "viewport": "width=device-width,initial-scale=1", "description": "Here's our look at the Trump administration and the rest of Washington:Moscow ordered to close offices in San Francisco, New York and WashingtonSpecial counsel has lobbyist at 2016 meeting with Trump Jr. testify to grand jury President Trump kicks off fall campaign for tax cuts, still without any planTrump gets criticism from the man he called 'my African-American'", "brightspot.contentId": "0000016c-68c4-d4d6-a16e-eaef181f0000", "brightspot.cached": "false"}, "movies": [], "publish_date": null, "source": "http://www.latimes.com", "summary": ""}