{"url": "www.gobankingrates.com/net-worth/celebrities/kanye-west-net-worth/", "text": "How Much Kanye West Is Worth After Officially Changing His Name\n\nMichael Wyke/AP/Shutterstock / Michael Wyke/AP/Shutterstock\n\nThe richest Black man in America might soon be the rapper formerly known as Kanye West, according to projected reports from Bloomberg, which foreshadow his upcoming earnings to be in the $6-7 billion ballpark. In the meantime, a Forbes fact check found that West’s current net worth is actually closer to an estimated $1.8 billion, with the Bloomberg figure having been based on “theoretical future expectations” regarding revenue West’s deal with Gap will yield.\n\nSee: The Richest Celebrity From Every State\n\nFind: Who’s Richer? Taylor Swift, Jennifer Aniston Or One Of These Other Big-Name Celebrities?\n\n\n\nThe rapper legally changed his name to Ye (pronounced yay) on Oct. 18. The petition, which was filed Aug. 24, does not appear to include a middle or last name.\n\nHe began using the name in 2018 as a Twitter handle, but it dates as far back as 2012, heard in the song ‘Clique,’ which featured Jay-Z and Big Sean. He noted in a 2020 interview with radio host Big Boy that ye is a word common to the Bible meaning “you.”\n\nWhile Ye’s net worth hasn’t been updated since he released his latest album this past summer, it’s clear that he has amassed an enormous fortune from a combination of business ventures after breaking into the music scene with his 2004 album “The College Dropout.” However, you might be surprised just how small of a percentage his music contributes to his overall wealth as we dive into how the world-famous entrepreneur got his start.\n\nMake Your Money Work Better for You\n\nEarly Life and Rise to Music Stardom\n\nBorn Kanye Omari West on June 8, 1977 in Atlanta, Georgia, West lived with his parents, Ray and Donda West, for three years until their divorce. His mother then relocated them to Chicago, Illinois. The mother-son duo went on to live in China for one year while Kanye was 10, which he said had a huge impact on his life. Donda played a tremendous role as both his mother and manager, publishing the book “Raising Kanye: Life Lessons from the Mother of a Hip-Hop Superstar” just six months before her passing in November 2007 due to surgery complications.\n\nThe American rapper, producer, fashion designer and entrepreneur first began his music career in 2000 as a producer for Jay-Z’s Roc-A-Fella Records, working with artists like Alicia Keys, John Legend and Janet Jackson. In 2002, West was in a severe car crash which left his jaw wired shut and inspired the track “Through the Wire,” which featured on his 2004 debut album “The College Dropout.” The album was titled appropriately, as West had dropped out of the Chicago’s American Academy of Art to pursue music.\n\nMake Your Money Work Better for You\n\nMore: 30 Celebrities Who Went From Rags to Riches\n\nThe album received 10 Grammy nominations and a certified triple platinum in the U.S, taking West to the next level of his stardom. With his newfound fame, he continued to release albums: “Late Registration” in 2005, “Graduation” in 2007, “808s & Heartbreak” in 2008, “My Beautiful Dark Twisted Fantasy” in 2010, a collaboration album with Jay-Z titled “Watch the Throne” in 2011, “Yeezus” in 2013, “The Life of Pablo” in 2016, “Ye” in 2018 and “Jesus is King” in 2019.\n\nWest is no stranger to accolades, either. He boasts 21 Grammys and 70 Grammy nominations, as well as his albums “Yeezus” and “The Life of Pablo” both reaching the No.1 position on the Hot 200 Billboard chart.\n\nWest has continued to produce music for the likes of 6ix9ine, XXXTentacion, Lil Pump, Chance the Rapper, Kid Cudi, and Teyana Taylor. Even so, his musical endeavors account for a mere 0.05% of his wealth, or an estimated $90 million. The major stakes in his net worth remain largely in his fashion brand, Yeezy, which he owns 100% and earns $150-200 million in royalties per year.\n\nMake Your Money Work Better for You\n\nFashioning a Career\n\nMost of the 44-year-old’s assets come from his fashion ventures, rather than music. His career in the fashion industry started from a sneaker collaboration project between Nike and himself — Air Yeezys — which launched in 2007. The cult following for West’s designs quickly grew and eventually lead to a 10-year contract with Nike’s rival company Adidas in 2013. Two years later, the Yeezy Boost 350 sneaker was born, which created an insane resale value. The coveted shoes skyrocketed in price online, which sneaker-heads lapped up like milk from a spoon.\n\nRelated: Kanye West’s Old Yeezys Could Be the Most Expensive Shoes Ever Bought or Sold\n\nThe iconic sneakers placed Kanye in a world of his own. Yeezy is set to release several new sneakers by the end of this year; three Yeezy Boost 350s V2s called “Mono Ice,” “Mono Mist” and “Mono Clay,” plus a rumored new 700 V3 color way which could be glow-in-the-dark. The news comes after his major restock on Yeezy Supply August 2nd.\n\nIn June 2020, West’s Yeezy fashion brand signed a 10-year partnership with Gap. The co-branded collection called Yeezy X Gap will range for men, women and children and is expected to tremendously increase the value of the rapper’s empire.\n\nDon’t get too ahead of yourself, the former CEO of Gap, Mickey Drexler, warned West. Drexler believes West has some potential red flags in his deal, stating Kayne “is not a corporate person.” But the combined value of Yeezy — an Adidas partnership — and Yeezy X Gap already surpassed $4.7 billion, despite the Gap collaboration not even re-leasing yet.\n\nKim Kardashian Split\n\nWest and Kim Kardashian West announced their shocking split in February of this year, after several public meltdowns and Twitter rants from the artist, in which he compared his life to the Jordan Peele horror movie “Get Out.” The pair had long fought over where they should live and raise their family of four, with West choosing the sanctuary of his 4,524-acre Wyoming ranch and Kim preferring the sprawling hills of Los Angeles, near her large immediate family.\n\nThe separated couple will eventually have to divvy up their assets in the divorce proceedings, which include an impressive portfolio of real estate together, stakes in each other’s companies and custody of their four children — North, Saint, Chicago and Psalm. Despite Kim selling out her stake in Yeezy earlier this year, Kanye still has a reported $64 million hold in Kim’s lounge and shape-wear brand, Skims.\n\nRead: Kimye and 30 of the Most Expensive Celebrity Divorces To Rock Hollywood\n\nThe A-list divorce is set to be one of the most infamous separations to rock the world this year and will be tasked with tediously separating their combined wealth. Similarly, the world delved into another powerhouse couple divorce this year, the separation of Melinda and Bill Gates’ $148 billion net worth.\n\nThe couple are said to be on good terms, with Kardashian supporting West at his latest endeavor, the listening party for his latest album titled “Donda” on July 22. The pair coordinated in monochromatic red outfits, with West adorning several unreleased pieces from his Yeezy X Gap line.\n\nDespite being supportive of one another through the divorce, sources state Kardashian is still planning an upcoming rebrand of her beauty line KKW BEAUTY to separate herself from West’s last name.\n\nOther Business Ventures\n\nKanye has always lived by the motto “Dream Big,” like when he tried to run for president in 2020. However, this has occasionally ended with some of his business ventures failing through the years, including his travel company Kanye Travel Ventures, fast-food chain venture with Fatburger and, most recently, his ties to the nonprofit Donda House.\n\nFind Out: 30 Celebrities Making Serious Dough in the Food Industry\n\nWest has long been philanthropic; in 2011 he and fellow rapper Che “Rhymefest” Smith co-created the nonprofit charity Donda House in his hometown of Chicago to honor his late-mother. The charity become the center of a controversy in 2018 when Rhymefest tweeted at rapper Drake for support, stating Kanye abandoned the project.\n\nKim Kardashian West took to Twitter to blast Rhymefest, saying he would no longer be featured on Kanye’s album at the time, “Ye.” This backlash came after the nonprofit released a statement in May 2018 that the charity was unable to secure funding for construction and was distancing itself from Kanye West due to his public support of President Donald Trump. The nonprofit quickly rebranded after the incident to Art of Culture, Inc. and has separated its ties from Kanye all-together.\n\nDespite all this, West continues to aim high with his efforts. His latest big dream began in 2018, an initiative he announced as Yeezy Home, to create an affordable housing development in Calabasas, California. West fiddled with several “Star Wars”-inspired dome prototypes, which the city eventually made him tear down due to lack of permits.\n\nYeezy Home is the architecture arm of his expanded Yeezy empire and aims to tackle the housing crisis by creating low-income homes composed of prefabricated concrete modules, called YZY SHLTRS. It is unsure if West is continuing with this project, but true Kanye fans know to never get too comfortable, as the artist is always coming up with something new.\n\nMore From GOBankingRates\n\nLast updated: October 19, 2021", "images": ["https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/best-banks-2021/spinner-solid.svg.gzip", "https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/home/fortune.png", "http://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/img/logo-zergnet.png", "https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/home/cbs.png", "https://cdn.gobankingrates.com/wp-content/uploads/2021/06/Untitled-design-1.png?w=352&quality=75", "https://cdn.gobankingrates.com/wp-content/uploads/2021/07/image_6487327-2-150x150.jpg", "https://cdn.gobankingrates.com/wp-content/uploads/2021/08/shutterstock_editorial_10704781a-1.jpg?w=675&quality=75", "https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/home/msn.png", "https://cdn.gobankingrates.com/wp-content/uploads/2021/06/The-GBR-Closer-icon.png", "https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/home/cnn-money.png", "https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/best-banks-2021/times-light.svg.gzip", "https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/gbr-logo.svg.gzip", "https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/home/time-money.png", "https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/home/aol.png", "https://cdn.gobankingrates.com/wp-content/uploads/2021/06/newsletter-cta-bg-desktop.png?w=653&quality=1", "https://cdn.gobankingrates.com/wp-content/uploads/2021/08/shutterstock_editorial_10704781a-1.jpg"], "top_img": "https://cdn.gobankingrates.com/wp-content/uploads/2021/08/shutterstock_editorial_10704781a-1.jpg", "keywords": [], "authors": ["Katherine Hoey", "About The Author", "Katherine Hoey Is A Freelance Journalist Currently Living In Miami. The Long Island Native Graduated With A Ba The School Of Journalism At Stony Brook University. She Won The Folio Award The Fair Media Council For Best Use Of Instagram."], "canonical_link": "https://www.gobankingrates.com/net-worth/celebrities/kanye-west-net-worth/", "title": "How Much Kanye West Is Worth After Officially Changing His Name", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, shrink-to-fit=no", "robots": "max-image-preview:large", "description": "The richest Black man in America might soon be the rapper formerly known as Kanye West, according to projected reports from Bloomberg, which foreshadow his upcoming earnings to be in the $6-7 billion...", "keywords": "GOBankingRates,celebrities,net worth", "og": {"title": "How Much Kanye West Is Worth After Officially Changing His Name", "type": "article", "url": "https://www.gobankingrates.com/net-worth/celebrities/kanye-west-net-worth/", "image": "https://cdn.gobankingrates.com/wp-content/uploads/2021/08/shutterstock_editorial_10704781a-1.jpg", "site_name": "GOBankingRates", "description": "Kanye is on his way to being the richest Black man in America."}, "article": {"published_time": "2021-01-14T16:34:23Z", "modified_time": "2021-10-19T12:06:06Z"}, "twitter": {"card": "summary_large_image", "title": "How Much Kanye West Is Worth After Officially Changing His Name", "description": "Kanye is on his way to being the richest Black man in America.", "image": "https://cdn.gobankingrates.com/wp-content/uploads/2021/08/shutterstock_editorial_10704781a-1.jpg"}, "google-site-verification": "UM4IRrnbuHbpidFzGcubzUTnYM2nSbbsENyWzajsLtg", "p": {"domain_verify": "5c213d8c1e1470fb2409d7569153017a"}, "msvalidate.01": "835EF260572EA20ACFC7CE1547620982", "fb": {"pages": 191525857260}, "original-source": "https://www.gobankingrates.com/net-worth/celebrities/kanye-west-net-worth/", "thumbnail": "https://cdn.gobankingrates.com/wp-content/uploads/2021/08/shutterstock_editorial_10704781a-1.jpg", "msapplication-TileImage": "https://cdn.gobankingrates.com/wp-content/uploads/2017/04/cropped-gbr-logo_go_site_id-270x270.png"}, "movies": [], "publish_date": 1610642063.0, "source": "http://www.gobankingrates.com", "summary": ""}