{"url": "https://web.archive.org/web/20040503202738/http://en.wikipedia.org:80/wiki/Jessica_Simpson", "text": "Jessica Simpson\n\nFrom Wikipedia, the free encyclopedia.\n\nJessica Simpson (born July 10, 1980) is an American pop and CCM singer who rose to fame during the late 1990s. She stars with her husband Nick Lachey in the MTV reality show Newlyweds.\n\nSimpson's website says that she was born and raised in Dallas, Texas although her VH1 biography states her birthplace as Waco, Texas. She started singing at 12 as part of her Baptist church choir. At the same age, she made an unsuccessful application for the Mickey Mouse Club.\n\nJessica Simpson was discovered singing at a church camp by a head of a small CCM label and recorded an album over three years although it was never released due to the label folding. While waiting for the album to be released, she toured the Christian Youth Conference circuit performing with Kirk Franklin, God's Property and CeCe Winans. She and her father sold copies of the album after her performances.\n\nTommy Mottola of Columbia Records obtained a copy of the album and, thinking she had potential as a pop singer, signed her as a pop singer.\n\nIn 1999, Simpson released her debut pop album Sweet Kisses, reaching a peak of 25 on the Billboard 200. Her first single \"I Wanna Love You Forever\" reached the top 5 on the Billboard Hot 100 in late 1999, while her second single \"I Think I'm In Love With You\" reached the top 40 and \"Where You Are\" reached the Hot 100. \"I Wanna Love You Forever\" also made the top 10 in Canada, and \"I Think I'm In Love With You\" reached the top 20 in that country. \"Where You Are\" is a duet with Nick Lachey, then of the '90s boy band 98 Degrees, and the couple met when she was supporting the band in 1999. Destiny's Child also appeared on the song \"Woman in Me\".\n\nHer second album, Irresistible, reached the top 10 of the Billboard 200 after its release in 2001; it also reached the top 20 of the Canadian album charts. The title track reached the top 20 in the US and Canada and top 40 in Australia and Switzerland. \"A Little Bit\" was released as a follow up single but failed to achieve much success apart from going top 20 in Portugal.\n\nHer third album, In This Skin, was released in 2003. It reached number 2 on the Billboard 200 album charts and made the Australian album charts in 2004. While the Diane Warren song The Sweetest Sin reached the US Top 40, the second single With You enjoyed more success, going top 20 in the US and Australian singles charts as well as going top 20 in the world adult charts. The third single, a cover of \"Take My Breath Away\" by the band Berlin, has gone top 40 on the US Top 40 Mainstream Charts; it was not included on the original album, but appeared as a bonus track on the \"collectors' edition\" of In This Skin, which was released on March 2, 2004. A cover version of '\"Angels'\" by Robbie Williams also appears as a bonus track.\n\nSimpson and Lachey were married in 2002. The couple currently star in the MTV reality show Newlyweds, which began in 2003 and has so far run for two seasons. She often appears as a stereotype of a dumb blonde, notably when she asked whether the Chicken of the Sea tuna she was eating was chicken or fish or thought that buffalo wings were made from buffalo. Jessica Simpson ended up having the last laugh as the success of the show helped sales of In This Skin. She will also be appearing on VH1's Divas Live show in 2004 as well as a variety show with Nick Lachey on the ABC network called the Nick and Jessica TV Hour on April 11, 2004. On May 1, 2004 Nick and Jessica attended the Kentucky Derby along with many other celebrities.", "images": ["https://web.archive.org/web/20040503202738im_/http://en.wikipedia.org/favicon.ico", "https://web.archive.org/web/20040503202738im_/http://en.wikipedia.org/upload/wiki.png"], "top_img": "https://web.archive.org/web/20040503202738im_/http://en.wikipedia.org/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Wikipedia, the free encyclopedia", "meta_data": {"robots": "index,follow"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}