{"url": "https://www.elle.com/culture/movies-tv/news/a47020/princess-diaries-3-release-date-casting-news/", "text": "It's hard to believe that arrived way back in August 2004. While the past 16 years have just flown by, fans of the real-life fairytale franchise have never given up hope for a third Princess Diaries movie. And 2020 feels as fitting a time as any to bestow the world with some good news.\n\n\n\nIn recent years, traction on a trilogy-making sequel has stalled. Anne Hathaway, who played plucked-from-obscurity princess Mia Thermopolis, confirmed a script exists last year, and while she claimed to be on board for the film alongside co-star Julie Andrews as Queen Clarisse, there haven't been many updates since.\n\nBut, as The Princess Diaries taught us, miracles happen once in a while if you believe. Ahead, everything we know about the status of Princess Diaries 3, including Chris Pine's involvement and Mandy Moore's surprising character theories.\n\nThis content is imported from {embed-name}. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nAs of 2020, the film is possibly going to happen.\n\nQueen Andrews herself gave the latest update on the third movie. During a virtual interview with The Talk in April, the Oscar winner managed to both inspire optimism and cast doubt when it comes to PD3. \"I heard that there might be one,\" she revealed. \"It’s long been talked about but nothing sort of been on my desk or anything like that. I think I would [do it]. I’m getting awfully old and crotchety. I’m not sure if it’s the right timing, but I think to work with Annie [Anne Hathaway, who played Princess Mia] would be lovely again, and sure I’d be up for it. I think we should wait for—if a script comes in, let’s wait for that. Of course, we wouldn’t have the wonderful Gary Marshall who was the director. He’s passed. And he was really the nuts and bolts of it all.\"\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n\"I’m getting awfully old and crotchety. I’m not sure if it’s the right timing, but I think to work with Annie [Hathaway] would be lovely again. And yeah, sure I would be up for it.” - @JulieAndrews on a potential “Princess Diary 3” movie. pic.twitter.com/0qY07FlFMi — The Talk (@TheTalkCBS) April 27, 2020\n\nA script does exist somewhere in the world.\n\nHathaway was last asked about the status of the project during her January 2019 appearance on Watch What Happens Live. She wants it to happen. Julie Andrews wants it to happen. They're working on it, she confirmed. \"There is a script for the third movie.... There is a script,” she said. \"I want to do it. Julie [Andrews] wants to do it. Debra Martin Chase, our producer, wants to do it. We all really want it to happen. It’s just we don’t want to unless it’s perfect, because we love it just as much as you guys love it. It’s as important to us as it is to you, and we don’t want to deliver anything until it’s ready, but we’re working on it, so...\"\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nThe Princess Diaries bookshop.org $10.11 SHOP NOW\n\nBut that script may as well be in the fictional country of Genovia itself, as no one seems to have read it. Or if they have, they're not willing to tease details. Prior to Hathaway confirming there was a script, the author of The Princess Diaries book series, Meg Cabot, told Entertainment Weekly that a script exists. She also said that if the movie gets made, it'll happen \"kind of as a tribute\" to director Garry Marshall, who passed away in 2016. But Cabot refused to reveal any further details, apart from saying that the movies would likely deviate from the book series. She said, \"I think of them as two different universes.\"\n\nGarry Marshall was reportedly planning the third installment before he died.\n\nSpeaking of Marshall, the filmmaker was also passionate about a third movie about Princess Mia. In an interview with People in March 2016, Marshall said, \"I was with Anne Hathaway a couple weeks ago. It looks like we want to do The Princess Diaries 3 in Manhattan.\" Sadly, Marshall's plan never came to fruition, but it's possible that the sequel will still be set in New York, to honor his idea.\n\nChris Pine is open to a third movie.\n\nThe actor seemed enthusiastic when asked about reprising his role as the dashing Nicholas Devereaux in 2016. After quite literally sweeping Mia off her feet at the end of the 2004 sequel, questions remain about the status of Nicholas and Mia's romance. During a fan Q&A for Entertainment Weekly in 2016, Pine was asked, \"Don't you pray every night for a Princess Diaries 3?\" To which he replied, \"Have you been reading my diary?\"\n\nPine and Hathaway in 2004. Giulio Marcocchi Getty Images\n\nMandy Moore would consider a cameo.\n\nIn July 2017, Moore, who played mean-girl cheerleader Lana, told ELLE.com, \"If I'm going to be involved, I would be down for a cameo—maybe she could make amends with Mia and apologize for being a bully when she was younger. She was insecure, going through a difficult time in her life and [has now] reflected on why that wasn't okay.\"\n\nMoore also appeared on People Now in February 2019 and was asked what she would like to see for her character Lana. The actress had a pretty fleshed out answer: \"I would like to see if life kicked down a few pegs because she was the bully in school [if she comes back]. I'd like to see her is life has come full circle and maybe she's a little more well humble. I would be down!\"\n\n©Walt Disney Co./Courtesy Everett Collection Everett\n\nPrincess Mia's best friend Lilly Moscovitz would come back.\n\nIn July 2016, Heather Matarazzo, who played Princess Mia's best friend Lilly Moscovitz, told Cosmopolitan that she would definitely return for another sequel. She said, \"If Annie and Julie are down, of course.\"\n\nThe fans are ready for a royal return.\n\nIf you had concerns about the fanbase returning for a third movie, allow Twitter's evergreen excitement to ease your mind.\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nwhere is enchanted 2 where is princess diaries 3 why is no one asking the important questions — sanya ☯︎ (@wtvrsans) July 19, 2020\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nEvery night before I go to bed I say a little prayer that tomorrow will be the day they announce the release of Princess Diaries 3 — Super Mom (@mirandaexotic) July 18, 2020\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nThe sooner everyone stops complaining and just wears a fucking mask the sooner they can finish filming Legally Blonde 3 and Princess Diaries 3 so I’m gonna need everyone to suck it up and just be smart — feminist killjoy 9.0 (@Sarah__T0nin) July 17, 2020\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\ngive me Princess Diaries 3 and make Mia an anarchist who dissolves the monarchy and redistributes the wealth while her retired grandmother helps her, you cowards — Elly Belle 🔮 (famously not a woman) (@literElly) May 19, 2020\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\ni need Princess Diaries 3 to happen asap — Noah Cyrus (@noahcyrus) February 2, 2020\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nHate the monarchy but still want a 'Princess Diaries 3' — Eimear Keenan (@eimearkeenan) January 5, 2020\n\nAs we await an official announcement, there's plenty of time to rewatch the first two movies, and reflect on Sandra Oh's Oscar-worthy turn as Vice Principal Gupta.\n\nThis content is created and maintained by a third party, and imported onto this page to help users provide their email addresses. You may be able to find more information about this and similar content at piano.io", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mcdprdi-ec057-1548424577.jpg?crop=0.753xw:0.526xh;0.247xw,0.330xh&resize=1200:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mcdprdi-ec056-1548424541.jpg?resize=480:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mcdprdi-ec057-1548424577.jpg?crop=0.753xw:0.526xh;0.247xw,0.330xh&resize=1200:*", "keywords": [], "authors": ["Amy Mackelden", "Savannah Walsh"], "canonical_link": "https://www.elle.com/culture/movies-tv/news/a47020/princess-diaries-3-release-date-casting-news/", "title": "The Princess Diaries 3 News, Cast, Release Date, and Rumors", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=6", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "ELLE", "title": "Everything We Know About The Long-Rumored 'Princess Diaries 3' Movie", "description": "But is the Queen coming, Sandra Oh?!", "url": "https://www.elle.com/culture/movies-tv/news/a47020/princess-diaries-3-release-date-casting-news/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mcdprdi-ec057-1548424577.jpg?crop=0.753xw:0.526xh;0.247xw,0.330xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "modified_time": "2021-11-29 07:18:00", "published_time": "2020-07-22 06:46:00", "section": "Movies & TV 2022", "opinion": "false"}, "twitter": {"site": "@ELLEmagazine", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mcdprdi-ec057-1548424577.jpg?crop=0.753xw:0.526xh;0.247xw,0.330xh&resize=640:*"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "title": "The Princess Diaries 3 News, Cast, Release Date, and Rumors", "description": "If new reports are to be believed, The Princess Diaries 3 is finally on the way, but will Anne Hathaway and Chris Pine return? Here's what we know so far.", "keywords": "Anne Hathaway, chris pine, mandy moore, meg cabot, julie andrews, princess diaries 3, princess diaries, princess diaries 3 cast, princess diaries 3 date, princess diaries 3 news, princess diaries 3 rumors", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mcdprdi-ec057-1548424577.jpg?crop=0.455xw:0.633xh;0.362xw,0.276xh&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Culture,culture,movies-tv,chris pine,mandy moore,anne hathaway", "sailthru.date": "2020-07-22T18:46:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mcdprdi-ec057-1548424577.jpg?crop=0.753xw:0.526xh;0.247xw,0.330xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mcdprdi-ec057-1548424577.jpg?crop=0.455xw:0.633xh;0.362xw,0.276xh", "sailthru.socialtitle": "Everything We Know About The Long-Rumored 'Princess Diaries 3' Movie", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1595393160.0, "source": "https://www.elle.com", "summary": ""}