{"url": "https://web.archive.org/web/20171115221913/https://www.teenvogue.com/story/sexual-harassment-assault-allegations-hollywood-music-entertainment", "text": "Trigger Warning: This post contains language about sexual harassment and assault that some readers may find disturbing.\n\nOn October 5, 2017, The New York Times published a series of allegations against producer Harvey Weinstein from women who claimed that he sexually harassed them. Since those initial accusations came to light, a floodgate seems to have opened, with many people coming forward to discuss their experiences of sexual harassment and/or assault. Shortly after the bombshell report about Weinstein, the hashtag #MeToo , intended to demonstrate the prevalence of harassment and assault within our culture, went viral on social media.\n\nMany of these stories, particularly those in Hollywood and the media, are centered around men who have allegedly abused or harassed people in lower positions of power. The Weinstein scandal seemed to embolden more victims to speak out and shed the light on other men — including directors and celebrity chefs — who they claim have behaved inappropriately toward them. Ahead are some of the biggest cases that have come to light so far this year, most of which were revealed only after the Weinstein accusers told their stories.\n\nThis list is by no means exhaustive, as new allegations continue to be made daily. Anita Hill, who testified in the United States Senate that current Supreme Court Justice Clarence Thomas had sexually harassed her, pointed out to The New Yorker that \"People need to take this moment to make clear that this is not just about Hollywood.” The below list, while centered on Hollywood and the music industry, is not meant to suggest that this is an issue that is specific to one industry. For more coverage on sexual harassment, please click here and here .\n\nTeen Vogue will continue to update this list as more accusations are made.\n\nAndrew Kreisberg\n\nAndrew Kreisberg, who served as the executive producer for Supergirl and The Flash , has been suspended from working on the CW shows after several allegations of sexual harassment, according to Variety . The report cites 19 anonymous sources who did not want to speak on the record for fear of retaliation. Kreisberg told Variety , \"I have made comments on women’s appearances and clothes in my capacity as an executive producer, but they were not sexualized.\" In a statement to CNN, Warner Bros. TV Group said “We have suspended Mr. Kreisberg and are conducting an internal investigation. We take all allegations of misconduct extremely seriously, and are committed to creating a safe working environment for our employees and everyone involved in our productions.”\n\nAndy Dick\n\nActor Andy Dick was recently fired from the film Raising Buchanan after allegations of sexual harassment and misconduct surfaced on the set. The Hollywood Reporter notes that sources described Dick's behavior as groping, unwanted kissing and licking, and sexual propositions of people on set. Dick told THR that he never groped anybody but said: “I might have kissed somebody on the cheek to say goodbye and then licked them. That's my thing.… It's me being funny. I'm not trying to sexually harass people.”\n\nBen Affleck\n\nIn the days following the Weinstein scandal, a fan tweeted that Affleck groped Hilarie Burton’s breasts on an episode of TRL . “Everyone forgot though,” the fan wrote. In turn, Burton took to Twitter to write : “I didn’t forget.” Affleck apologized on Twitter, noting that he “acted inappropriately.” The actor has also been accused of groping by makeup artist Annamarie Tendler, who wrote on Twitter that Affleck grabbed her at a Golden Globes party in 2014. Affleck has yet to comment on Tendler’s accusations.\n\nBob Weinstein\n\nProducer Bob Weinstein (Harvey Weinstein’s brother) was accused of sexual harassment by Amanda Segel, an executive producer of a Weinstein Co. TV series. In an interview with Variety , Segel claimed that Weinstein propositioned her on multiple occasions for private meetings and dinners. “‘No’ should be enough,” she explained to Variety , adding: “After ‘no,’ anybody who has asked you out should just move on.” A representative for Weinstein denied Segel’s allegations, telling Variety that Weinstein maintains he did not behave inappropriately toward her.\n\nBrett Ratner\n\nSix women accused director Brett Ratner of sexual harassment or assault, telling their stories to The Los Angeles Times . Olivia Munn described an incident in which Ratner allegedly masturbated in front of her on the set of a movie, and model Natasha Henstridge claimed that the director forced her to perform oral sex on him. Ratner is now suing an additional accuser for defamation, who alleged on Facebook that Ratner raped her. Martin Singer, Ratner’s attorney, said Ratner has disputed all of the allegations.\n\nCharlie Sheen\n\nActor Dominick Brascia accused Charlie Sheen of raping the late Corey Haim 30 years ago, when Haim was 13 and Sheen was 19. In an interview with The National Enquirer , Brascia said: \"Haim told me he had sex with Sheen when they filmed Lucas . He told me they smoked pot and had sex. He said they had anal sex. Haim said after it happened Sheen became very cold and rejected him. When Corey wanted to fool around again, Charlie was not interested.\" A spokesperson for Sheen told People \"he absolutely denies the claim.\" In the days since the initial allegations broke, Haim's mother told Dr. Oz in an interview that she does not believe Sheen abused her late son, but that another, unnamed man did.\n\nChris Savino\n\nCartoon Brew reported that as many as a dozen women have accused Chris Savino, creator of the Nickelodeon show The Loud House , of inappropriate behavior and unwanted sexual advances. Following the allegations, Savino was put on immediate leave from the company. He later responded to the accusations in a Facebook post, writing: “I am deeply sorry and ashamed. Although it was never my intention, I now understand that the impact of my actions and communications created an unacceptable environment. At every stage of my career, I have sought to uplift my colleagues and cultivate a culture of respect. In this objective, I have failed. I should have known better, I should have acted better, and this has been a difficult but valuable lesson. I have nothing but the deepest respect for the bravery of the women who have spoken out, trying to create an environment in which they can thrive to their fullest potential.”\n\nDavid Guillod\n\nThe Wrap reported that several women have accused Atomic Blonde producer David Guillod of sexual assault, including Ted actress Jessica Barth. Barth alleges that, in 2012, Guillod drugged and sexually assaulted her. A former assistant alleges that he raped her at a company retreat in 2014; The Wrap reported that, according to multiple sources, the assistant left the company shortly after reaching a settlement and signing a nondisclosure agreement. A publicist told The Wrap, “Mr. Guillod is saddened by these false and malicious claims. Especially the accusations made by an individual he dated and considered a friend.”\n\nDustin Hoffman\n\nIn an essay for The Hollywood Reporter , Anna Graham Hunter described being groped and sexually harassed by actor Dustin Hoffman when she was a 17-year-old intern on the set of a TV film of Death of a Salesman in 1985. In a statement provided to THR , Hoffman said: “I have the utmost respect for women and feel terrible that anything I might have done could have put her in an uncomfortable situation. I am sorry. It is not reflective of who I am.”\n\nSince Hunter’s allegations came to light, writer Wendy Riss Gatsiounis told Variety that she was also sexually harassed by Hoffman in 1991. When contacted by Variety , a spokesperson for Hoffman declined to comment on these accusations.\n\nEd Westwick\n\nActress Kristina Cohen accused Gossip Girl star Ed Westick of rape in a Facebook post on November 6, 2017. She claims that the actor assaulted her when she was visiting his house three years ago with her boyfriend, who was a producer. Kristina says she had fallen asleep in a guest room, and woke up to Ed on top of her. \"I was woken up abruptly by Ed on top of me, his fingers entering my body,\" she wrote in her post. \"I told him to stop, but he was strong. I fought him off as hard as I could but he grabbed my face in his hands, shaking me, telling me he wanted to f*ck me. I was paralyzed, terrified. I couldn’t speak, I could no longer move. He held me down and raped me.\"\n\nA second woman came forward on November 8 to also accuse the actor of rape. Former actress Aurélie Wynn wrote in a Facebook post that Ed assaulted her while she was visiting his rental home in July 2014. \"I said no and he pushed [my] face down and was powerless under his weight,\" Aurélie wrote. \"I was wearing a one piece bathing suit that he ripped, I was in complete shock.\"\n\nEd denied both the allegations in posts on social media. \"I do not know this woman,\" he tweeted in response to Kristina's accusations. \"I have never forced myself in any manner, on any woman. I certainly have never committed rape.\" After Aurélie came forward, he wrote in another post: \"It is disheartening and sad to me that as a result of two unverified and provably untrue social media claims, there are some in this environment who could ever conclude I have had anything to do with such vile and horrific conduct. I have absolutely not, and I am cooperating with the authorities so that they can clear my name as soon as possible.\"\n\nOn November 14, a third woman accused Ed of sexual assault, claiming he \"aggressively groped\" her in 2014, the night before the Academy Awards. Rachel Eck told BuzzFeed News she had gone to meet her ex-boyfriend, producer Kaine Harling, at a villa in West Hollywood. Rachel alleges that Ed eventually pushed her on a bed and groped her and said, \"I shoved him off as quickly as I could and left.\" A representative for Ed did not comment on the most recent allegation to BuzzFeed News. Teen Vogue has also reached out to Ed's representatives for comment.\n\nGary Goddard\n\nFormer ER actor Anthony Edwards alleged that producer Gary Goddard had molested him when he was a child, The Wrap reported . In an essay on Medium , the actor wrote, \"I was molested by Goddard, my best friend was raped by him — and this went on for years.\" The Wrap reported that Goddard had previously been named in a 2014 lawsuit by Michael Egan against director Bryan Singer, which was later dropped. Goddard has yet to respond to the allegations.\n\nGeorge Takei\n\nFormer model and actor Scott R. Brunton has accused Star Trek actor George Takei of sexual assault. He told The Hollywood Reporter that Takei allegedly took advantage of him in 1981, shortly after Brunton broke up with his boyfriend at the time. According to Brunton, the two men went to dinner and the theater. Brunton alleges that he had two drinks at Takei’s condo before feeling very disoriented and dizzy, claiming that he must have passed out shortly afterwards.\n\n\"The next thing I remember I was coming to and he had my pants down around my ankles and he was groping my crotch and trying to get my underwear off and feeling me up at the same time, trying to get his hands down my underwear,\" Brunton told THR . \"I came to and said, 'What are you doing?!' I said, 'I don't want to do this.' He goes, 'You need to relax. I am just trying to make you comfortable. Get comfortable.'\" Brunton went on to say that he eventually left Takei's condo, and drove home after he felt well enough to get behind the wheel.\n\nIn a series of tweets , Takei has responded to Brunton's allegations, denying that the incident occurred, and claiming that he does not remember Brunton. \" I do take these claims very seriously, and I wanted to provide my response thoughtfully and not out of the moment,\" he added. \"Right now it is a he said / he said situation, over alleged events nearly 40 years ago. But those that know me understand that non-consensual acts are so antithetical to my values and my practices, the very idea that someone would accuse me of this is quite personally painful.\"\n\nHarvey Weinstein\n\nHollywood producer Harvey Weinstein has been accused by dozens of women of sexual harassment, unwanted advances, and sexual assault. Weinstein was subsequently fired from his company and pledged to attend rehab for “sex addiction.” Following the initial accusations, Weinstein shared a statement with The New York Times in which he apologized for behavior that he said was reflective of “the culture” when he came of age in the ‘60s and ‘70s. Through his spokeswoman Sallie Hofmeister, Weinstein has issued the following statement on all accusations: “Any allegations of nonconsensual sex are unequivocally denied by Mr. Weinstein. Mr. Weinstein has further confirmed that there were never any acts of retaliation against any women for refusing his advances.”\n\nApproximately one month after the initial accusations came to light, The New Yorker published an article by Ronan Farrow alleging that Weinstein hired private investigators to collect information about the women who have accused him of harassment or assault.\n\nJames Toback\n\nIn October, the Los Angeles Times revealed that over 30 women had accused Hollywood director James Toback of sexual harassment. Since then, more women have come forward with allegations against Toback, including Ellen Pompeo , Rachel McAdams, and Selma Blair . Toback denied the allegations in an interview with Rolling Stone .\n\nJeffrey Tambor\n\nTransparent actor Jeffrey Tambor was accused of sexual misconduct by his former assistant, Van Barnes, according to The Holllywood Reporter . Barnes, who is transgender, alleged that the actor had been inappropriate to her in a private Facebook post; Amazon is now investigating the claims, and series creator Jill Soloway told THR that the show is cooperating with the investigation. In a statement, Tambor said, \"I adamantly and vehemently reject and deny any and all implication and allegation that I have ever engaged in any improper behavior toward this person or any other person I have ever worked with. I am appalled and distressed by this baseless allegation.”\n\nJeremy Piven\n\nActress and model Ariane Bellamar accused Entourage star Jeremy Piven of groping her, writing on Twitter : “Jeremy Piven, on two occasions, cornered me & forcefully fondled my breasts & bum. Once at the mansion & once on set.” Piven denied the accusations, saying in a statement: “I unequivocally deny the appalling allegations being peddled about me. It did not happen.”\n\nAfter Bellamar came forward, two more women accused the actor of sexual misconduct. Actress Cassidy Freeman accused Piven of \"predatory behavior,\" defending Bellamar's claims. Advertising executive Tiffany Bacon Scourby told People that Piven assaulted her, describing an incident where the actor rubbed his genitals on her body and ejaculated on her shirt.\n\nIn response to the new allegations, Piven has released a statement on social media denying that any of these incidents occurred.\n\nHBO also released a statement in response to Bellamar’s allegations: “Everyone at HBO and our productions is aware that zero tolerance for sexual harassment is our policy. Anyone experiencing an unsafe working environment has several avenues for making complaints that we take very seriously.”\n\nKevin Spacey\n\nActor Anthony Rapp told BuzzFeed News that Kevin Spacey made unwanted sexual advances toward him when he was 14 years old. In response to the allegations, Spacey tweeted that he does not remember the alleged encounter with Rapp, adding: “But if I did behave then as he describes, I owe him the sincerest apology for what would have been deeply inappropriate drunken behavior….”\n\nIn the wake of Rapp’s allegations, several other people have come forward with similar accusations toward Spacey, including former TV anchor Heather Unruh, who claims that Spacey assaulted her son in the summer of 2016. In a news conference, Unruh said her son — who was 18 at the time — was at a bar where Spacey bought him several drinks. Later, the actor allegedly reached into the teen's pants and grabbed his genitals.\n\nIn response to these accusations, Netflix has reportedly cut ties with the actor. Spacey was also dropped from the upcoming film All the Money In the World , and the role has since been recast.\n\nLouis C.K.\n\nOn November 9, The New York Times published allegations made by five women who said comedian and actor Louis C.K. had subjected them to sexual misconduct. Two women alleged that C.K. had exposed himself and masturbated in front of them; one alleged that he had masturbated while on the phone with her; and a fourth alleged that he had asked her if he could masturbate in front of him. One of the women declined to be named in the story. The comedian issued a statement on November 10 apologizing, noting that \"these stories are true\" and that, at the time, he thought the incidents were OK because he had asked. As he now rightly concedes, asking does not excuse the harassment. A number of companies, including Netflix and HBO , have since distanced themselves from his work, by either removing it from a platform or canceling its production.\n\n__ Mark Schwahn__\n\nThe cast and crew of One Tree Hill have accused former showrunner Mark Schwahn of sexual harassment. According to Variety , the cast and crew, including Sophia Bush and Hilarie Burton, wrote a letter on November 13 in support of former writer for the show Audrey Wauchope \"and one other.\" Wauchope accused Schwahn of sexual harassment on Twitter.\n\n“Many of us were, to varying degrees, manipulated psychologically and emotionally,\" the letter says . \"More than one of us is still in treatment for post-traumatic stress. Many of us were put in uncomfortable positions and had to swiftly learn to fight back, sometimes physically, because it was made clear to us that the supervisors in the room were not the protectors they were supposed to be. Many of us were spoken to in ways that ran the spectrum from deeply upsetting, to traumatizing, to downright illegal. And a few of us were put in positions where we felt physically unsafe. ”\n\nE!, Universal Cable Productions and Lionsgate Television — the companies working on Schwahn's current show, The Royals , issued a statement on November 13 noting they are \"monitoring the information carefully,\" and are \"committed to providing a safe working environment in which everyone is treated respectfully and professionally.\n\nMatthew Weiner\n\nMad Men creator Matthew Weiner has been accused of sexual harassment by one of the show's writers. According to The Information , Kater Gordon, who had worked as Weiner's assistant prior to being a writer on the show, said Weiner \"told me that I owed it to him to let him see me naked.\" According to The Hollywood Reporter , the producer's rep told The Information that \"Mr. Weiner spent eight to ten hours a day writing dialogue aloud with Miss Gordon, who started on Mad Men as his writers assistant. He does not remember saying this comment nor does it reflect a comment he would say to any colleague.\"\n\nOliver Stone\n\nWriter-director Oliver Stone was accused of groping model and actress Carrie Stevens. She tweeted : “When I heard about Harvey, I recalled Oliver walking past me & grabbing my boob as he walked out the front door of a party. Two of a kind!” Actress Patricia Arquette also alleged inappropriate behavior from Stone in her two of her own tweets and said that he asked her for a meeting and later followed up by sending her flowers — an action that she says \"felt weird.\" Olive Stone has not commented on either allegation.\n\nPeter Aalbaek Jensen\n\nPeter Aalbaek Jensen, who co-founded the Zentropa production company with Lars von Trier, allegedly harassed or bullied 9 women, according to The Hollywood Reporter . The women, including producer Meta Louise Foldager Sorensen told Politiken that “sexual harassment have long been part of the work environment for many employees”; they allege that Jensen was “one of the main figures perpetuating the system of degradation.” Jensen has not commented on the allegations, but Zentropa CEO Anders Kjærhauge said the company would look into changing workplace culture.\n\nR. Kelly\n\nIn July 2017, BuzzFeed News published allegations that singer R. Kelly was grooming women and holding them against their will. Parents of one of the women said \"it is as if she had been brainwashed\" when they saw her, and alleged that he had limited her contact with outside family members. R. Kelly's former personal assistant corroborated the claims, which follow a long history of allegations made against the singer. BuzzFeed News noted, \"Kelly has long maintained his innocence on allegations of underage sex, and in recent interviews he has either persistently dodged questions about his past behavior or stormed off when he was unable to do that.\" Multiple efforts by BuzzFeed News to reach R. Kelly for comment for the story were unsuccessful, but a representative for him issued a statement later that day to TMZ saying that \"Mr. Kelly unequivocally denies such accusations and will work diligently and forcibly to pursue his accusers and clear his name.\" A month later , another woman alleged to BuzzFeed News that she had sex with R. Kelly when she was 15 years old. R. Kelly's reps denied the woman's allegations.\n\nRichard Dreyfuss\n\nActor Richard Dreyfuss has been accused of sexual harassment by Jessica Teich, a writer who worked for him in the 1980s. Teich told Vulture that her boss \"created a very hostile work environment, where I felt sexualized, objectified, and unsafe” and allegedly exposed his penis to her on one occasion. In a statement to Vulture , Dreyfuss said that \"I emphatically deny ever 'exposing' myself to Jessica Teich, whom I have considered a friend for 30 years. I did flirt with her, and I remember trying to kiss Jessica as part of what I thought was a consensual seduction ritual that went on and on for many years. I am horrified and bewildered to discover that it wasn’t consensual.\"\n\nRoman Polanski\n\nDirector Roman Polanski was accused by two women this year of molestation and rape. Marianne Barnard told The Sun that Polanski allegedly molested her when she was just 10 years old, after photographing her in a bikini and requesting that she remove her clothing. Through his agent, Polanski denied the claims . Former actress Renate Langer has also come forward with an accusation against Polanski, telling The New York Times that he allegedly raped her when she was 15. Polanski has been living in exile since 1978 after pleading guilty to a charge of “unlawful sexual intercourse with a minor.” He has not commented on the new allegations. A lawyer for Polansky declined to comment to The New York Times on Langer's allegation. But the New York Times article noted that while Polanski pleaded guilty to unlawful sex in 1977 with a 13-year-old, his lawyer has disputed previous accusations.\n\nRoy Price\n\nLast month, Roy Price resigned from Amazon Studios, just days after he was suspended following sexual harassment allegations. The former head of the company was accused by producer Isa Hackett of making lewd comments to her. Hackett told The Hollywood Reporter that she reported the incident to Amazon at the time but was reluctant to talk publicly about what happened. Price has not commented in response to the allegations.\n\nTom Sizemore\n\nIn a new report from The Hollywood Reporter , actor Tom Sizemore left the set of a movie in 2003 after allegedly touching an 11-year-old actress's genitals. THR notes that this incident was not revealed publicly before, and the actress's parents did not press charges. Sizemore's agent told the publication, \"Our position is 'no comment.'\" At the time the incident allegedly happened, sources said that Sizemore denied the claim.\n\nXXXTentacion\n\nRapper Jahseh Onfroy (aka XXXTentacion) has been accused of domestic violence by his former girlfriend. According to an arrest report , the rapper allegedly \"punched and kicked\" his girlfriend, who was pregnant at the time. According to a court document linked to from Pitchfork , he was later charged with aggravated battery of a pregnant woman, domestic battery by strangulation, false imprisonment, and witness tampering. Onfroy has pleaded not guilty to the charges. A trial is set to begin on December 11.\n\nIf you or someone you know has been sexually assaulted, you can seek help by calling the National Sexual Assault Hotline at 800-656-HOPE (4673). For more resources on sexual assault, visit RAINN , End Rape on Campus , Know Your IX , and the National Sexual Violence Resource Center.\n\nRelated: Here's Every Woman Who Has Accused Harvey Weinstein of Sexual Harassment or Assault", "images": ["https://web.archive.org/web/20171115221913im_/https://assets.teenvogue.com/photos/5a063024545af946d5bbdf73/3:2/w_1200,h_630,c_limit/sexual-assault-hollywood-fb.jpg"], "top_img": "https://web.archive.org/web/20171115221913im_/https://assets.teenvogue.com/photos/5a063024545af946d5bbdf73/3:2/w_1200,h_630,c_limit/sexual-assault-hollywood-fb.jpg", "keywords": [], "authors": ["De Elizabeth Ella Ceron", "De Elizabeth", "Ella Ceron"], "canonical_link": "https://web.archive.org/web/20171115221913/https://www.teenvogue.com/story/sexual-harassment-assault-allegations-hollywood-music-entertainment", "title": "Powerful People in Entertainment Who Have Been Accused of Sexual Harassment or Assault", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "author": "De Elizabeth,Ella Ceron", "copyright": "Copyright (c) Condé Nast 2017", "description": "The allegations made against Harvey Weinstein changed how the entertainment industry treats sexual harassment and assault claims. See a list of those accused.", "keywords": "sexual harassment,sexual assault,harvey weinstein,ben affleck", "fb": {"app_id": 1013284322017473, "pages": 6636341311, "admins": 108943}, "og": {"site_name": "Teen Vogue", "title": "A List of Powerful People in Entertainment Who Have Been Accused of Sexual Harassment or Assault This Year", "url": "https://web.archive.org/web/20171115221913/https://www.teenvogue.com/story/sexual-harassment-assault-allegations-hollywood-music-entertainment", "description": "Hollywood isn't the only place harassment happens, but it's helping change the conversation.", "type": "article", "image": "https://web.archive.org/web/20171115221913im_/https://assets.teenvogue.com/photos/5a063024545af946d5bbdf73/3:2/w_1200,h_630,c_limit/sexual-assault-hollywood-fb.jpg"}, "twitter": {"card": "summary_large_image", "site": "@teenvogue", "title": "A List of Powerful People in Entertainment Who Have Been Accused of Sexual Harassment or Assault This Year", "description": "Hollywood isn't the only place harassment happens, but it's helping change the conversation.", "image": {"src": "https://assets.teenvogue.com/photos/5a063024545af946d5bbdf73/3:2/w_1200,h_630,c_limit/sexual-assault-hollywood-fb.jpg?mbid=social_retweet"}, "domain": "teenvogue.com"}, "version": "5.0.0"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}