{"url": "en.wikipedia.org/wiki/Katy_Perry", "text": "American singer, songwriter, and television judge\n\nNot to be confused with Katie Perry\n\nKatheryn Elizabeth Hudson (born October 25, 1984), known professionally as Katy Perry, is an American singer, songwriter, and television judge. She is known for her influence on the pop sound and style of the 2010s. Pursuing a career in gospel music at 16, Perry released her commercially unsuccessful debut album, Katy Hudson (2001), under Red Hill Records. She moved to Los Angeles at 17 to venture into secular music, adopting the stage name \"Katy Perry\" from her mother's maiden name. With producers Glen Ballard and Greg Wells, she recorded an unreleased album titled Fingerprints while signed to Java Records and then Columbia Records before being dropped. After this, she signed a recording contract with Capitol Records in April 2007.[1]\n\nPerry rose to fame with her second album and major label debut, One of the Boys (2008), a pop rock record containing her debut single \"I Kissed a Girl\" and follow-up single \"Hot n Cold\", which respectively reached number one and three on the U.S. Billboard Hot 100. The disco-influenced pop album Teenage Dream (2010) spawned five U.S. number one singles—\"California Gurls\", \"Teenage Dream\", \"Firework\", \"E.T.\", and \"Last Friday Night (T.G.I.F.)\"—becoming the first album by a solo female artist to do so. A reissue titled Teenage Dream: The Complete Confection (2012) subsequently had the U.S. number one single \"Part of Me\". Her fourth album Prism (2013) has themes of self-empowerment and relationships. With the music videos for its U.S. number one singles \"Roar\" and \"Dark Horse\", Perry became the first artist to have multiple videos reach one billion views on YouTube. Witness (2017) featured an electropop sound with themes of liberation and a political subtext, while Smile (2020) featured themes of motherhood and self-help. She later embarked on her first concert residency titled Play in Resorts World Las Vegas, selling out multiple shows and receiving critical acclaim.\n\nPerry is one of the best-selling artists of all time, having sold over 143 million records worldwide. All of her studio albums released under Capitol have individually surpassed one billion streams on Spotify.[2] She has nine U.S. number one singles, three U.S. number one albums and has received various accolades, including four Guinness World Records, five Billboard Music Awards, five American Music Awards, a Brit Award, and a Juno Award. Perry has been included in the annual Forbes lists of highest-earning women in music from 2011 to 2019. Her critically acclaimed Super Bowl halftime show performance is the most watched in history. Outside of music, she released an autobiographical documentary titled Katy Perry: Part of Me in 2012, and voiced Smurfette in The Smurfs film series. Perry began serving as a judge on American Idol, starting from its sixteenth season in 2018. She is also the most followed woman on Twitter, with over 100 million followers.\n\nLife and career\n\n1984–1998: Early life and family\n\nKatheryn Elizabeth Hudson was born on October 25, 1984, in Santa Barbara, California, to Pentecostal pastors Mary Christine (née Perry) and Maurice Keith Hudson.[4] Both of her parents turned to religion after a \"wild youth\".[5] Perry has English, German, Irish, and Portuguese ancestry.[6] Through her mother, she is a niece of film director Frank Perry.[7] She has a younger brother named David, who is a singer,[8] and an older sister, Angela.[9]\n\nFrom ages three to 11, Perry often moved across the country as her parents set up churches before settling again in Santa Barbara. Growing up, she attended religious schools and camps, including Paradise Valley Christian School in Arizona and Santa Barbara Christian School in California during her elementary years.[4][10] Her family struggled financially,[11] sometimes using food stamps and eating food from the food bank which also fed the congregation at Perry's parents' church.[12]\n\nGrowing up, Perry and her siblings were not allowed to eat the cereal Lucky Charms as the word \"luck\" reminded their mother of Lucifer, and had to call deviled eggs \"angeled eggs\".[13] Perry primarily listened to gospel music,[14] as secular music was generally discouraged in the family's home. She discovered popular music through CDs she sneaked from her friends.[15] Perry later recalled a story about how a friend of hers played \"You Oughta Know\" by Alanis Morissette, which impacted her songwriting and singing.\n\nWhile not strictly identifying as religious, she has stated, \"I pray all the time – for self-control, for humility.\"[17] Wanting to be like her sister Angela, Perry began singing by practicing with her sister's cassette tapes. She performed the tracks in front of their parents, who let her take vocal lessons as Angela was at the time. She began training at age nine,[18] and was incorporated into her parents' ministry,[5] singing in church from ages nine to 17.[19] At 13, Perry was given her first guitar for her birthday,[5][20] and publicly performed songs she wrote.[11] She tried to \"be a bit like the typical Californian girl\" while growing up, and started rollerskating, skateboarding, and surfing as a teenager. Her brother David described her as a tomboy during her adolescence, which Perry talks about on her song \"One Of The Boys\".[21] She took dancing lessons and learned how to swing, Lindy Hop, and jitterbug.[22]\n\n1999–2006: Career beginnings, Katy Hudson and Fingerprints\n\nPerry completed her General Educational Development (GED) requirements at age 15,[23] during her first year of high school,[24] and left Dos Pueblos High School to pursue a music career.[25] She briefly had music lessons in facilities rented from the Music Academy of the West.[26] Her singing caught the attention of rock artists Steve Thomas and Jennifer Knapp from Nashville, Tennessee, who brought her there to improve her writing skills.[25] In Nashville, she started recording demos and learned how to write songs and play guitar.[14] Perry signed with Red Hill Records and recorded her debut album, a contemporary Christian record titled Katy Hudson, which was released on March 6, 2001. She also went on tour that year as part of Phil Joel's Strangely Normal Tour[27][28] and embarked on other performances of her own in the United States.[29] Katy Hudson received mixed reviews from critics and was commercially unsuccessful, selling an estimated 200 copies before the label ceased operations in December.[30][31] Transitioning from gospel music to secular music, Perry started working with producer Glen Ballard, and moved to Los Angeles at age 17.[33] She opted to work with Ballard due to his past work with Alanis Morissette, one of her major inspirations. In 2003, she briefly performed as Katheryn Perry to avoid confusion with actress Kate Hudson. She later adopted the stage name 'Katy Perry', using her mother's maiden name. In 2010, she recalled that \"Thinking of You\" was one of the first songs she wrote after moving to Los Angeles.[35]\n\nIn 2004, she signed to Ballard's label, Java Records, which was then affiliated with The Island Def Jam Music Group. Perry began work on a solo record due for release in March 2005, but the record was shelved after Java was dropped.[36] Ballard then introduced her to Tim Devine, an A&R executive at Columbia Records, and she was signed as a solo artist. By November 2006, Perry had finished writing and recording material for her Columbia debut titled Fingerprints (with some of the material from this time appearing on One of the Boys) which was planned for release in 2007.[37] Some of the material from Fingerprints that did not make it on One Of The Boys was given to other artists, such as \"I Do Not Hook Up\" and \"Long Shot\" to Kelly Clarkson and \"Rock God\" to Selena Gomez & the Scene.[38][39]\n\nPerry worked with songwriters including Desmond Child, Greg Wells, Butch Walker, Scott Cutler, Anne Preven, The Matrix, Kara DioGuardi, Max Martin, and Dr. Luke.[40][41] In addition, after Devine suggested that songwriting team The Matrix become a \"real group\", she recorded a shelved album called The Matrix with them.[42] The Matrix was planned to be released in 2004 but was cancelled due to creative differences. It was later released in 2009 after the release of One of the Boys. Perry was dropped from Columbia in 2006 as Fingerprints neared completion. After the label dropped her, she worked at an independent A&R company called Taxi Music.[43]\n\nPerry had minor success prior to her breakthrough. One of the songs she had recorded for her album with Ballard, \"Simple\", was featured on the soundtrack to the 2005 film The Sisterhood of the Traveling Pants.[44] She provided backing vocals on Mick Jagger's song \"Old Habits Die Hard\",[45] which was included on the soundtrack to the 2004 film Alfie.[46] In September 2004, Blender named Perry \"The Next Big Thing\".[44] She recorded background vocals on P.O.D.'s single \"Goodbye for Now\", was featured at the end of its music video in 2006, and performed it with them on The Tonight Show with Jay Leno.[47] That year, Perry also appeared in the music video for \"Learn to Fly\" by Carbon Leaf, and played the love interest of her then-boyfriend, Gym Class Heroes lead singer Travie McCoy, in the band's music video for \"Cupid's Chokehold\".[48]\n\n2007–2009: Breakthrough with One of the Boys\n\nAfter Columbia dropped Perry, Angelica Cob-Baehler, then a publicity executive at the label, brought Perry's demos to Virgin Records chairman Jason Flom. Flom was convinced that she could be a breakthrough star and she was signed to Capitol Records in April 2007. The label arranged for her to work with Dr. Luke to add an \"undeniable smash\" to her existing material.[49][50] Perry and Dr. Luke co-wrote the songs \"I Kissed a Girl\" and \"Hot n Cold\" for her second album One of the Boys. A campaign was started with the November 2007 release of the video to \"Ur So Gay\", a song aimed at introducing her to the music market.[51] A digital EP of the same name was also released that month.[52] Madonna helped publicize the song by praising it on the JohnJay & Rich radio show in April 2008,[53] stating \"Ur So Gay\" was her \"favorite song\" at the time.[54] In March 2008, Perry made a cameo appearance as a club singer in the Wildfire episode \"Life's Too Short\"[55] and appeared as herself during a photo shoot that June on The Young and the Restless for the show's magazine Restless Style.[56]\n\nPerry released her first single with Capitol, \"I Kissed a Girl\", on April 28, 2008,[57] as the lead single from One of the Boys. The first station to pick up the song was WRVW in Nashville, who were inundated with enthusiastic calls the first three days they played it.[58] The track reached number one on the US Billboard Hot 100.[59] \"I Kissed a Girl\" created controversy among both religious and LGBT groups. The former criticized its homosexual theme, while the latter accused her of using bi-curiosity to sell records. In response to speculation that her parents opposed her music and career, Perry told MTV that they had no problems with her success.[60] One of the Boys, released on June 17, 2008, garnered mixed critical reviews and reached number nine on the US Billboard 200.[61][62] The album went on to sell 7 million copies worldwide.[63] \"Hot n Cold\" was released the following September[64] and became the album's second successful single, reaching number three on the Billboard Hot 100[65] while topping charts in Germany,[66] Canada,[67] the Netherlands[68] and Austria.[69] Later singles \"Thinking of You\" and \"Waking Up in Vegas\" were released in 2009[70][71] and reached the top 30 of the Hot 100.[65] The Matrix's self-titled debut album, which Perry had recorded with the band in 2004, was released onto iTunes on January 27, 2009, as a result of her solo success.[46][72]\n\nAfter finishing the 2008 Warped Tour,[73] Perry hosted the 2008 MTV Europe Music Awards in November 2008, where she won the award for Best New Act.[74] At the 2009 Brit Awards, she also won the award for International Female Solo Artist.[75] Perry embarked on her first headlining world tour, the Hello Katy Tour, from January to November 2009 to support One of the Boys.[76] On August 4, 2009, she performed as opening act for one date of No Doubt's 2009 Summer Tour.[77] Perry also hosted the 2009 MTV Europe Music Awards in November 2009, becoming the first person to host two consecutive ceremonies of the European awards.[78] On July 22, 2009, Perry recorded a live album titled MTV Unplugged, which featured acoustic performances of five tracks from One of the Boys as well as one new song, \"Brick by Brick\", and a cover of Fountains of Wayne's \"Hackensack\".[79] It was released on November 17, 2009.[80] Perry also appeared on two singles with other artists; she was featured on a remix of Colorado-based band 3OH!3's song \"Starstrukk\" in September 2009,[81] and on a duet with Timbaland entitled \"If We Ever Meet Again\", from his album Shock Value II, three months later.[82][83] The Guinness World Records recognized her in its 2010 edition as the \"Best Start on the U.S. Digital Chart by a Female Artist\", for digital single sales of over two million copies.[84]\n\nAfter Perry and Travie McCoy split up in December 2008,[85] they briefly reconciled before she ended their relationship in 2009.[86][87] Perry met her future husband Russell Brand in the summer of 2009 while filming a cameo appearance for his film Get Him to the Greek. Her scene, in which the two kiss, does not appear in the film.[88] She began dating Brand after meeting him again that September at the 2009 MTV Video Music Awards.[89] The couple became engaged on December 31, 2009, while vacationing in Rajasthan, India.[90]\n\n2010–2012: Teenage Dream and first marriage\n\nAfter serving as a guest judge on American Idol,[91] Perry released \"California Gurls\" featuring Snoop Dogg on May 7, 2010.[92] The song was the lead single from her third studio album, Teenage Dream, and reached number one on the Billboard Hot 100 in June.[93] She also served as a guest judge on British The X Factor later that month[94] before releasing the album's second single, \"Teenage Dream\", in July.[95] \"Teenage Dream\" reached number one on the Billboard Hot 100 in September.[96] Released on August 24, 2010,[97] Teenage Dream debuted at number one on the Billboard 200,[98] and received mixed reviews from music critics.[99] It has since sold 6 million copies worldwide.[100] Teenage Dream would go on to win the 2011 Juno Award for International Album of the Year.[101] In October, \"Firework\" was released as the album's third single.[102] It became the album's third consecutive number one on the Billboard Hot 100 on December 8, 2010.[103]\n\n\"E.T.\" featuring Kanye West was released as the fourth single from Teenage Dream on February 16, 2011.[104] It topped the Billboard Hot 100 for five non-consecutive weeks, making Teenage Dream the ninth album in history to produce four number one singles on the chart.[105] \"Last Friday Night (T.G.I.F.)\" followed as the fifth single in June,[106] and Perry became the first female artist to achieve five number-one Billboard Hot 100 songs from one album when the single topped that chart on August 17, and the second artist after Michael Jackson with his album Bad.[107] For this record, she received an honorary American Music Award in November 2011[108] and a 2013 Guinness World Record.[109] On September 7, she set a new record by becoming the first artist to spend 69 consecutive weeks in the top ten of the Hot 100.[110] After \"The One That Got Away\" was released as the album's sixth single in October, Teenage Dream became the third album to spawn six top-five songs on the Billboard Hot 100 after Rhythm Nation 1814 by Janet Jackson and Faith by George Michael.[111][112] The song peaked at number three in the US[113] and number two in Canada.[67]\n\nOn January 5, 2012, Perry was named the sixth best-selling digital artist in the United States, with sales of 37.6 million units according to Nielsen SoundScan.[114] That month, she became the first artist to have four songs sell over 5 million digital units when \"E.T.\" reached that mark along with \"Firework\", \"California Gurls\", and \"Hot N Cold\".[115] On February 13, Capitol released the lead single from Teenage Dream: The Complete Confection, \"Part of Me\", which debuted at number one on the Billboard Hot 100 and became Perry's seventh single overall to top the chart.[116] Teenage Dream: The Complete Confection was released on March 23,[117] and serves as a reissue of Teenage Dream.[118] \"Wide Awake\" was released on May 22 as the re-release's second single,[119] peaking at number two on the Billboard Hot 100[113] and number one in Canada[67] and New Zealand.[120]\n\nKaty Perry: Part of Me, which grossed $32.7 million Perry attending the Sydney premiere for her 2012 documentary, which grossed $32.7 million\n\nPerry embarked on her second tour, the California Dreams Tour, in support of Teenage Dream[76] from February 2011 to January 2012.[121] The tour grossed $59.5 million globally[122] and won her the award for Best Live Act at the 2011 MTV Europe Music Awards.[123] On September 23, 2011, she performed on the opening day of the 2011 Rock in Rio festival along with Elton John and Rihanna.[124] In September 2010, Perry was scheduled to appear on the 41st-season premiere of Sesame Street. After her scene was uploaded to YouTube, viewers criticized Perry's exposed cleavage. Four days before the scheduled airing, Sesame Workshop announced that the segment would not air on television, but would still be available to watch online.[125] Perry subsequently mocked the controversy on Saturday Night Live, where she was a musical guest and wore an Elmo-themed shirt showing large amounts of cleavage during one skit.[126]\n\nIn December 2010, Perry played Moe Szyslak's girlfriend in the live-action segment from a Christmas episode of The Simpsons titled \"The Fight Before Christmas\".[127][128] In February 2011, she made a guest appearance on the How I Met Your Mother episode \"Oh Honey\", playing a woman known as Honey.[129] The role won her the People's Choice Award for Favorite TV Guest Star in January 2012.[130] She made her film debut in the 3D family motion picture The Smurfs as Smurfette on July 29, 2011. The film was a financial success worldwide,[131] while critics gave mostly negative reviews.[132] She hosted Saturday Night Live on December 10, 2011, with Robyn as the episode's musical guest. Perry's work on the episode received generally positive reviews from critics, who praised her performance in the episode's digital short featuring her and Andy Samberg.[133] In March 2012, she guest starred as a prison security guard named Rikki on the Raising Hope episode \"Single White Female Role Model\".[134] On July 5, 2012, Perry's autobiographical documentary Katy Perry: Part of Me was released to theaters through Paramount Pictures.[135][136] The film received positive reviews[137] and grossed $32.7 million worldwide at the box office.[138]\n\nPerry began to venture into business when she endorsed her first fragrance, Purr, in November 2010. Her second fragrance, Meow!, was released in December 2011. Both perfumes were released through Nordstrom department stores.[139][140] Electronic Arts recruited her to promote their new expansion pack for The Sims 3: Showtime,[141] before releasing a separate stuff pack featuring Perry-inspired furniture, outfits, and hairstyles, titled The Sims 3: Katy Perry's Sweet Treats, in June 2012.[142] The following month, she became the spokesperson and ambassador for Popchips and made an investment in the company.[143] Billboard dubbed her as their \"Woman of the Year\" for 2012.[144]\n\nShe married Russell Brand on October 23, 2010, in a traditional Hindu ceremony near the Ranthambhore tiger sanctuary in Rajasthan, India.[145] Brand announced on December 30, 2011, that they were divorcing after 14 months of marriage.[146] Perry later stated that conflicting career schedules and his desire to have children before she was ready led to the end of their marriage and that he never spoke to her again after sending a text message that he was divorcing her,[148] while Brand asserted that he divorced her due to her commercial success and reluctance to engage in activism.[149] She was initially distraught over their divorce, and said that she contemplated suicide.[150][151] After the marriage ended in 2012,[152] Perry began a relationship with singer John Mayer that August.[153]\n\n2013–2015: Prism and Super Bowl XLIX halftime show\n\nIn November 2012, Perry began work on her fourth album, Prism.[154][150] She told Billboard, \"I know exactly the record I want to make next. I know the artwork, the coloring and the tone\" and \"I even know what type of tour I'm doing next. I'll be very pleased if the vision I have in my head becomes a reality.\"[155] After initially telling L'Uomo Vogue in June 2012 that she planned to have \"darker elements\" in Prism following the end of her marriage, the singer revealed to MTV during the 2013 MTV Video Music Awards that she changed the album's direction after periods of self-reflection. Perry commented \"I felt very prismatic\", which inspired the album's name.[156][157] \"Roar\" was released as the lead single from Prism on August 10, 2013.[158] It was promoted at the MTV Video Music Awards and reached number one on the Billboard Hot 100.[159][160] \"Unconditionally\" followed as the second single from Prism on October 16, 2013,[161] and peaked at number 14 in the United States.[162]\n\nPrism was released on October 18, 2013, and has sold 4 million copies as of August 2015.[163] It received favorable reviews from critics[154] and debuted at number one on the Billboard 200 chart.[164] Four days later, Perry performed the songs from the album at the iHeartRadio Theater in Los Angeles.[165] \"Dark Horse\" with Juicy J was released as the album's third single in December, and became her ninth U.S. number-one single the following month.[166][167] In 2014, \"Birthday\" and \"This Is How We Do\" respectively followed as the album's fourth and fifth singles,[168][169] and reached the top 25 on the Hot 100.[65] Prior to ending her relationship with Mayer in February 2014,[170][171] she recorded and co-wrote a duet with him titled \"Who You Love\" for his album Paradise Valley. The song was released on August 12, 2013.[172] Perry's third headlining tour, the Prismatic World Tour, began in May 2014[121] and concluded in October 2015.[163] It sold almost 2 million tickets and grossed $204.3 million worldwide[173] and won Perry the award for \"Top Package\" at the 2014 Billboard Touring Awards.[174] She also performed at the 2015 Rock in Rio festival on September 27, 2015.[175]\n\nOn November 23, 2014, the NFL announced that Perry would perform at the Super Bowl XLIX halftime show on February 1, 2015.[176] Lenny Kravitz and Missy Elliott served as special guests for the show.[177] Her performance was critically acclaimed,[178] and the Guinness World Records announced two days after the singer's halftime show that it garnered 118.5 million viewers in the United States, becoming the most watched and highest rated show in Super Bowl history. The viewership was higher than the game itself, which was viewed by an audience of 114.4 million.[179]\n\nThe International Federation of the Phonographic Industry (IFPI) ranked her fifth on the list of Top Global Recording Artists of 2013.[180] On June 26, 2014, she was declared the Top Certified Digital Artist Ever by the Recording Industry Association of America (RIAA) for certified sales of 72 million digital singles in the United States.[181][182] In May 2014, a portrait of Perry by painter Mark Ryden was featured in his exhibition \"The Gay 90s\", and shown at the Kohn Gallery in Los Angeles. Along with several other artists, she also recorded a cover version of the song \"Daisy Bell (Bicycle Built for Two)\" on a limited-edition concept album titled The Gay Nineties Old Tyme Music: Daisy Bell to accompany the exhibition.[183] That month, a portrait of Perry by artist Will Cotton was included in the United States National Portrait Gallery.[184] On November 23, 2015, Perry starred in H&M's holiday advertising campaign, for which she wrote and recorded a song titled \"Every Day Is a Holiday\".[185][186]\n\nOn June 17, 2014, Perry announced that she had founded her own record label under Capitol Records, titled Metamorphosis Music. Ferras was the first artist to get signed to her label, and Perry served as an executive producer on his self-titled EP. She also recorded a duet with him on the EP, titled \"Legends Never Die\".[187] The label was later renamed Unsub Records.[188]\n\nOutside of her music career, Perry reprised her role as Smurfette in The Smurfs 2, which was released in theaters on July 31, 2013.[189] Like its predecessor, The Smurfs 2 was a financial success[190] but was panned by critics.[191] In March 2014, she made a guest appearance playing herself in the episode \"Blisteritos Presents Dad Academy Graduation Congraduritos Red Carpet Viewing Party\" of the Kroll Show.[192] Killer Queen was released as her third fragrance in August 2013 through Coty, Inc.[193] In January 2014, she became a guest curator of Madonna's Art for Freedom initiative.[194] In March 2015, she appeared in Brand: A Second Coming, a documentary following her ex-husband Russell Brand's transition from comedy work to activism,[149] and released a concert film titled Katy Perry: The Prismatic World Tour through Epix, which took place during her tour of the same name.[136] Perry also made a cameo appearance in the music video for Madonna's song \"Bitch I'm Madonna\" in June 2015.[195] The following month, she released another fragrance with Coty, entitled Mad Potion.[196] In September 2015, she appeared in the documentaries Katy Perry: Making of the Pepsi Super Bowl Halftime Show, which followed Perry's preparation for her Super Bowl performance,[197] and Jeremy Scott: The People's Designer, which followed the life and career of designer Jeremy Scott.[198] Perry released a mobile app titled Katy Perry Pop in December 2015 through Glu Mobile where her character helps players become famous musicians.[199] She described it as \"the most fun, colorful world that helps guide your musical dreams\".[200]\n\n2016–2018: Witness and American Idol\n\nPerry started writing songs for her new album in June 2016,[201] and recorded an anthem for NBC Sports's coverage of the 2016 Summer Olympics titled \"Rise\", which was released the following month. Perry chose to release it as a standalone track rather than save it for her album \"because now more than ever, there is a need for our world to unite\". NBC also felt its message spoke \"directly to the spirit of the Olympics and its athletes\" for its inspirational themes.[202] The song reached number one in Australia[203] and number eleven in the United States.[65]\n\nIn August 2016, Perry stated that she aspired to create material \"that connects and relates and inspires\"[204] and told Ryan Seacrest that she was \"not rushing\" her fifth album, adding \"I'm just having a lot of fun, but experimenting and trying different producers, and different collaborators, and different styles\".[205] On February 10, 2017, Perry released the album's lead single \"Chained to the Rhythm\" featuring Skip Marley.[206][207] It reached number one in Hungary[208] and number four in the United States.[65] The track was also streamed over three million times on Spotify within 24 hours, breaking the music streaming service's record at the time for the highest first-day streaming for a single track by a female artist.[209] The album's second single, \"Bon Appétit\" with Migos, was released that April.[210] Its third single, \"Swish Swish\", featured Nicki Minaj and followed the next month.[211] They respectively peaked at numbers 59 and 46 in the United States,[65] and made the top 15 in Canada.[67]\n\nThe album, titled Witness, was released on June 9, 2017, to mixed reviews,[212] and debuted at number one in the United States.[213] To accompany the album's release, Perry broadcast herself on YouTube for four days with a live-stream titled Katy Perry Live: Witness World Wide, concluding with a live concert on June 12.[214] The live-stream generated over 49 million views from 190 different countries.[215] She also embarked on Witness: The Tour, which began in September 2017 and ended in August 2018.[216] On June 15, 2017, Calvin Harris released a song titled \"Feels\" from his album Funk Wav Bounces Vol. 1, which featured Perry, Big Sean, and Pharrell Williams.[217] The song went on to reach number one in the United Kingdom.[218]\n\nPerry subsequently recorded a cover of the Dear Evan Hansen song \"Waving Through a Window\" for the deluxe edition of the cast recording, which was released on November 2, 2018.[219] The show's creators Benj Pasek and Justin Paul had requested Perry to cover the song to promote the musical's national tour and bring awareness to mental health.[220] Later that month, Perry released \"Cozy Little Christmas\".[221] She also recorded the song \"Immortal Flame\" for the game Final Fantasy Brave Exvius, and had a playable character modeled after her.[222]\n\nOutside of recording music, Perry appeared as herself in the film Zoolander 2, which was released in February 2016.[223][224] In February 2017, the singer launched a shoe line titled \"Katy Perry Collections\".[225] Her shoes are available on her website, Katy Perry Collections, and at retailers such as Dillard's and Walmart.[226] The following August, she hosted the 2017 MTV Video Music Awards.[227] Perry was signed for a $25-million salary to serve as a judge on ABC's revival of American Idol, which premiered in March 2018.[228][229] Perry began a relationship with Orlando Bloom in early 2016, and the couple got engaged on February 14, 2019.[230][231]\n\n2019–present: Smile, motherhood and Play residency\n\nAt the 61st Annual Grammy Awards, Perry performed \"Here You Come Again\", alongside Dolly Parton and Kacey Musgraves, as part of a tribute to Parton.[232] Four days later, she released a song called \"365\", with DJ Zedd.[233] In April, Perry was included on a remix of Daddy Yankee's song \"Con Calma\", featuring Snow.[234] She followed this with the singles \"Never Really Over\" on May 31, \"Small Talk\" on August 9, and \"Harleys in Hawaii\" on October 16.[235][236][237] \"Never Really Over\" in particular received critical acclaim.[238]\n\nIn June 2019, Perry appeared in the music video of Taylor Swift's \"You Need to Calm Down\".[239] In July, a jury in California passed a verdict following a week-long trial that Perry's song \"Dark Horse\" had copied Flame's 2008 song \"Joyful Noise\" after he filed a copyright lawsuit alleging that it used his track's beat without permission,[240] which was later overturned.[241] After the initial verdict, the jury ordered her to pay him $550,000.[242] The next month, Josh Kloss, Perry's co-star in the \"Teenage Dream\" music video, accused her of sexual misconduct.[243] In an Instagram post, Kloss alleged that, during a party at a skating rink, Perry pulled on his sweatpants and underwear, exposing his penis to her male friends. He also said her management prevented him from speaking about his time with the singer. However, Johnny Wujek, the creative director of said party defended Perry, saying that she \"would never do something like that\" and accused Kloss of having an \"ongoing obsession\" with her.[244] After initially refraining from responding to this, believing it would have detracted from the Me Too movement, Perry has also denied Kloss's claims.[245]\n\nFollowing the release of her single \"Never Worn White\" in March 2020, Perry revealed in the accompanying music video that she was expecting her first child with Bloom.[246] \"Daisies\", the lead single from her sixth album, was released on May 15, 2020. Its second single \"Smile\" followed two months later.[247][248] The album, also titled Smile, was released on August 28, 2020.[249][250] Two days before its distribution, she gave birth to a daughter named Daisy Dove Bloom.[251] The album received mixed reviews,[252] and debuted at number five in the United States.[253] Perry further promoted the album with four compilation EPs: Camp Katy,[254] Empowered,[255] Scorpio SZN,[256] and Cosmic Energy.[257] These EPs were followed by the single \"Not the End of the World\" in December 2020, which had a music video in which Zooey Deschanel impersonates Perry.[258][259][260] Additionally she collaborated with various artists to create two remixes of Smile album tracks. Tiësto remix of \"Resillient\" featuring Aitana was released in November 2020, while Bruno Martini remix of \"Cry About It Later\" featuring Luísa Sonza was released in April 2021.[261] In January 20, 2021, Perry performed \"Firework\" at the Celebrating America concert during the inauguration of Joe Biden.[262] Four months later, she released a new single, \"Electric\", a collaboration with Pokémon for their 25th anniversary.[263]\n\nPerry began hosting a residency named Play at Resorts World Las Vegas on December 29, 2021.[264] The show's inception happened during the COVID-19 lockdown with Perry being inspired by Honey, I Shrunk the Kids, Pee-wee's Playhouse, and Pee-wee's Big Adventure. She described it as \"larger than life\" and \"the kookiest, most camp show I've ever put together.\"[265] The show has received critical acclaim[266] with Melinda Sheckells of Billboard saying that \"[Play's] sold-out opening night is part fantasy, part hallucination and thoroughly camp.[267]\n\nIn September 2021, Variety paid tribute to and honored Perry on their \"Power of Women\" issue, where she discussed her career, motherhood, and philanthropy.[268] As a nominee, she attended the Variety 2021 \"Power of Women\" dinner.[269] On her 37th birthday the following month, Perry guest hosted The Ellen DeGeneres Show[270] and starred in a holiday advertisement for Gap Inc. which featured her singing \"All You Need Is Love\" by The Beatles. A full version of her cover was released on streaming platforms the same day.[271] Two months later, Perry followed this with \"When I'm Gone\", a collaboration with Alesso.[265]\n\nArtistry\n\nInfluences\n\nAlanis Morissette (left) and right) both heavily influenced Perry and her music. ) and Freddie Mercury ) both heavily influenced Perry and her music.\n\nPerry cites her sister Angela as the woman who has had the most influence on her.[268] During the early stages of her career, Perry's musical style gravitated towards gospel and she aspired to be as successful as Amy Grant.[272] At age 15, she heard \"Killer Queen\" by Queen, which inspired her to pursue a music career.[273] She cites the band's frontman, Freddie Mercury, as her biggest influence and expressed how the \"combination of his sarcastic approach to writing lyrics and his 'I don't give a fuck' attitude\" inspired her music.[274] She paid homage to the band by naming her third fragrance Killer Queen.[193] Perry described the Beach Boys and their album Pet Sounds as having a considerable influence on her music: \"Pet Sounds is one of my favorite records and it influenced pretty much all of my songwriting. All of the melody choices that I make are because of Pet Sounds.\"[275] The singer also holds the Beatles' album The Beatles in high esteem, and described these two albums as \"the only things I listened to for probably two years straight.\"[276]\n\nShe cites Alanis Morissette and her 1995 album Jagged Little Pill as a significant musical inspiration, stating in 2012: \"Jagged Little Pill was the most perfect female record ever made. There's a song for anyone on that record; I relate to all those songs. They're still so timeless.\" Additionally, Perry borrows influence from Flaming Red by Patty Griffin and 10 Cent Wings by Jonatha Brooke.[277] Perry's autobiographical documentary Katy Perry: Part of Me was largely influenced by Madonna: Truth or Dare. She admires Madonna's ability to reinvent herself, saying \"I want to evolve like Madonna\".[278]\n\nPerry names Björk as an influence, particularly admiring her \"willingness to always be taking chances\".[277] Other artists who Perry has cited as influences include Stevie Nicks,[279] ABBA, the Cardigans,[280] Cyndi Lauper,[281] Ace of Base, 3OH!3,[282] CeCe Peniston, C+C Music Factory, Black Box, Crystal Waters, Mariah Carey,[283] Heart, Joni Mitchell, Paul Simon, Imogen Heap, Rufus Wainwright,[284] Pink,[285] and Gwen Stefani.[277] \"Firework\" was inspired by a passage in the book On the Road by Jack Kerouac in which the author compares people who are full of life to fireworks that shoot across the sky and make people watch in awe.[286] Her second concert tour, the California Dreams Tour, was reminiscent of Alice's Adventures in Wonderland and The Wonderful Wizard of Oz.[287] She also credits the 1996 film The Craft for inspiring her song \"Dark Horse\",[288] and Eckhart Tolle's book The Power of Now for influencing Prism.[150]\n\nMusical style and themes\n\n\"When I am in between records, sometimes I doubt myself. I'll be like 'Did I just get lucky, or did I mass-manipulate the world into thinking that seven songs were worth a number-one position?' And then I go back into the studio and I start writing, and the true essential oil of who I am comes bubbling back up and reminds me that it's always been inside of me, that nobody can take this away no matter what comment anyone makes.\" —Perry on her confidence as a songwriter[289]\n\nWhile Perry's music incorporates pop, rock, and disco, Katy Hudson contains gospel. Her subsequent releases, One of the Boys and Teenage Dream, involve themes of sex and love. One of the Boys is a pop rock record, while Teenage Dream features disco influences.[290][291] Perry's fourth album, Prism, is significantly influenced by dance and pop music. Lyrically, the album addresses relationships, self-reflection, and everyday life.[292] Her fifth studio effort Witness is an electropop album that she described as a \"360-degree liberation\" record, with themes including political liberation, sexual liberation, and liberation from negativity.[293][294] Many of her songs, particularly on Teenage Dream, reflect on love between teenagers; W magazine described the album's sexual innuendos as \"irresistible hook-laden melodies\".[33] Self-empowerment is a common theme in Perry's music.[295]\n\nPerry has described herself as a \"singer-songwriter masquerading as a pop star\"[296] and maintains that honest songwriting is very important to her. She told Marie Claire: \"I feel like my secret magic trick that separates me from a lot of my peers is the bravery to be vulnerable and truthful and honest. I think you become more relatable when you're vulnerable.\"[17] Actress and comedian Kristen Wiig commented that \"as easy, breezy, and infectious as Perry's songs can be, beneath the surface lurks a sea of mixed emotions, jumbled motives, and contradictory impulses complicated enough to fill a Carole King record.\"[276] According to Greg Kot of the Chicago Tribune, \"being taken seriously may be Perry's greatest challenge yet.\"[297] In 2013, The New York Times labeled her \"the most potent pop star of the day – her hits are relatable with just a hint of experimentation\".[298] Randall Roberts of the Los Angeles Times criticized her use of idioms and metaphors in her lyrics and for frequent \"clichés\".[299] Throughout her career, Perry has also co-written songs recorded by other artists, including Lesley Roy,[300] Kelly Clarkson,[301] Jessie James Decker,[302] Selena Gomez & the Scene,[303][304] Britney Spears,[305] Iggy Azalea, Rita Ora,[306] Nicki Minaj, and Ariana Grande.[307]\n\nVoice\n\nPerry possesses a contralto vocal range.[308][309] Her singing has received both praise and criticism. Betty Clarke of The Guardian commented that her \"powerful voice is hard-edged\"[310] while Rob Sheffield from Rolling Stone described Perry's vocals on Teenage Dream as \"processed staccato blips\".[291] Darren Harvey of musicOMH compared Perry's vocals on One of the Boys to Alanis Morissette's, both possessing a \"perky voice shifting octaves mid-syllable\".[311] Alex Miller from NME felt that \"Perry's problem is often her voice\" on One of the Boys, stating that \"somewhere along the line someone convinced her she was like, well, a ballsy rock chick\".[312] Conversely, Bernadette McNulty from The Daily Telegraph praised her \"rock chick voice\" in a review of a concert promoting Prism.[313]\n\nPublic image\n\nPerry in her signature spinning peppermint swirl dress at the California Dreams Tour (2011)\n\nOn social media, Perry surpassed Justin Bieber as the most followed person on Twitter in November 2013.[314] She won the 2015 Guinness World Record for most Twitter followers,[315] and became the first person to gain 100 million followers on the site in June 2017.[316] Keith Caulfield of Billboard stated that Perry is \"the rare celebrity who seems to have enormous popularity but genuine ground-level interaction with her adoring KatyCats.\"[317] With over 108 Twitter million followers, she is the most followed female on the site, and the fifth most followed musician across social media with a combined total of over 326 million followers across Facebook, Instagram, and Twitter.[318] In June 2017, Time magazine listed Perry among its \"25 Most Influential People on the Internet\" of the year, writing that her live-stream for Witness was \"blazing a trail\" for being \"the closest any major entertainer has come to giving fans the kind of 'real' intimacy that social media purports to provide\".[319]\n\nIn 2011, Forbes ranked Perry third on their \"Top-Earning Women In Music\" list with earnings of $44 million[320] and fifth on their 2012 list with $45 million.[321] She subsequently ranked seventh on the 2013 Forbes list for \"Top-Earning Women In Music\" with $39 million earned,[322] and fifth on their 2014 list with $40 million.[323] With earnings of $135 million, Forbes also ranked Perry number one on their 2015 \"Top-Earning Women In Music\" list as well as the \"World's Highest-Paid Musicians\" and declared her the highest earning female celebrity in 2015, placing her at number 3 on the Forbes Celebrity 100 list.[324] In 2016, the magazine estimated her net worth was $125 million,[325] and ranked her number six on their list of \"Highest-Paid Women in Music\" with earnings of $41 million.[326] The following year, she was ranked number nine on the list with $33 million.[327] In 2018, she topped its \"Highest-Paid Women in Music\" listing and ranked at number four on the \"Highest-Paid Female Celebrities\" list with earnings of $83 million.[328][329] Perry subsequently was placed at number four on the 2019 \"Highest-Paid Women in Music\" listings with $57.5 million.[330] Later that year, with earnings of $530 million throughout the 2010s, the magazine also ranked her as the 9th highest earning musician of the decade.[331]\n\nFashion\n\nPerry has been described as a sex symbol; GQ labeled her a \"full-on male fantasy\",[11] while Elle wrote her body looked \"as though sketched by a teenage boy\".[24] Vice called her a \"'serious' popstar/woman/sex symbol\".[332] She was placed at number one on the Maxim Hot 100 in 2010 as the \"most beautiful woman in the world\", with editor Joe Levy describing her as a \"triple – no quadruple – kind of hot\".[333] Men's Health readers voted her the \"sexiest woman of 2013\".[334] In November 2010, Perry told Harper's Bazaar that she was proud of and satisfied with her figure.[335]\n\nPerry's fashion often incorporates humor, bright colors, and food-related themes[336] such as her characteristic spinning peppermint swirl dress.[337] Vogue described her as \"never exactly one to shy away from the outrageous or the extreme in any realm\", and called her the \"Queen of Camp\",[338][339] while Glamour named her the \"queen of quirk\".[340] In February 2009, Perry told Seventeen that her fashion style was \"a bit of a concoction of different things\" and stated she enjoyed humor in her clothing.[341] She has also described herself as having \"multipersonality disorder\" for fashion.[335] Perry lists Gwen Stefani, Shirley Manson, Chloë Sevigny, Daphne Guinness, Natalie Portman, and the fictional character Lolita as her style icons.[33][342] In 2022, Elle dubbed her as \"the kitsch-loving pop star renowned for her uniquely experimental style\", while Vogue described her style as \"synonymous with outrageous, eye-catching ensembles that lean towards the theatrical\".[343][344]\n\nDuring the 2017 launch of her shoe collection, Katy Perry Collections, she said about shoes: \"When I first got to L.A., I cultivated my style on a budget, always shopping at thrift stores or vintage stores. … Once, I found these flats that looked like Dalmatian dogs. They had ears that moved and a tongue that stuck out. They were such a conversation piece. That's what is so great about fashion. … It's a form of communication. You don't have to start a smoking habit to start talking to someone. You can just wear cool shoes. It's an icebreaker.\"[345]\n\nLegacy and influence\n\nSeveral media outlets such as Billboard and Glamour have referred to her as the \"Queen of Pop\", while Vogue has dubbed Perry the \"Queen of Camp\" and a \"pop icon.\"[346][347][339][344] Andrew Unterberger of Billboard described Teenage Dream \"one of the defining LPs from a new golden age in mega-pop\"[348] while Christopher Rosa of Glamour named her as an influence to the pop sound and style of the 2010s, adding that her singles are \"some of the most recognizable, iconic, and impactful hits in pop history.\"[349] Perry was named \"one of the last decade's most reliable and successful hitmakers\" by the Official Charts Company in 2022.[350]\n\nAdditionally, Perry was included in Glamour's \"104 Women Who Defined the [2010s] in Pop Culture\" list, saying: \"[Perry] did more than just break chart records. She was one of the driving forces behind the sound of pop radio in the 2010s. [...] glossy, booming, sugary-sweet, and undeniably catchy.\"[349][351] Variety included Perry in their Variety 500 list of the most influential business leaders, calling her a \"global phenomenon\" and a \"dedicated artist and tireless self-promoter who has leveraged chart-topping hits, sold-out stadium shows, and staggering endorsement deals to become one of the richest and most influential pop stars alive.\"[352] She has been called a \"gay icon\" by Taylor Henderson of Out, noting how \"I Kissed a Girl\" helped fans explore their sexuality and how Perry openly embraced the LGBTQ+ community.[265]\n\nPerry's music has been described by Out as having a \"lasting legacy\", with American singers Fletcher sampling \"I Kissed a Girl\" and Olivia Rodrigo referencing Teenage Dream on \"Brutal\".[265] Additionally, other artists such as Halsey and Ariana Grande have praised Perry's work, with Halsey calling Teenage Dream the \"perfect pop album\" and Grande saying \"The One That Got Away\" is \"one of the biggest and most perfectly written pop songs ever from one of the best pop albums of all time.\"[353][354] Perry and her work have influenced artists such as Lil Nas X,[355] Halsey,[354] BTS,[356] Adele,[357] Lorde,[358] Sia,[359] Bonnie McKee,[360] Rina Sawayama,[361][362] Doja Cat,[363] Ellie Goulding,[364] Tegan and Sara,[365] Jessie J,[366] Marina Diamandis,[367] John Mayer,[368] Jason Derulo,[369] Lil B,[370] Little Mix,[371] Natalia Kills,[372] Maren Morris,[373] Hayley Kiyoko,[374] Troye Sivan,[375] Kim Petras,[376] Yungblud,[377] Mary Lambert,[378] Issues,[379] Rebecca Black,[380] The Lonely Island,[381] Tramp Stamps,[382] Baba Sehgal,[383] Grace VanderWaal,[384] and Coldplay.[385]\n\nOther ventures\n\nPhilanthropy\n\nPerry became a UNICEF Goodwill Ambassador in December 2013.\n\nPerry has supported various charitable organizations and causes throughout her career. She has contributed to organizations aimed at improving the lives and welfare of children in particular. In April 2013, she joined UNICEF to assist children in Madagascar with education and nutrition.[386] On December 3, 2013, she was officially named a UNICEF Goodwill Ambassador, \"with a special focus on engaging young people in the agency's work to improve the lives of the world's most vulnerable children and adolescents.\"[387] She arranged for a portion of the money generated from tickets to her Prismatic World Tour to go to UNICEF.[388] In September 2010, she helped build and design the Boys Hope/Girls Hope foundation shelter for youth in Baltimore, Maryland along with Raven-Symoné, Shaquille O'Neal, and the cast of Extreme Makeover: Home Edition.[389] In 2010, Perry and Nicki Minaj performed a cover of \"Girls Just Wanna Have Fun\" for service members during the 2010 VH1 Divas Salute the Troops concert.[390]\n\nShe has also supported children's education and well-being. All profits from sales of the album The Gay Nineties Old Tyme Music: Daisy Bell, which includes her rendition of \"Daisy Bell (Bicycle Built for Two)\", were donated to the charity Little Kids Rock, which supports musical education in underprivileged elementary schools.[183] In June 2014, she teamed up with Staples Inc. for a project entitled \"Make Roar Happen\" which donated $1 million to DonorsChoose, an organization that supports teachers and funds classroom resources in public schools.[391] In May 2016, she worked with UNICEF to improve child care quality in Vietnam, hoping to \"break the cycle of poverty and drastically improve children's health, education and well-being\".[392] The following month, UNICEF announced that Perry would receive the Audrey Hepburn Humanitarian Award \"for her work as a UNICEF Goodwill Ambassador in support of the world's most vulnerable children\" at their annual Snowflake Ball in November.[393] All Spotify streams of her 2021 cover of \"All You Need Is Love\" will generate $1 in donations for the charity Baby2Baby.[271]\n\nright) performing for service members during the 2010 VH1 Divas Salute the Troops concert Perry and Nicki Minaj ) performing for service members during the 2010 VH1 Divas Salute the Troops concert\n\nPerry has supported organizations aimed at aiding people suffering with diseases including cancer and HIV/AIDS. During the 2008 Warped Tour, she had a cast made of her breasts to raise money for the Keep A Breast Foundation.[394] She hosted and performed at the We Can Survive concert along with Bonnie McKee, Kacey Musgraves, Sara Bareilles, Ellie Goulding, and duo Tegan and Sara at the Hollywood Bowl in Los Angeles, California, on October 23, 2013. The concert's profits were donated to Young Survival Coalition, an organization aiding breast cancer in young women.[395] In June 2009, she designed an item of clothing for H&M's \"Fashion Against AIDS\" campaign, which raises money for HIV/AIDS awareness projects.[396] On February 26, 2017, she served as a co-chair alongside various celebrities such as Beyoncé, Lea Michele, Jim Carrey, Jared Leto, and Kevin Spacey for the 25th Annual Elton John AIDS Foundation Academy Award Party, a fundraiser for HIV/AIDS healthcare.[397]\n\nThe proceeds from Perry's single \"Part of Me\" were donated to the charity MusiCares, which helps musicians in times of need.[398] During her California Dreams Tour, she raised over $175,000 for the Tickets-For-Charity fundraiser. The money was divided between three charities: the Children's Health Fund (CHF), Generosity Water, and The Humane Society of the United States.[399]\n\nOn her 27th birthday, Perry set up a donations page for the Society for the Prevention of Cruelty to Animals Auckland,[400] and set up a similar page benefiting the David Lynch Foundation for her 28th birthday.[401] On March 29, 2014, she helped raise $2.4 million for the Museum of Contemporary Art in Los Angeles along with other celebrities such as Ryan Seacrest, Pharrell Williams, Tim Allen, Lisa Edelstein, and Riley Keough.[402]\n\nPerry performed at the One Love Manchester benefit concert for the victims of the 2017 Manchester Arena bombing, among various performers including its organizer Ariana Grande, which was broadcast live on June 4, 2017, on radio and television stations around the world.[403] In March 2018, Perry announced Witness: Coming Home, a benefit concert that was held in her hometown of Santa Barbara on May 19, 2018. The concert benefited those recovering from the aftermath of the 2017 California wildfires and 2018 Southern California mudflows. Perry partnered with the Santa Barbara Foundation, the 93108 Fund and The 805 UndocuFund, organizations which help in assisting members of the community in the Santa Barbara area through grants and various philanthropic efforts.[404]\n\nActivism\n\nPerry has publicly advocated for LGBT rights and admitted that she wrote \"I Kissed a Girl\" about her own bisexual experiences with other women. In 2017, she received a Nation Equality Award from Human Rights Campaign for \"using her powerful voice and international platform to speak out for LGBTQ equality\".[405] In her acceptance speech, she discussed having bisexual experiences, her fluid sexuality, and thanked the LGBTQ+ community.[406] In an Out interview in 2021, she was heralded as a \"gay icon\" with \"I Kissed a Girl\" being called a \"bonafide queer anthem.\" She continued to thank the LGBTQ+ community in the same interview, saying: \"I came from a very sheltered upbringing where it wasn't okay to be friends with anyone from that community. And now that is my community, [...] I wouldn't have survived without the community and it's amazing how full circle it's come and how much growth has happened since I started.\"[265]\n\nShe supported Stonewall during their \"It gets better..... today\" campaign to prevent homophobic bullying,[407] and dedicated the music video to her song \"Firework\" to the It Gets Better Project.[408] In 2008, Perry told Do Something she was proud to be a LGBT rights activist, saying \"I've always been a very open-minded person, but I definitely believe in equality.\" In June 2012, Perry expressed her hopes for LGBT equality, commenting \"hopefully, we will look back at this moment and think like we do now concerning [other] civil rights issues. We'll just shake our heads in disbelief, saying, 'Thank God we've evolved.' That would be my prayer for the future.\"[409] In December 2012, Perry was awarded the Trevor Hero Award by The Trevor Project for her work and activism on behalf of LGBT youth.[410]\n\nPerry identifies as a feminist,[411] and appeared in April 2013 in a video clip for the \"Chime for Change\" campaign that aimed to spread female empowerment.[412] She has also said that America's lack of free health care drove her \"absolutely crazy\".[413] Following the shooting at the Pulse nightclub in Orlando in June 2016, Perry and nearly 200 other artists and executives in music signed an open letter organized by Billboard addressed to United States Congress demanding increased gun control in the United States.[414]\n\nThrough Twitter and by performing at rallies, Perry supported President Barack Obama in his run for re-election and praised his support for same-sex marriage[415] and LGBT equality.[416] She performed at three rallies for Obama, in Los Angeles, Las Vegas, and Wisconsin, singing a rendition of \"Let's Stay Together\" as well as a number of her songs. During her Las Vegas performance she wore a dress made to replicate a voting ballot, with Obama's box filled in.[417] On Twitter, she encouraged her followers to vote for Obama.[418]\n\nIn August 2013, Perry voiced criticism of Tony Abbott, then-leader of conservative Liberal Party of Australia and candidate for Prime Minister of Australia, due to his opposition to gay marriage and told Abbott, \"I love you as a human being but I can't give you my vote.\"; the statement came after Abbott expressed pride at learning of Perry's then-upcoming performance in Australia.[419] In April 2014, she publicly supported Marianne Williamson in her campaign for California's 33rd congressional district by attending a political press event.[420] She endorsed Kamala Harris in the United States Senate election in California, and organized a fundraiser for Harris at her home in Los Angeles in November 2016.[421] Perry also publicly endorsed former Secretary of State Hillary Clinton for president in 2016.[422][423] She performed alongside Elton John at a fundraising concert for Clinton in New York City in March 2016.[424] Perry also spoke and performed at the 2016 Democratic National Convention in support of Clinton.[425] Four years later, she supported Joe Biden and Kamala Harris during the 2020 United States presidential election, praising the latter as a leader who had \"experience we desperately need right now\" and believed that the former \"choosing her as his running mate is already a testament to his decision making\".[426]\n\nAchievements\n\nThroughout her career, Perry has won five American Music Awards,[427] fourteen People's Choice Awards,[428] four Guinness World Records,[84][109][179][315] a Brit Award,[75] and a Juno Award.[101] In September 2012, Billboard dubbed her the \"Woman of the Year\".[144] From May 2010 to September 2011, the singer spent a record-breaking 69 consecutive weeks in the top ten of the Billboard Hot 100.[110][429] Teenage Dream became the first album by a female artist to produce five number-one Billboard Hot 100 singles, and the second album overall after Michael Jackson's Bad.[107] In the United States, she has accumulated nine number-one singles on the Billboard Hot 100, her most recent being \"Dark Horse\",[167] and holds the record for having 18 consecutive number-one songs on the Billboard Dance Club Songs chart.[430]\n\nBillboard also named her the 15th most successful dance club artist of all time.[431] The magazine additionally ranked her 4th on its \"Greatest of All Time Pop Songs Artists\" list,[432] included Teenage Dream and Prism among its \"Greatest of All Time Billboard 200 Albums by Women\" list,[433] and ranked \"Dark Horse\" at number 100 on its \"Greatest of All Time Hot 100 Songs\"[434] as well as one of its \"Greatest of All Time Hot 100 Songs by Women\" along with \"E.T.\", \"Firework\", and \"California Gurls\".[435] In June 2015, her music video for \"Dark Horse\" became the first video by a female artist to reach 1 billion views on Vevo.[436][437] The following month, her music video for \"Roar\" reached 1 billion views on Vevo, making her the first artist to have multiple videos with 1 billion views.[438]\n\nPerry was declared the Top Global Female Recording Artist of 2013 by the International Federation of the Phonographic Industry (IFPI).[180] According to Recording Industry Association of America (RIAA), she is the fifth top digital singles artist in the United States, with 105 million certified song units in the country including on-demand streams[439] and also has 11 million certified album units, totaling 116 million certified units in the nation.[440] She also became the first artist to have three songs receive Diamond certifications from the RIAA with \"Dark Horse\", \"Firework\", and \"Roar\".[441] All three of them and \"E.T.\", \"California Gurls\", and \"Hot n Cold\" have each sold over 5 million digital copies.[442] Throughout her career, Perry has sold more than 18 million albums and 125 million singles globally,[443] making her one of the best-selling music artists of all time.[444]\n\nDiscography\n\nFilmography\n\nTours and residency\n\nCo-headlining tour\n\nStrangely Normal Tour (with Phil Joel) (2001)\n\nHeadlining tours\n\nResidency\n\nSee also\n\nReferences", "images": ["http://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Freddie_Mercury_performing_in_New_Haven%2C_CT%2C_November_1977.jpg/140px-Freddie_Mercury_performing_in_New_Haven%2C_CT%2C_November_1977.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/52/Katy_Perry_performing_Vegas_residency_%28cropped%29.png/220px-Katy_Perry_performing_Vegas_residency_%28cropped%29.png", "http://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Cscr-featured.svg/20px-Cscr-featured.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Katy_Perry_UNICEF_2012.jpg/170px-Katy_Perry_UNICEF_2012.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Katy_Perry_performing.jpg/170px-Katy_Perry_performing.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Audio-input-microphone.png/28px-Audio-input-microphone.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Katy_Perry_-_The_Prismatic_%28Sunrise%29_01_%28cropped%29.jpg/170px-Katy_Perry_-_The_Prismatic_%28Sunrise%29_01_%28cropped%29.jpg", "http://en.wikipedia.org/static/images/footer/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/28px-P_vip.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/86/Katy_Perry_2011.jpg/170px-Katy_Perry_2011.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Katy_Perry_and_Nicki_Minaj_%28cropped%29.jpg/185px-Katy_Perry_and_Nicki_Minaj_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Katy_Perry_at_Madison_Square_Garden_%2837436531092%29_%28cropped%29.jpg/170px-Katy_Perry_at_Madison_Square_Garden_%2837436531092%29_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Katy_Perry_-_Part_Of_Me_Australian_Premiere_-_June_2012_%283%29.jpg/170px-Katy_Perry_-_Part_Of_Me_Australian_Premiere_-_June_2012_%283%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/97/Katy_Perry_Hillary_Clinton%2C_I%27m_With_Her_Concert.jpg/170px-Katy_Perry_Hillary_Clinton%2C_I%27m_With_Her_Concert.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/5/52/Katy_Perry_performing_Vegas_residency_%28cropped%29.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/82/Alanis_Morissette_5-19-2014.jpg/145px-Alanis_Morissette_5-19-2014.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/32px-Flag_of_the_United_States.svg.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Katy_Perry_%40B96_Radio_Jingle_Bash_1996_in_Chicago_%28cropped%29.jpg/170px-Katy_Perry_%40B96_Radio_Jingle_Bash_1996_in_Chicago_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Katy_Perry_%2815262665623%29.jpg/170px-Katy_Perry_%2815262665623%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/5/52/Katy_Perry_performing_Vegas_residency_%28cropped%29.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Katy_Perry", "title": "Katy Perry", "meta_data": {"generator": "MediaWiki 1.38.0-wmf.25", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/5/52/Katy_Perry_performing_Vegas_residency_%28cropped%29.png", "width": 640, "height": 960}, "title": "Katy Perry - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}