{"url": "https://en.wikipedia.org/wiki/Better_Call_Saul", "text": "American crime drama television series\n\nBetter Call Saul is an American crime drama television series created by Vince Gilligan and Peter Gould. It is a spin-off, prequel, and a sequel to Gilligan's previous series, Breaking Bad. Set primarily in the early to middle part of the 2000s in Albuquerque, New Mexico, the series develops Jimmy McGill (Bob Odenkirk), an earnest lawyer and former con artist, into an egocentric criminal defense attorney known as Saul Goodman. Also shown is the moral decline of retired police officer Mike Ehrmantraut (Jonathan Banks), who becomes closely affiliated with the Juarez drug cartel to support his granddaughter and her widowed mother. Jimmy and Mike's interactions remain sporadic until their respective storylines fully converge. The show premiered on AMC on February 8, 2015, airing five seasons to date. A sixth and final season, consisting of 13 episodes, is set to premiere on April 18, 2022.\n\nAt the start of the series, Jimmy struggles financially while working as a public defender. He lives in the back room of a nail salon which doubles as an office. His romantic interest and former colleague, Kim Wexler (Rhea Seehorn), is an attorney at Hamlin, Hamlin & McGill (HHM), a law firm co-owned by Jimmy's brilliant but unwell brother, Chuck McGill (Michael McKean) and proud associate, Howard Hamlin (Patrick Fabian). After hiring Jimmy as legal representation, Mike provides advice and security for Nacho Varga (Michael Mando), an intelligent drug dealer who later becomes a mole for Gus Fring (Giancarlo Esposito), a drug lord and legitimate businessman. Their operations are disrupted by members of the murderous Salamanca family, including Lalo Salamanca (Tony Dalton). Odenkirk, Banks, and Esposito reprise their roles from Breaking Bad, as do many others who make guest appearances.\n\nBetter Call Saul has received critical acclaim, with particular praise for its acting, characters, writing, direction, and cinematography; many critics have called it a worthy successor to Breaking Bad and one of the best prequels ever made, with some deeming it superior to its predecessor.[5][6][7] It has garnered many nominations, including a Peabody Award, 21 Primetime Emmy Awards, eleven Writers Guild of America Awards, five Critics' Choice Television Awards, four Screen Actors Guild Awards, and four Golden Globe Awards. At the time of its airing, the series premiere held the record for the highest-rated scripted series premiere in basic cable history.\n\nPremise [ edit ]\n\nBetter Call Saul follows the transformation of James \"Jimmy\" McGill (Bob Odenkirk), a former con artist who is trying to become a respectable lawyer, into the personality of the flamboyant criminal lawyer Saul Goodman (a play on the phrase \"[it]'s all good, man!\"), over the six-year period prior to the events of Breaking Bad, spanning from approximately 2002 to 2008.[8][9]\n\nJimmy is inspired by his older brother Chuck McGill (Michael McKean) to leave his Chicago-area conman past, when he was known as \"Slippin' Jimmy\". He initially works in the mailroom at his brother's Albuquerque law firm, Hamlin, Hamlin & McGill (HHM), where managing partner Howard Hamlin (Patrick Fabian) becomes his nemesis. While at HHM Jimmy befriends Kim Wexler (Rhea Seehorn), a fellow mailroom employee who completes law school and becomes one of the firm's associates, and their friendship later turns romantic. Jimmy is motivated by Chuck's success to finish college and complete a Juris Doctor degree through a correspondence law school, The University of American Samoa.[a]\n\nAfter attaining admission to the bar but being denied employment at HHM, Jimmy's pursuits focus on low paying clients including working as a public defender. He later begins to build a practice in elder law, which leads to a prolonged lawsuit against a nursing home chain he discovers is defrauding its clients. Jimmy's life and career begin to intersect with the illegal narcotics trade and feature characters and story arcs that continue into Breaking Bad. These arcs include the uneasy truce between the Salamanca family that serves the Juárez Cartel drug interest, led first by Hector Salamanca (Mark Margolis) and later by his nephew Lalo (Tony Dalton), and Gus Fring (Giancarlo Esposito), a fried chicken entrepreneur whose restaurant chain is a front for the drug trade. Those caught up in the ensuing turmoil include Ignacio \"Nacho\" Varga (Michael Mando), a Salamanca associate who wants to protect his father from harm, and Mike Ehrmantraut (Jonathan Banks), a former Philadelphia police officer who becomes a fixer for Gus. As his interactions with criminals continue, Jimmy takes on the persona of the flamboyant, colorful Saul Goodman, and he starts to draw on his conman past while his work as an attorney goes from questionable to unethical to illegal.\n\nThe show includes flash-forwards to the events following Breaking Bad at the start of each season's premiere. These scenes show Jimmy living as a fugitive under the identity Gene Takavic, the manager of a Cinnabon store in Omaha, Nebraska.\n\nProduction [ edit ]\n\nConception [ edit ]\n\nBetter Call Saul was developed and co-showrun by was developed and co-showrun by Vince Gilligan (left) and Peter Gould (right). Gould took over as sole showrunner after Gilligan left the writing staff during the third season.\n\nVince Gilligan and Peter Gould began planning a television spinoff of Breaking Bad as early as 2009. While filming the Breaking Bad episode \"Full Measure\", Gilligan asked Bob Odenkirk his thoughts on a Saul Goodman spinoff.[11] In July 2012, Gilligan publicly hinted at a Goodman spinoff,[12] stating that he liked \"the idea of a lawyer show in which the main lawyer will do anything it takes to stay out of court\", including settling on the courthouse steps.[13] During his appearance on Talking Bad, Odenkirk noted that Saul was one of the most popular characters on the show, speculating that the audience likes the character because he is \"the program's least hypocritical figure\", and \"is good at his job\".[14]\n\nGilligan noted that over the course of Breaking Bad, there were a lot of \"what ifs” their team considered, such as if the show won a Primetime Emmy Award, or if people would buy \"Los Pollos Hermanos\" T-shirts. The staff did not expect these events to come to fruition, but after they did, they started considering a spin-off featuring Saul as a thought experiment. Furthermore, Saul's character on Breaking Bad became much more developed than the staff had planned, as he was originally slated to appear in only three episodes. With the growth of Saul's character, Gilligan saw ways to explore the character further.[15]\n\nDevelopment [ edit ]\n\nIn April 2013, Better Call Saul was confirmed to be in development by Gilligan and Gould; the latter wrote the Breaking Bad episode that introduced the character.[16][17] In July 2013, before the second half of Breaking Bad's final season aired, Gilligan said he and Gould were still working out ideas for the spin-off, but a deal had not yet been made.[18] Netflix was one of many interested distributors, but ultimately a deal was made between AMC and Breaking Bad production company Sony Pictures Television.[19] Gilligan and Gould began as co-showrunners, and Gilligan directed the pilot.[20] Former Breaking Bad writers Thomas Schnauz and Gennifer Hutchison joined the writing staff, with Schnauz serving as co-executive producer and Hutchison as supervising producer.[21] Also joining the initial writing staff were Bradley Paul and former Breaking Bad writer's assistant Gordon Smith.[20]\n\nAs Sony and AMC began to commit to a spinoff, Gilligan and Gould worked on what it would be about. They initially considered making it a half-hour show where Saul would see various clients – celebrities in guest roles – in his strip mall office, a format similar to Dr. Katz, Professional Therapist, but they had no idea how to write for this type of format, and fell back to planning for hour-long episodes.[22][16][13] Since they had used this format with Breaking Bad, which Gilligan said was \"25-percent humor, 75-percent drama\", the two considered reversing that for Better Call Saul.[22] While the intent was to add more humor, the show remained heavy with dramatic elements, with Odenkirk calling the first season \"85 percent drama, 15 percent comedy.\"[23] Additionally, while several of the characters are lawyers in the show, Gilligan and Gould did not want to write a legal show, but instead a crime show, but one that would necessitate some legal elements. To help in these areas, the writers spoke to real lawyers and spent time observing cases at Los Angeles Superior Court, observing that the bulk of the activity in these cases was downtime while waiting for others to complete actions.[24]\n\nGilligan and Gould found that the character of Saul Goodman was insufficient to carry the show by himself, with Gilligan calling the character of Saul \"great flavoring\" for a show but not the substance.[22] They came to realize that Saul, in the Breaking Bad timeframe, was a man that had come to accept himself, and recognized the potential of telling the story of how Saul got to be that person.[22] Gilligan and Gould had already committed to the Better Call Saul title, so that in following this route, they believed they had to quickly get from Jimmy McGill to Saul Goodman, or they would otherwise disappoint their audience. However, as they wrote the show, they realized \"we don't want to get to Saul Goodman … and that's the tragedy\".[22] Gilligan and Gould had learned several lessons related to foreshadowing without writing the foresight for it from Breaking Bad,[25] and so with Better Call Saul, gave themselves more flexibility in how the show's plot would develop over its run, and had no firm idea where it will end up outside the connection to Breaking Bad.[22] For example, Rhea Seehorn's performance as Kim Wexler during the first season significantly altered how the writers used her character in later seasons as well as slowing down the pacing of the transition of Jimmy into Saul, as they gave more focus to the Jimmy–Kim relationship. Gilligan compared this to the impact Aaron Paul's acting had on Breaking Bad's ultimate pacing.[26]\n\nIn writing for Better Call Saul, Gilligan and Gould recognized they were including overlaps with Breaking Bad, and had ideas of characters they would include, such as Gus Fring, though on no set timetable within the show's development. Gilligan described the writing approach as if developing two separate shows, one that centers on Jimmy/Saul, Kim, Chuck, and Howard, and a second on the more familiar Breaking Bad characters like Mike and Gus with some overlap, as if they were giving the audience two shows for one.[22] Where possible, they had written in minor Breaking Bad characters in smaller parts or as Easter eggs to fans, but Gilligan preferred only to include such major Breaking Bad characters as Walter or Jesse if this seemed unconstrained and satisfactory to both the production team and the audiences.[22] Because of the closeness to the Breaking Bad storyline, one of the writers was tasked at the start of each season to rewatch all 62 episodes of the show and verify that the scripts for the Better Call Saul season introduced no conflicts.[27]\n\nGould became Better Call Saul's sole showrunner after Gilligan left the writing staff early in the third season to focus on other projects. While this transition had been planned since the show's debut, Gilligan hoped to return to the writers room during the show's final season.[28] He remained involved in the fourth and fifth seasons, but said he had very little to do with developing the show's contents during this period.[29] Instead, Gilligan reduced his role to being a \"director for hire\" for the episodes \"Wiedersehen\" and \"Bagman\", and stated these were the only scripts he read when he was not on the writing staff.[29][30][31] He went on to credit Gould for maintaining the series' high quality.[29] Gould would bring Gilligan back to the writers room for the sixth and final season, calling it \"wonderful to have him there, so we can finish this show that we started together.\"[32]\n\nCasting [ edit ]\n\nBob Odenkirk stars as lawyer Jimmy McGill (known as Saul Goodman in Breaking Bad). In January 2014, it was announced that Jonathan Banks would reprise his Breaking Bad role as Mike Ehrmantraut and be a series regular.[33]\n\nNew cast members include Michael McKean as McGill's elder brother Chuck. McKean previously guest-starred in an episode of Odenkirk's Mr. Show and Gilligan's X-Files episode \"Dreamland\".[34][35] The cast also includes Patrick Fabian as Howard Hamlin, Rhea Seehorn as Kimberly \"Kim\" Wexler, and Michael Mando as Ignacio \"Nacho\" Varga.[36] In October 2014, Kerry Condon was cast[37] as Stacey Ehrmantraut, Mike's daughter-in-law. In November 2014, it was announced that Julie Ann Emery and Jeremy Shamos had been cast as Betsy and Craig Kettleman, described as \"the world's squarest outlaws.\"[38]\n\nGoing into Season 3, it was announced that Giancarlo Esposito would return to play his Breaking Bad character Gus Fring.[39]\n\nTony Dalton was announced as Lalo Salamanca for Season 4;[40] Lalo had been a character mentioned only by name, alongside Nacho, in the Breaking Bad episode \"Better Call Saul\".[41]\n\nDean Norris, another Breaking Bad alumnus, stated he could not be part of the earlier seasons, partly due to his involvement in the CBS series Under the Dome,[42] but was announced as a guest star reprising his role as Hank Schrader by Season 5.[43]\n\nOther Breaking Bad actors have spoken of the potential of being on Better Call Saul. Both Bryan Cranston and Aaron Paul regularly said throughout the series run that if asked, they would be open to reappearing on the show as Walter White and Jesse Pinkman, respectively, believing that Gilligan would have a sufficiently good reason to bring them in.[44][45] Paul had previously mentioned the possibility of a cameo during Season 1 but this fell through.[46][47] Anna Gunn also mentioned a \"talk\" with Gilligan over possible guest appearances as Skyler White.[48] Plans were initially made to have Betsy Brandt reprise her role as Marie Schrader for a cameo appearance in the season 2 finale \"Klick\", but the writer's room objected, considering the idea to be distracting for audiences.[49] Gilligan said that by Season 3 that the show had been on long enough that any reuse of Breaking Bad characters would require more than \"just a cameo or an Alfred Hitchcock walkthrough\", and that their appearances would need to be essential to the story.[44] Bill Burr revealed on The Rich Eisen Show in 2019 that plans were made for him to reprise his role as Patrick Kuby, but scheduling fell through due to him needing to attend to a personal matter.[50]\n\nFilming and production [ edit ]\n\n(top) and the Old Bernalillo County Courthouse (bottom). The series is shot in Albuquerque, New Mexico. Shooting locations include Cottonwood Mall and the Old Bernalillo County Courthouse\n\nLike its predecessor, Better Call Saul is set and filmed primarily in and around Albuquerque, New Mexico.[51] Notable locations include the Twisters restaurant used previously in Breaking Bad for Gus's Los Pollos Hermanos, a parking lot kiosk at the Albuquerque Convention Center for where Mike worked in the first few seasons, the Old Bernalillo County Courthouse as the local courthouse, and two nearby office buildings in the North Valley, including Northrop Grumman's, that collectively are used for the HHM office spaces. Jimmy's back office is located in an actual nail salon, which the producers accommodated by working with the owners, while the Salamanca's restaurant is also a real business in the South Valley that production modified a bit for the show, but which otherwise remained open. The scenes set in Omaha are actually filmed at Cottonwood Mall in Albuquerque; production worked with Cinnabon to bring in the period-specific equipment and service items for the segments, and the extras in the store during these scenes are Cinnabon employees.[52] Additional filming took place at Albuquerque Studios.[53] The New Mexico Film Office reported that the first four seasons of Better Call Saul had brought in over US$120 million into the state, and has hired 1,600 crew for each season and a cumulative 11,300 extras.[54]\n\nFilming for the pilot started on June 2, 2014.[55]\n\nBetter Call Saul also employs Breaking Bad's signature time jumps.[56] Notably, each season's opening episode has started with a black and white flash-forward to a period in the years after the finale of Breaking Bad where Saul has been relocated to Omaha, Nebraska, as \"Gene\", a manager of a Cinnabon store, remaining paranoid about anyone discovering his past identity. This was foreshadowed in the penultimate episode of Breaking Bad, \"Granite State\", in which Saul tells Walter: \"If I'm lucky, a month from now, best-case scenario, I'm managing a Cinnabon in Omaha.\"[57]\n\nFilming for the sixth and final season began on March 10, 2021.[58] In addition to production delays related to COVID-19, filming was further delayed when star Bob Odenkirk collapsed on set due to a heart-related incident, though he has since fully recovered.[59] The final season wrapped filming on February 9, 2022.[60]\n\nBroadcast and marketing [ edit ]\n\nThe first teaser trailer debuted on AMC on August 10, 2014, and confirmed its premiere date of February 2015.[61] In November 2014, AMC announced the series would have a two-night premiere; the first episode aired on Sunday, February 8, 2015, at 10:00 pm (ET), and then moved into its regular time slot the following night, airing Mondays at 10:00 pm.[62]\n\nIn June 2014, prior to the series' launch, AMC had renewed the series for a second season of 13 episodes to premiere in early 2016;[20] however, it was later reduced to 10 episodes.[63] In May 2015, Gilligan confirmed that more of the prominent characters from Breaking Bad would be making guest appearances in season 2, but remained vague on which characters were likely to be seen.[64] The second season premiered on February 15, 2016.[65]\n\nIn March 2016, AMC announced that Better Call Saul was renewed for a 10-episode third season which premiered April 10, 2017.[66][67] Following the season's end in June 2017, AMC renewed the series for a 10-episode fourth season which premiered on August 6, 2018.[68][69]\n\nThe series was renewed for a fifth season on July 28, 2018, just prior to the airing of the fourth season.[70] The fifth season was not expected to air until 2020; according to AMC's Sarah Barnett, the delay was \"driven by talent needs\".[71] Filming for the fifth season started in April 2019, and finished in September 2019.[72][73] AMC later affirmed the ten-episode fifth season will start airing with a special Sunday broadcast on February 23, 2020, with following episodes to air on Mondays.[74]\n\nIn January 2020, AMC renewed the series for a sixth season.[75] Gould confirmed it will be the show's final season, and will consist of 13 episodes rather than the usual 10. This will bring the show's final episode count to 63, equal to the combined total of Breaking Bad's number of episodes and El Camino. Gould stated: \"From the beginning when we started this, I think all our hopes and dreams were to be able to tell the whole story ... and make it to be a complete story from beginning to end. We're going to try like hell to stick the landing of these 63 episodes\".[76] The final season will be split into two halves, with the first seven episodes to air from April 18, 2022, and the last six episodes to air beginning July 11, 2022.[77] The reasoning for the split is to nominate each half of the season for different Emmy ceremonies, as the first half would be eligible for the 2022 Emmy Awards, while eligibility for the next year's ceremony begins in June.[78]\n\nCast and characters [ edit ]\n\nMain cast [ edit ]\n\nRecurring cast [ edit ]\n\nIntroduced in season 1 [ edit ]\n\nIntroduced in season 2 [ edit ]\n\nEd Begley Jr. as Clifford Main, managing partner at Davis & Main where Jimmy worked during season two\n\nOmar Maskati as Omar, Jimmy's assistant at Davis & Main\n\nJessie Ennis as Erin Brill, a lawyer at Davis & Main who is ordered to shadow Jimmy\n\nJuan Carlos Cantu as Manuel Varga, Nacho's father who owns an upholstery shop\n\nVincent Fuentes as Arturo Colon, a criminal associate of Hector Salamanca (seasons 2–4)\n\nRex Linn as Kevin Wachtell, chairman of Mesa Verde Bank and Trust and a client of HHM and Kim\n\nCara Pifko as Paige Novick, senior legal counsel for Mesa Verde Bank and Trust and a friend of Kim\n\nAnn Cusack as Rebecca Bois, Chuck's ex-wife\n\nManuel Uriza as Ximenez Lecerda, an associate of Hector Salamanca\n\nHayley Holmes as Make-Up Girl (later Drama Girl), one of the three University of New Mexico film students Jimmy hires for various projects\n\nIntroduced in season 3 [ edit ]\n\nBonnie Bartlett as Helen, Irene's friend and member of the affected class in the Sandpiper lawsuit\n\nKimberly Hebert Gregory as Assistant District Attorney Kyra Hay\n\nTamara Tunie as Anita, a member of Mike and Stacey's support group\n\nIntroduced in season 4 [ edit ]\n\nRainer Bock as Werner Ziegler, an engineer hired by Gus to plan and oversee construction of his meth \"superlab\"\n\nBen Bela Böhm as Kai, a rebellious member of the crew Werner Ziegler assembles for the construction of Gus's meth \"superlab\" (seasons 4–5)\n\nStefan Kapičić as Casper, a member of Werner Ziegler's team (seasons 4–5)\n\nPoorna Jagannathan as Maureen Bruckner, a specialist from Johns Hopkins who flew to Albuquerque to treat Hector after Gus arranged for a \"generous grant\"\n\nIntroduced in season 5 [ edit ]\n\nSasha Feldman and Morgan Krantz as Sticky and Ron, two petty crooks who are among \"Saul Goodman\" 's first clients\n\nfirst clients Barry Corbin as Everett Acker, an old man living on leased property belonging to Mesa Verde whom Kim has to evict to make way for the bank's new call center\n\nIntroduced in Breaking Bad [ edit ]\n\nEpisodes [ edit ]\n\nSeries overview for Better Call Saul Season Episodes Originally aired First aired Last aired 1 10 February 8, 2015 ( ) April 6, 2015 ( 2015-04-06 ) 2 10 February 15, 2016 ( ) April 18, 2016 ( 2016-04-18 ) 3 10 April 10, 2017 ( ) June 19, 2017 ( 2017-06-19 ) 4 10 August 6, 2018 ( ) October 8, 2018 ( 2018-10-08 ) 5 10 February 23, 2020 ( ) April 20, 2020 ( 2020-04-20 ) 6 13[82] April 18, 2022 ( ) [82] August 15, 2022 ( 2022-08-15 ) [83]\n\nSeason 1 (2015) [ edit ]\n\nTired of low-paying work including public defender cases, Jimmy works to represent Craig Kettleman, who is accused of embezzlement. Jimmy cares for his brother Chuck, who is housebound with a psychosomatic aversion to electricity and electric devices. While pursuing elder law cases, Jimmy discovers several seniors being defrauded by the Sandpiper retirement community. As the subsequent class action lawsuit against Sandpiper grows, Chuck suggests giving it to his law firm, Hamlin, Hamlin & McGill. Jimmy is devastated when he receives a small of counsel fee and the promise of a large share of any judgment or settlement, but is blocked from further participation. HHM brings in the Davis & Main firm to assist with the case. After the death of an old friend, Jimmy seems to find success when D&M offers to hire him because of his knowledge of the Sandpiper case.\n\nSeason 2 (2016) [ edit ]\n\nJimmy works as an associate at D&M, but quits after his creative, ostentatious legal style doesn't mesh with the firm's calm corporate demeanor. Kim is demoted because of Jimmy's actions. She secures Mesa Verde Bank as an HHM client, and Howard is happy to have the business but denies her credit. Kim quits HHM and opens a private practice in office space shared with Jimmy. Jimmy sabotages Chuck's work for Mesa Verde, which drops HHM and hires Kim. Nacho, a Mexican drug cartel lieutenant, hires Mike Ehrmantraut to remove his volatile captain, Tuco Salamanca. Instead of killing him, Mike arranges for Tuco to be imprisoned. Cartel elder Hector Salamanca grows suspicious and confronts Mike, who later attempts to assassinate Hector, but is mysteriously interrupted.\n\nSeason 3 (2017) [ edit ]\n\nChuck discovers Jimmy's fraud and tricks him into confessing, leading to suspension of Jimmy's law license. Gus stops Mike from killing Hector. Mike attacks Hector's trucks and steals $250,000 from one. Mike asks for help laundering the money. Gus arranges for Mike's hire as a contracted security expert at Madrigal and payment of monthly consulting fees. Hector plans to take over Manuel's business so Nacho attempts to kill Hector by changing his angina medication for a placebo. Hector suffers a stroke and Gus's first aid saves him, though he remains comatose. Jimmy's disciplinary hearing reveals that Chuck's electromagnetic hypersensitivity is not real. This revelation and Chuck's subsequent ouster from HHM leads to his suicide.\n\nSeason 4 (2018) [ edit ]\n\nJimmy regains his outgoing demeanor after Howard shoulders blame for Chuck's death. Jimmy manages a cell phone store during the suspension of his law license but makes more reselling prepaid phones to low-level criminals. His law license reinstatement is denied over lack of remorse for Chuck. After faking mourning, he successfully appeals, but reveals he is going to practice as Saul Goodman. Gus learns Nacho attempted to kill Hector and blackmails him into undermining the Salamancas. Mike escorts engineers who evaluate the site of Gus's industrial laundry for potential as an underground meth lab and Gus hires Werner to oversee construction. Hector recovers mentally and can move his right index finger. Lalo Salamanca arrives to run Hector's business.\n\nSeason 5 (2020) [ edit ]\n\nJimmy's law practice as Saul Goodman draws him into Albuquerque's drug trade and he is conflicted when Howard offers him a position at HHM. Kim balances her Mesa Verde and pro bono work with her own feelings for Jimmy, and finds herself employing the same conman-style tactics. Lalo's presence in Albuquerque forces Gus to halt construction of his meth lab. Nacho and Mike become pawns in the ongoing feud between the Salamancas and Gus. After Lalo is arrested for murder, he requests that Jimmy represent him and arrange bail, which nearly leads to Jimmy's murder. After an unsuccessful attempt on Lalo's life by Gus's hired assassins, Lalo discovers Nacho has betrayed him.\n\nSeason 6 (2022) [ edit ]\n\nThe sixth and final season is set to premiere on April 18, 2022, and will consist of 13 episodes.[77]\n\nTalking Saul [ edit ]\n\nTalking Saul is a live aftershow hosted by Chris Hardwick, which features guests discussing episodes of Better Call Saul. The show uses the same format as Talking Dead and Talking Bad, other aftershows hosted by Hardwick. AMC announced that Talking Saul would air after the second season Better Call Saul premiere on February 15, 2016, and again after the second-season finale on April 18, 2016.[84] It returned following the season 3 premiere and finale.[85]\n\nSeason 1 (2016) [ edit ]\n\nThese episodes discuss season two of Better Call Saul.\n\nSeason 2 (2017) [ edit ]\n\nThese episodes discuss season three of Better Call Saul.\n\nNo.\n\noverall No. in\n\nseason Episode discussed Guests Original air date U.S. viewers 3 1 \"Mabel\" Vince Gilligan, Peter Gould, Jonathan Banks and Rhea Seehorn April 10, 2017 ( ) 545,000[88] 4 2 \"Lantern\" Peter Gould, Patrick Fabian and Michael Mando; Michael McKean via satellite June 19, 2017 ( ) 589,000[89]\n\nBroadcast [ edit ]\n\nBetter Call Saul airs on cable network AMC. The series premiere drew in 4.4 million and 4 million in the 18–49 and 25–54 demographics, respectively, and received an overall viewership of 6.9 million.[90] This was the record for the highest-rated scripted series premiere in basic cable history, until it was surpassed later the same year by another AMC series, Fear the Walking Dead.[91]\n\nIn December 2013, Netflix announced that the entire first season would be available for streaming in the U.S. after the airing of the first-season finale, and in Latin America and Europe each episode would be available a few days after the episode airs in the U.S.[92] However, the first season was not released on Netflix in the U.S. until February 1, 2016.[93][94] Internationally, episodes of the second season became available the day after they aired in the U.S.[95]\n\nNetflix is the exclusive video-on-demand provider for the series and makes the content available in all its territories, except for Australia and New Zealand.[92] In Australia, Better Call Saul premiered on the streaming service Stan[96] on February 9, 2015, acting as the service's flagship program.[97] In New Zealand, the show was exclusive to the video-on-demand service Lightbox before moving to Neon in 2020 when both services were merged.[98][99] The episodes were available for viewing within three days of broadcast in the U.S.[100]\n\nIn the United Kingdom and Ireland, the series was acquired by Netflix on December 16, 2013,[101] and the first episode premiered on February 9, 2015, with the second episode released the following day. Every subsequent episode was released each week thereafter.[102] In India, the series was broadcast on Colors Infinity within 24 hours of the U.S. broadcast.[103]\n\nReception [ edit ]\n\nCritical response [ edit ]\n\nBetter Call Saul has received critical acclaim and is considered to be an outstanding example of how to successfully produce a prequel and spinoff work that defies expectations.[114] Many critics have called Better Call Saul a worthy successor to Breaking Bad and some have even deemed it superior to its predecessor. In September 2019, The Guardian ranked the show at No. 48 on its list of the 100 best TV shows of the 21st century, describing it as \"A supremely measured character piece that has steadily improved as its central tragedy has materialised.\"[115] In 2021, Empire ranked Better Call Saul at No. 27 on their list of The 100 Greatest TV Shows of All Time.[116]\n\nFor the first season, the review aggregator website Rotten Tomatoes reported a 97% approval rating, with an average rating of 8.03/10 based on 69 reviews. The website's critical consensus reads, \"Better Call Saul is a quirky, dark character study that manages to stand on its own without being overshadowed by the series that spawned it.\"[104] Metacritic, which uses a weighted average, assigned a \"generally favorable\" score of 78 based on 43 reviews.[105]\n\nThe second season has a 97% approval rating on Rotten Tomatoes, with an average score of 8.7/10 based on 31 reviews. The website's critical consensus reads, \"Better Call Saul continues to tighten its hold on viewers with a batch of episodes that inject a surge of dramatic energy while showcasing the charms of its talented lead.\"[106] On Metacritic, it has a score of 85 out of 100, based on 18 critics, indicating \"universal acclaim\".[107]\n\nThe third season has a 97% approval rating on Rotten Tomatoes, with an average score of 8.78/10 based on 39 reviews. The website's critical consensus is, \"Better Call Saul shows no signs of slipping in season 3, as the introduction of more familiar faces causes the inevitable transformation of its lead to pick up exciting speed.\"[108] On Metacritic, it has a score of 87 out of 100, based on 18 critics, indicating \"universal acclaim\".[109]\n\nThe fourth season has a 99% approval rating on Rotten Tomatoes, with an average score of 8.93/10 based on 36 reviews. The website's critical consensus states, \"Well-crafted and compelling as ever, Better Call Saul deftly balances the show it was and the one it will inevitably become.\"[110] On Metacritic, it has a score of 87 out of 100, based on 16 reviews, indicating \"universal acclaim\".[111]\n\nThe fifth season has a 99% approval rating on Rotten Tomatoes, with an average score of 8.95/10 based on 42 reviews. The website's critical consensus is, \"Grounded by Bob Odenkirk's endlessly nuanced, lived-in performance, Better Call Saul's fifth season is a darkly funny, vividly realized master class in tragedy.\"[112] On Metacritic, it has a score of 92 out of 100 based on 16 critics, indicating \"universal acclaim\".[113]\n\nRatings [ edit ]\n\nViewership and ratings per season of Better Call Saul Season Timeslot (ET) Episodes First aired Last aired Avg. viewers\n\n(millions) Date Viewers\n\n(millions) Date Viewers\n\n(millions) 1 Sunday 10:00 pm (premiere)\n\nMonday 10:00 pm 10 February 8, 2015 6.88[117] April 6, 2015 2.53[118] 3.21[119] 2 Monday 10:00 pm 10 February 15, 2016 2.57[86] April 18, 2016 2.26[120] 2.16[121] 3 10 April 10, 2017 1.81[122] June 19, 2017 1.85[123] 1.64[124] 4 Monday 9:00 pm 10 August 6, 2018 1.77[125] October 8, 2018 1.53[126] 1.49[127] 5 Sunday 10:00 pm (premiere)\n\nMonday 9:00 pm 10 February 23, 2020 1.60[128] April 20, 2020 1.59[129] 1.37[130]\n\nAccolades [ edit ]\n\nFor its first five seasons, Better Call Saul has received 39 Emmy Award nominations. It has been nominated for Outstanding Drama Series for each of its five seasons. Bob Odenkirk has received four nominations for Outstanding Lead Actor in a Drama Series. Jonathan Banks and Giancarlo Esposito have each been nominated for Outstanding Supporting Actor in a Drama Series; four times for Banks and twice for Esposito. The series has also received five nominations for Outstanding Writing for a Drama Series and one nomination for Outstanding Directing for a Drama Series.[131]\n\nHome media [ edit ]\n\nThe first season was released on Blu-ray and DVD in region 1 on November 10, 2015; bonus features include audio commentaries for every episode, uncensored episodes, deleted scenes, gag reel, and several behind-the-scenes featurettes. A limited edition Blu-ray set was also released with 3D packaging and a postcard vinyl of the Better Call Saul theme song by Junior Brown.[132] The second season was released on Blu-ray and DVD in region 1 on November 15, 2016; bonus features include audio commentaries for every episode and several behind-the-scenes featurettes.[133]\n\nThe third season was released on Blu-ray and DVD in region 1 on January 16, 2018; bonus features include audio commentaries for every episode and several behind-the-scenes featurettes.[134] The fourth season was released on Blu-ray and DVD in region 1 on May 7, 2019; bonus features include audio commentary for every episode and several behind-the-scenes featurettes.[135] The fifth season was released on Blu-ray and DVD in region 1 on November 24, 2020; bonus features include cast and crew audio commentaries on every episode, deleted scenes, and various behind-the-scenes featurettes.[136]\n\nOther media [ edit ]\n\nWeb series [ edit ]\n\nSince season three, AMC has released three separate ten-episode short series that feature a mix of live action and animated segments. Season three featured Los Pollos Hermanos Employee Training with Esposito portraying Gus, season four featured Madrigal Electromotive Security Training with Banks as Mike, and season five featured Ethics Training with Kim Wexler with Seehorn as Kim and side-voiceovers from Odenkirk as Jimmy. These were released over the course of each season on YouTube and through AMC's social media. Both Los Pollos Hermanos Employee Training and Ethics Training with Kim Wexler received the Primetime Emmy Award for Outstanding Short Form Comedy or Drama Series,[137][138] and while Madrigal Electromotive Security Training had been initially nominated, the Academy had to pull the nomination after discovering the show was too short (less than two minutes), though stated the pull was \"in no way a diminishment of the quality of Better Call Saul Employee Training or Mr. Banks's performance in it\".[139] For the sixth season, three new original short-form series were announced: animated series Slippin' Jimmy; Cooper's Bar directed by and starring Rhea Seehorn; and new episodes of the Better Call Saul Employee Training Video series.[77]\n\nAnimated series [ edit ]\n\nVariety reported in March 2021 that AMC was developing an animated spinoff series, Slippin' Jimmy.[140] The series, a prequel based on younger Jimmy and Chuck's time in Cicero, Illinois, is being developed by Ariel Levine and Kathleen Williams-Foshee, who have previously worked on the associated live-action web series.[141]\n\nSlippin' Jimmy was later revealed as a short-form series; a six-part animated series to be aired online during the sixth season of Better Call Saul. Told in the style of classic 70s-era cartoons, each episode is an ode to a specific movie genre — from Spaghetti Westerns and Buster Keaton to The Exorcist. The series will be produced by Rick and Morty animators Starburns and written by Levine and Williams-Foshee.[77]\n\nPodcast [ edit ]\n\nThe Better Call Saul Insider Podcast is a pre-recorded series which the creators gather to discuss the episode recently broadcast. Originally started as part of the Breaking Bad series, the podcast discusses the production of the show and features actors discussing their decisions and process of the characters they play. The crew also details their methods in deciding how an episode was shot. The show routinely includes the major cast, director and camera crew of the respective episodes.[142]\n\nComics [ edit ]\n\nAMC has released two digital comic books for Better Call Saul. The first, titled Better Call Saul: Client Development, released in February 2015, in advance of the series premiere, details the history of Saul and Mike, acting as a spin-off of the Breaking Bad episode that introduced Saul.[143] In February 2016, in advance of the second-season premiere, AMC released Better Call Saul: Saul Goodman and the Justice Consortium in the Clutches of the Judgernaut![144]\n\nNotes [ edit ]\n\n^ [10] The University of American Samoa is fictitious.", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/Michael_McKean_1999.jpg/125px-Michael_McKean_1999.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Bob_Odenkirk_by_Gage_Skidmore_2.jpg/125px-Bob_Odenkirk_by_Gage_Skidmore_2.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/Better_Call_Saul_logo.svg/250px-Better_Call_Saul_logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Jonathan_Banks_2012_2.jpg/125px-Jonathan_Banks_2012_2.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Michael_Mando_by_Gage_Skidmore.jpg/125px-Michael_Mando_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/Better_Call_Saul_logo.svg/1200px-Better_Call_Saul_logo.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/Old_Bernalillo_County_Courthouse.jpg/228px-Old_Bernalillo_County_Courthouse.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Vince_Gilligan_by_Gage_Skidmore_3.jpg/144px-Vince_Gilligan_by_Gage_Skidmore_3.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f1/Tony_Dalton_%28cropped%29.jpg/125px-Tony_Dalton_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/07/Cottonwood_Mall_Albuquerque_%28cropped%29.jpg/228px-Cottonwood_Mall_Albuquerque_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Giancarlo_Esposito_by_Gage_Skidmore_2.jpg/125px-Giancarlo_Esposito_by_Gage_Skidmore_2.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Peter_Gould_by_Gage_Skidmore.jpg/140px-Peter_Gould_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Patrick_Fabian_by_Gage_Skidmore.jpg/125px-Patrick_Fabian_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Wikivoyage-Logo-v3-icon.svg/27px-Wikivoyage-Logo-v3-icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Rhea_Seehorn_by_Gage_Skidmore.jpg/125px-Rhea_Seehorn_by_Gage_Skidmore.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/Better_Call_Saul_logo.svg/1200px-Better_Call_Saul_logo.svg.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Better_Call_Saul", "title": "Better Call Saul", "meta_data": {"generator": "MediaWiki 1.38.0-wmf.25", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/Better_Call_Saul_logo.svg/640px-Better_Call_Saul_logo.svg.png", "width": 640, "height": 310}, "title": "Better Call Saul - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}