{"url": "https://web.archive.org/web/20171024031442/https://www.gq.com/story/megyn-kelly-bill-oreilly-the-receipts", "text": "Pinterest Nathan Congleton/NBC/NBCU Photo Bank via Getty Images\n\nA rare look inside the network's culture of silence.\n\nFormer Fox News talking head and current sad old creep Bill O'Reilly left the network earlier this year after an avalanche of sexual harassment allegations caused advertisers to flee his stupid show en masse. Over the weekend, the New York Times published a report revealing that O'Reilly had settled with an accuser for an astonishing $32 million shortly before the upstanding citizens at Fox News signed him to a $100 million contract extension in February—a decision, one would presume, that it came to regret a few months later.\n\nO'Reilly, as usual, remains very, very mad about all of this. He continues to assert that no women complained about him during the entirety of his twenty-year tenure, and he punctuated his interview with the Times with things like \"This is horrible!\" and \"This is crap!\" and other normal things that well-balanced people say when they definitely didn't do the horrible things they've been accused of doing. On Monday, Megyn Kelly, a former O'Reilly colleague who left in January for NBC, went on the air to dispute his claims, reading from evidence obtained from a source she knows well: herself.\n\nKelly was one of the highest-profile alleged harassment victims of the late Roger Ailes, the former Fox News CEO who abruptly left the network in July 2016. (Sorry, keeping track of the men at Fox News who have resigned in disgrace amidst similar-sounding scandals is admittedly a challenging task.) During a November interview, a visibly incensed O'Reilly dismissed Kelly's accusations against Ailes by stating that he was \"not interested\" in \"litigating something... that makes my network look bad.\" In response, Kelly says she wrote to Fox News co-presidents Bill Shine and Jack Abernathy, criticizing O'Reilly for \"shaming women into shutting the hell up on grounds that it will disgrace the company.\" Shine, Kelly reveals, called her and promised to \"deal\" with it.\n\nBy 8 PM that night, O’Reilly had apparently been dealt with. And by that, I mean he was permitted, with management's advance notice and blessing, to go on the air and attack the company’s harassment victims yet again.\n\nFrom there, Kelly played a gross clip from that night's edition of The O'Reilly Factor, God rest its soul, during which the host opined that employees owe \"allegiance\" to their employer—a duty that, in his mind, apparently encompasses \"Being a good sport and not complaining about getting groped.\" She concluded:\n\nThis is not unique to Fox News. Women everywhere are used to being dismissed, ignored, or attacked when raising complaints about men in authority positions. They stay silent so often out of fear: Fear of ending their careers. Fear of lawyers, yes. And fear of public shaming, including through media. At Fox News, the media relations chief, Irina Briganti, is known for her vindictiveness. To this day she pushes negative articles on certain Ailes accusers, like the one you are looking at right now.\n\nBecause Bill O'Reilly's people are morons who think that you are a moron, too, they responded by releasing thank-you notes Kelly had purportedly sent to O'Reilly over the years, as if engaging in obligatory office pleasantries and watching one's complaints about vile harassment go unaddressed were somehow mutually exclusive.\n\nBetween her wildly irresponsible interviews of people like Alex Jones and the painfully embarrassing moments of manufactured lightheartedness like this one, characterizing Kelly's post-Fox News career as \"uneven\" would be charitable. It's difficult tough to take someone seriously as an investigative journalist and/or a purveyor of fun daytime fare when they've spent 15 years doing standard Fox News things like push racist conspiracy theories and opine that a teenage girl victimized by police brutality was \"no saint.\"\n\nKelly's issues aside, though, her segment on Monday—with names named and receipts produced—was a fascinating look inside Fox News' system for dealing with employee misconduct. Of course, all the available evidence indicates that it is a deeply broken organization that cares far more about protecting its most valuable assets than it does about ensuring that female employees have a safe place to work. By providing a concrete example of how this patented combination of greed and corruption has worked to silence women, though, Kelly makes the network's endemic culture of abuse more difficult than ever to trivialize, ignore, or dismiss.\n\nWatch Now:", "images": ["https://web.archive.org/web/20171024031442im_/https://media.gq.com/photos/59ecdb8a66e2d56abcd79fad/3:2/w_420/GettyImages-847524922.jpg", "https://web.archive.org/web/20171024031442im_/https://collector-pxhmjy2xc9.perimeterx.net/api/v1/collector/noScript.gif?appId=PXhmJY2XC9", "https://web.archive.org/web/20171024031442im_/https://media.gq.com/photos/59ee5e8724789d7510df1e8d/16:9/pass/screen%20shot%202017-10-23%20at%202.25.15%20pm.png", "https://web.archive.org/web/20171024031442im_/https://media.gq.com/photos/59ee7db724789d7510df1e9a/3:2/w_420/GettyImages-456788190.jpg", "https://web.archive.org/web/20171024031442im_/https://media.gq.com/photos/59ee5e5236b6d413fa363728/3:2/w_800/GettyImages-862911956.jpg"], "top_img": "https://web.archive.org/web/20171024031442im_/https://media.gq.com/photos/59ee5e8724789d7510df1e8d/16:9/pass/screen%20shot%202017-10-23%20at%202.25.15%20pm.png", "keywords": [], "authors": ["Jay Willis"], "canonical_link": "https://web.archive.org/web/20171024031442/https://www.gq.com/story/megyn-kelly-bill-oreilly-the-receipts", "title": "Megyn Kelly Shares Her Complaints About Bill O'Reilly That Fox News Allegedly Ignored", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "author": "Jay Willis", "copyright": "Copyright © Condé Nast 2017", "description": "Megyn Kelly shared old complaints about Bill O'Reilly that she had sent to superiors at Fox News, who then allegedly ignored her.", "keywords": "megyn kelly,bill o'reilly,fox news,sexual harassment", "news_keywords": "megyn kelly,bill o'reilly,fox news,sexual harassment", "fb": {"app_id": 606963029328755, "admins": 108943, "pages": 7962048097}, "og": {"site_name": "GQ", "title": "Megyn Kelly Offers Rare Look Into How Fox News Silences Alleged Victims of Sexual Harassment", "url": "https://web.archive.org/web/20171024031442/https://www.gq.com/story/megyn-kelly-bill-oreilly-the-receipts", "description": "She read from her old complaints about Bill O'Reilly on the air.", "image": "https://web.archive.org/web/20171024031442im_/https://media.gq.com/photos/59ee5e8724789d7510df1e8d/16:9/pass/screen%20shot%202017-10-23%20at%202.25.15%20pm.png", "type": "article"}, "article": {"section": "News & Culture", "published_time": "2017-10-23T21:39:46.938Z", "modified_time": "2017-10-23T21:39:45.543Z"}, "parsely-title": "Megyn Kelly Shares Her Complaints About Bill O'Reilly That Fox News Allegedly Ignored", "parsely-link": "https://www.gq.com/story/megyn-kelly-bill-oreilly-the-receipts", "parsely-type": "post", "parsely-image-url": "https://media.gq.com/photos/59ee5e8724789d7510df1e8d/master/w_790/screen%20shot%202017-10-23%20at%202.25.15%20pm.png", "parsely-pub-date": "2017-10-23T21:39:46.938Z", "parsely-section": "News & Culture", "parsely-author": "Jay Willis", "parsely-tags": "megyn kelly,bill o'reilly,fox news,sexual harassment", "twitter": {"card": "summary_large_image", "site": "@gqmagazine", "title": "Megyn Kelly Offers Rare Look Into How Fox News Silences Alleged Victims of Sexual Harassment", "description": "She read from her old complaints about Bill O'Reilly on the air.", "image": "https://web.archive.org/web/20171024031442im_/https://media.gq.com/photos/59ee5e8724789d7510df1e8d/16:9/pass/screen%20shot%202017-10-23%20at%202.25.15%20pm.png"}}, "movies": ["https://web.archive.org/web/20171024031442if_/https://www.youtube.com/embed/vGGEefKbc4k"], "publish_date": 1508794786.938, "source": "https://web.archive.org", "summary": ""}