{"url": "https://web.archive.org/web/20171028032327/https://www.glamour.com/story/taylor-swift-fashion-reputation-music-videos", "text": "As with any project she's attached to, the premiere of Taylor Swift 's \"Ready For It\" music video was preceded by heated anticipation, excited countdowns, and countless fan theories . The cyborg-showdown depicted in the three and a half-minute clip only unleashed more speculation concerning the \"hidden meanings\" she may or may not be folding into the work released during this Reputation era. (Why is “8919” written on the wall? Who are all of those robots? How many Joe Alwyn references are there, really?) All of these musings largely go back to how Swift presents herself because, on top of a new sound, she's got a brand-new aesthetic to go with it.\n\nAmid all of the action in the \"Ready For It\" video, the implications of her Blade Runner -esque costume can be overlooked—after all, she seemingly appeared nude in all the teasers for the clip, which obviously diverted the conversation slightly. But lo and behold, the futuristic storyline did provide some key fashion moments that indicate larger shift in how Swift uses clothing (or the lack thereof) to usher in the latest chapter of her career—and, of course, how this all shapes her reputation.\n\nPinterest PHOTO: Big Machine Records\n\nFrom the start, clothing plays a crucial part in setting the mood and establishing the premise for \"Ready For It.\" We see a hooded Taylor Swift, who some fans are calling Evil Taylor in their theories , strutting through a dark alleyway in thigh-grazing black sock boots, a black cape, and a black leotard, decorated with straps and harnesses. She then confronts Naked Taylor (or, semi-nude Taylor ), a robot version of herself who isn't wearing any clothing—until the latter bursts free of her cage. Both are wearing custom pieces by Jessica Jones Design.\n\nPinterest PHOTO: Big Machine Records\n\nFans have already interpreted this showdown as a battle between two different versions of Taylor's persona, a metaphor Swift has utilized in past music videos and used fashion to really drive home. She'll dress her villains in black, her heroines in white—and with the notable exception of Selena Gomez's cameo in \"Bad Blood,\" Swift plays both roles herself. (See: nerdy, white-dress Taylor versus the purple-clad popular Taylor in \"You Belong With Me,\" and the evolution from doting girlfriend in a Dolce & Gabbana gown to deranged ex with a thing for La Perla lingerie in \"Blank Space.\")\n\nSo if the wardrobe premise has been somewhat constant, what's different this time around? Simply put: the creatives behind the clothes Swift chooses to wear.\n\nPinterest PHOTO: Big Machine Records\n\nIn the lull between premieres, fans track down paparazzi photos of the singer as she records these music videos, often identifying the exact pieces she's wearing on set long before we get a good look and them. And the New Taylor has a thing for the most zeitgeist-y designers in the industry—ones that, if you asked is in 2014, we would never have thought to be hanging in her closet. She's worn sequined graphic hoodies and snake boots by Gucci, a blood-red ball gown by Balmain, a cape by Balenciaga, and thigh-high footwear and jackets by Vetements. If reading off the items in Swift’s latest videos feels like a throwback to the chorus of Kreayshawn’s 2011 “Gucci Gucci,” you're not wrong: Swift is stocking up on designers that have their own reputations for edgy, boundary-pushing, and somewhat over-the-top apparel.\n\nPinterest PHOTO: Big Machine Records\n\nIn the past year and a half, Swift has notably retreated from the public eye (and her famous squad.) That means that the Taylor Swift we see in her music videos (or in related clips posted on her verified Youtube page) is the only Taylor Swift we get through imagery. It also means that every time she posts a new photo or video, it opens up the floodgates for speculation, fan theories, and over-interpretation of every last detail. What she wears in these rare moments she opens herself up to the public carries more meaning, as do the designers she picks. Swift likely knows this, so the labels she's been selecting feel very much deliberate in getting her new #brand across.\n\nThink about the labels she's been wearing in all Reputation -related media. It's been a mix of luxe brands that bring together streetwear, punk, and an IDGAF attitude—like anything designed by Demna Gvasalia, Alessandro Michele, and Donatella Versace, folks with venerable histories of pushing the envelope. (Same goes for her style off-camera, where she's been wearing Faith Connexion , Valentino , and Unravel .) With these pieces, Swift sends a message: She’s done with the innocent, er, reputation she’s built up, and is replacing it with something harder and more self-assured. Coming out of a three-year hiatus from music, she needs the most recognizably influential designers in her corner—or, at the very least, she needs to demonstrate she knows what's in the zeitgeist.\n\nPinterest PHOTO: Big Machine Records\n\nWe're already seeing Swift's assertively luxurious rebrand at work in the first two Reputation music videos, though it's especially apparent in \"Look What You Made Me Do.\" She robs a bank, referencing her many lawsuits and hold-outs against music industry titans like Apple and Spotify, while wearing a sequined Gucci sweatshirt. Sitting on a throne surrounded by snakes, she literally sips tea in a slinky Balmain gown—a brand preferred by the Kardashian-Jenner clan. Her biker gang (a second squad?) is outfitted in studded Burberry leather jackets. Her dance sequence is performed in a tall pair of Fendi boots. The old Taylor can't come to the phone right now... but probably because she's looking for her white dresses.\n\nPinterest PHOTO: Big Machine Records\n\nOf course, reinvention doesn't happen in just the span of two music videos—not when there are six albums over eleven years to contrast with her current aesthetic. A little over a decade ago, listeners became acquainted with the singer through the video for \"Our Song,\" which was released in 2006; in it, she wears a frilly lilac prom dress for its entirety.\n\nSwift mostly stayed along that stylistic straight-and-narrow throughout the 11 years since: light colors, poofy skirts, lots of sparkle, and nothing at all risqué. She was partial to the work of KaufmanFranco and J.Mendel, both award show favorites. She made it a point to not wear high-end designers in her early music videos, so that her audience could relate. Eventually, though, as her music matured, so did her wardrobe, and she began calling in Valentino and Dior. Though, in a Glamour cover story from 2014, she did say she still wasn't inclined to wear fur, animal print, spiked clothing, or boxy shoulders.\n\nPinterest PHOTO: Big Machine Records\n\nEveryone's styles evolve as they grow older. Swift's is no exception. (And she's talked about it .) The difference is that her entire musical career has been built on wearing her heart on her sleeve and, well, caring. Her relatability reached audiences through her vulnerable lyrics and outfits that, while certainly expensive, weren't exclusively couture. (Her side-business enterprises included, among other things, an affordable sundress line with Walmart.) Over the years, this approach has attracted criticism of appearing too \"calculated,\"a word she hates according to her GQ cover story from 2015. But she's admitted to using her outfits as a way to maintain that squeaky-clean image she put forth through her music: She once told the Guardian that being perceived as sexy was \"not really on [her] radar.\"\n\nIn her music videos, her costumes reinforced themes in her music, such as in the climactic moment in “You Belong With Me,” when Swift's nerdy protagonist shows up to the prom in a beautiful white dress to win over the subject of her affection; or in “Teardrops On My Guitar,” when she lounges at home in a blue evening gown while musing about unjust heartbreak; or in “Love Story,” when she literally wore a medieval ball gown while playing the Juliet to an actor's Romeo. Across the truly wide spectrum of situations the singer found herself depicted in these videos, Swift illustrated her music's concepts (and portrayed herself) in demure but dreamy dresses as her star began to rise.\n\nPinterest PHOTO: Big Machine Records\n\nEven as her sound strayed from its country roots and into the pop sphere, what she wore in music videos didn't entirely abandon this foundation: Her Speak Now and Red days were defined by retro separates and breezy frocks. By the time “We Are Never Ever Getting Back Together” and “22” came around, she was wearing high-waisted shorts and graphic tees, inching towards a more modern look without undergoing a full fashion rebellion—not nearly the pivot we're seeing in \"Look What You Made Me Do\" and \"Ready For It.\"\n\nPinterest PHOTO: Big Machine Records\n\n1989 marked her greatest style shift pre- Reputation : Suddenly, Swift lived in New York and was all about bedazzled bodysuits and revealing cut-outs. Even with her new arsenal of sparkly “pop star” costumes, Taylor Swift was still Taylor Swift—however, she was at the height of her career, and she had the superstar wardrobe to match it. Look at “Blank Space,” “Wildest Dreams,” and “Out of the Woods” for proof: All three videos incorporate gowns by Elie Saab, Valentino, and Oscar de la Renta. Luxury—whether it be in one of these gowns or a star-studded group of friends appearing at her concerts—became an integral part of her image alongside the hallmark revealing lyrics of her songs.\n\nPinterest PHOTO: Big Machine Records\n\nThere was an outlier, of course—\"Bad Blood. According to Billboard , Swift turned to a literal sex shop, the Stockroom, to supply $13,000 worth of patent harnesses and bra tops to her army of models. But unlike the Balenciaga cape she wore in \"Look What You Made Me Do,\" these outfits weren't making a point about her persona at large. This was a one-off in a collection of prime Swift-ian moments, with stellar gowns and handsome leading men. She had already insisted during this period that looking sexy or dangerous wasn't part of her M.O., leading us all to believe that these costumes were what anyone would choose for a superhero squad. Swift remained the hero she had played in past videos—just in latex.\n\nPinterest PHOTO: Big Machine Records\n\nHad she left thigh-high Fendi boots and studded Burberry coats at \"Look What You Made Me Do,\" it would have been another one-off—a cruise down memory lane, another device to move forward the plot in under four minutes. But there's also Cyborg Taylor Swift from \"Ready For It,\" and the Gucci combat boots and Vetements jacket she was photographed wearing on set for a yet-to-be-released Reputation video. These styling elements are building towards something greater: Taylor Swift is seriously leaning into fashion to reinvent herself in the public eye.\n\n“Going through different phases is one of my favorite things about fashion,\" Swift told Vogue in 2016. \"I love how it can mark the passage of time. It’s similar to my songs in that way—it all helps identify where I was at in different points of my life.”\n\nPinterest PHOTO: Big Machine Records\n\nPut them together, and the fashion of \"Look What You Made Me Do\" and \"Ready For It\" shows us that the old Taylor really is dead—sartorially speaking, at least. If we see a poofy princess gown or sparkly leotard return from the archives, it's more likely a dig at her old self than a hint that she's up to her old styling tricks. So long as we only see Taylor Swift through her music videos, she's fully in control of her Reputation image—and it's going to be a dark, edgy, IDFWU aesthetic from here on out. The only fault in her formulated new image? We can't forget about her past ones.\n\nRelated Stories:\n\nTaylor Swift Just Confirmed Several Theories About Her 'Ready for It' Video\n\nHow to Dress Like the New Taylor Swift, According to Taylor Swift\n\nAnother Taylor Swift Doppelgänger Is Freaking Out the Internet", "images": ["https://web.archive.org/web/20171028032327im_/https://media.glamour.com/photos/59f3986a8c6db22bfab3de41/master/w_1280,c_limit/taylor-swift-ready-for-it-outfit-shot-1.jpg", "https://web.archive.org/web/20171028032327im_/https://media.glamour.com/photos/59f33db8f67f7204bb561a71/master/w_1280,c_limit/rehost-2016-9-13-78ce6871-4ba2-46e3-a49f-43416088e61f.png", "data:image/gif;base64,R0lGODlhAQABAIABAP///wAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://web.archive.org/web/20171028032327im_/https://media.glamour.com/photos/59f33c695b645f2e900dd939/master/w_1280,c_limit/Reputation-Taylor-Swift.png", "https://web.archive.org/web/20171028032327im_/https://media.glamour.com/photos/59f33d66ad714a335821fcd8/master/w_1280,c_limit/taylor-swift-you-belong-with-me-dress.png", "https://web.archive.org/web/20171028032327im_/https://media.glamour.com/photos/59f33dffd60b30611849af5d/master/w_1280,c_limit/07-taylor-swift-look-what-you-made-me-do-screenshot-2017-billboard-1548.jpg", "https://web.archive.org/web/20171028032327im_/https://covers.conde.io/images_covers/cover_glamour_105.jpg", "https://web.archive.org/web/20171028032327im_/https://s3.amazonaws.com/assets.condenastdigital.com/glm/images/tote.png", "https://web.archive.org/web/20171028032327im_/https://media.glamour.com/photos/59f397ecd945514f9f01d824/master/pass/taylor-swift-ready-for-it-social.jpg", "https://web.archive.org/web/20171028032327im_/https://media.glamour.com/photos/59f33d945b645f2e900dd93d/master/w_1280,c_limit/Screen%2520Shot%25202017-10-25%2520at%25204.30.13%2520PM.png", "https://web.archive.org/web/20171028032327im_/https://media.glamour.com/photos/59f33ccc5b645f2e900dd93b/master/w_1280,c_limit/13-taylor-swift-look-what-you-made-me-do-screenshot-2017-billboard-1548.jpg", "https://web.archive.org/web/20171028032327im_/https://www.glamour.com/static/images/conde-logo.png", "https://web.archive.org/web/20171028032327im_/https://media.glamour.com/photos/59f33ca5558b186fd1bcdc75/master/w_1280,c_limit/taylor-swift-music-video-01.jpg", "https://web.archive.org/web/20171028032327im_/https://media.glamour.com/photos/59f398b55b645f2e900dd968/master/w_1280,c_limit/two-taylors-ready-for-it.jpg", "https://web.archive.org/web/20171028032327im_/https://media.glamour.com/photos/59f397d85b645f2e900dd966/master/w_644,c_limit/taylor-swift-ready-for-it-lede-image.jpg", "https://web.archive.org/web/20171028032327im_/https://media.glamour.com/photos/59f33ddbad714a335821fcda/master/w_1280,c_limit/o-BAD-BLOOD-facebook.jpg", "https://web.archive.org/web/20171028032327im_/https://media.glamour.com/photos/59f33d37f67f7204bb561a6f/master/w_1280,c_limit/taylor-swift-our-song-dress.jpg", "https://web.archive.org/web/20171028032327im_/https://media.glamour.com/photos/59f33cf7ad714a335821fcd6/master/w_1280,c_limit/06-taylor-swift-look-what-you-made-me-do-screenshot-2017-billboard-1548.jpg"], "top_img": "https://web.archive.org/web/20171028032327im_/https://media.glamour.com/photos/59f397ecd945514f9f01d824/master/pass/taylor-swift-ready-for-it-social.jpg", "keywords": [], "authors": ["Halie Lesavage", "Rachel Nussbaum", "Anna Moeslein", "Maggie Mallon", "Christopher Rosa", "October"], "canonical_link": "https://web.archive.org/web/20171028032327/https://www.glamour.com/story/taylor-swift-fashion-reputation-music-videos", "title": "How Taylor Swift is Counting on Fashion to Change Her 'Reputation'", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "width=device-width, initial-scale=1, maximum-scale=1.0, user-scalable=no", "msapplication-config": "/static/browserconfig.xml", "theme-color": "#ffffff", "author": "Halie LeSavage", "copyright": "Copyright © Condé Nast 2017", "description": "Taylor Swift has adopted a distinct look with each phase in her career. 'Reputation' marks her biggest style transformation yet. See why, here.", "keywords": "Taylor Swift,fashion", "application-name": "Glamour Magazine", "fb": {"app_id": 101358874221, "pages": 26815555478}, "og": {"site_name": "Glamour", "title": "How Taylor Swift is Counting on Fashion to Change Her 'Reputation'", "url": "https://web.archive.org/web/20171028032327/https://www.glamour.com/story/taylor-swift-fashion-reputation-music-videos", "description": "Taylor Swift has adopted a distinct look with each phase in her career—and 'Reputation' marks her biggest style transformation yet.", "type": "article", "image": "https://web.archive.org/web/20171028032327im_/https://media.glamour.com/photos/59f397ecd945514f9f01d824/master/pass/taylor-swift-ready-for-it-social.jpg"}, "twitter": {"card": "summary_large_image", "site": "glamourmag", "title": "How Taylor Swift is Counting on Fashion to Change Her 'Reputation'", "description": "Taylor Swift has adopted a distinct look with each phase in her career—and 'Reputation' marks her biggest style transformation yet.", "image": {"src": "https://media.glamour.com/photos/59f397ecd945514f9f01d824/master/pass/taylor-swift-ready-for-it-social.jpg?mbid=social_retweet"}, "domain": "www.glamour.com"}}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}